[
    {
        "date": "2024-07-29T12:00:00+00:00",
        "title": "Nu Skin Sets New GUINNESS WORLD RECORDS™ Title for the Most People Packing Meal Kits in 24 Hours",
        "content": "2,196 people actively participated in packing meal kits during 24 hours (Photo: Business Wire) Nu Skin volunteers help pack meals for hungry kids throughout the United States (Photo: Business Wire) Nu Skin volunteers packed more than 550,000 healthy meals (Photo: Business Wire) Nu Skin Sets New GUINNESS WORLD RECORDS™ Title for the Most People Packing Meal Kits in 24 Hours (Graphic: Business Wire)\n\nTo celebrate the company’s 40th anniversary, sales leaders, employees and local partners packed more than 550,000 meals for children throughout the United States\n\nPROVO, Utah, July 29, 2024--(BUSINESS WIRE)--Nu Skin Enterprises, Inc. (NYSE: NUS), a global leader in beauty and wellness, today announced a new GUINNESS WORLD RECORDS title for the Most People Packing Meal Kits in 24 Hours.\n\nNu Skin hosted a service event at the Salt Palace Convention Center in Salt Lake City where 2,196 people actively participated in packing meal kits during a 24-hour period. The project began July 25 at 6 p.m. and concluded 24 hours later. The service project coincided with Nu Skin L!VE West, a sales leader conference celebrating the company’s 40th anniversary. Nu Skin collaborated with other organizations, including MTN OPS, Utah Jazz, Hunger Fight, Swire Coca-Cola, and Ashbury Automotive Group to fill the convention center and pack more than 550,000 healthy meals. Convoy of Hope and the Utah Food Bank plan to use the packed meal kits to support children in need throughout the United States.\n\n\"Forty years ago, Nu Skin was built on a foundation to being a force for good in the world,\" said Ryan Napierski, president and CEO. \"Our journey has been nothing short of incredible, and to celebrate, we wanted to give back to the community in a record-setting way. Being a force for good in this world is at the heart of everything that we do, and we look forward to continuing to give back in the years to come.\"\n\nEach year, Nu Skin hosts a Force for Good Day in nearly 50 markets throughout the world to celebrate the company’s founding and give back to local communities. In the U.S., Nu Skin hosted this record-breaking event for its annual day of celebration. Other global service projects include:\n\nEurope: Mentored children in Malawi and assembled first aid kits for those in war-torn countries. Indonesia: Made crafts with local children suffering from congenital heart failure. Japan: Sorted and collected food for children living in single-parent households. Korea: Packed lunch boxes for World Vision Korea. Mainland China: Supported numerous schools with stationery, sporting goods and books. Also picked up trash for World Environment Day. Pacific: Hosted a blood drive for the Australian Red Cross. Singapore: Partnered with a local food bank to distribute food to the needy. Southeast Asia: Restocked community refrigerators with unsold fruits and vegetables to feed the underprivileged. Taiwan: Collected shoes, clothing and school bags for needy children. Thailand: Packed gift bags for the Pediatric Cardiac Surgery Foundation.\n\nStory continues\n\nAbout Guinness World Records\n\nWhat’s the fastest game bird in Europe? This was the question that inspired the founding of Guinness World Records back in 1955. Starting with a single book published from a room above a gym, GWR has grown to become a global multi-media brand, with offices in London, New York, Miami, Beijing, Tokyo and Dubai. Today, GWR delivers world-class content, not just through books, but via TV shows, social media and live events. GWR’s in-house consultancy works closely with brands and businesses around the world to harness the power of record-breaking and deliver award-winning campaigns and business solutions. GWR’s ultimate purpose is to inspire people – individuals, families, schools, groups, companies, communities and even entire countries – to read about, watch, listen to and participate in record-breaking. To join this record-breaking community – and find out the answer to that original question – visit guinnessworldrecords.com.\n\nAbout Nu Skin Enterprises, Inc.\n\nThe Nu Skin Enterprises Inc. (NYSE: NUS) family of companies includes Nu Skin and Rhyz Inc. Nu Skin is an integrated beauty and wellness company, powered by a dynamic affiliate opportunity platform, which operates in nearly 50 markets worldwide. Backed by 40 years of scientific research, the company’s products help people look, feel and live their best with brands including Nu Skin® personal care, Pharmanex® nutrition and ageLOC® anti-aging, which includes an award-winning line of beauty device systems. Formed in 2018, Rhyz is a synergistic ecosystem of consumer, technology and manufacturing companies focused on innovation within the beauty, wellness and lifestyle categories.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240729413403/en/\n\nContacts\n\nMedia: media@nuskin.com, (801) 345-6397\r\nInvestors: investorrelations@nuskin.com, (801) 345-3577\n\nView comments",
        "link": "https://finance.yahoo.com/news/nu-skin-sets-guinness-world-120000921.html",
        "symbols": [
            "NUS.BE",
            "NUS.MU",
            "NUS.STU",
            "NUS.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.013,
            "neu": 0.846,
            "pos": 0.141
        }
    },
    {
        "date": "2024-07-26T18:00:00+00:00",
        "title": "Nu Skin Surpasses 850 Million Meals Purchased and Donated in its Fight Against Child Malnutrition",
        "content": "Nu Skin celebrates its milestone of 850 million meals purchased and donated in its fight against child malnutrition. (Photo: Business Wire)\n\nThe company’s Nourish the Children initiative feeds thousands of children each day\n\nPROVO, Utah, July 26, 2024--(BUSINESS WIRE)--Nu Skin Enterprises, Inc. (NYSE: NUS), a global leader in beauty and wellness, today announced it has reached the milestone of providing 850 million meals for children since 2002 through its Nourish the Children initiative. Malnourished children in more than 65 countries around the world have been fed VitaMeal,* a nutrient-dense food, from one of the company’s third-party charity partners after Nu Skin sales leaders, customers or employees purchase and donate bags of food.\n\n\"When we started the Nourish the Children initiative more than 20 years ago, we could have never imagined the sustained impact it would have on so many children,\" said Ryan Napierski, president and CEO at Nu Skin. \"It’s humbling to think about the impact of providing 850 million meals to malnourished children around the world. The collective good that we do as a company is a testament to our sales force, customers and employees.\"\n\nAbout VitaMeal\n\nUnlike simple grains with a mostly caloric benefit, VitaMeal is a nutrient-dense food scientifically formulated to meet the nutritional needs of malnourished children. As part of the overall development of VitaMeal, Nu Skin's nutritional scientists determined the ingredients and ratios that are well suited for a malnourished child. The result is a product that provides essential vitamins and minerals, with a balance of carbohydrates, protein, fat and fiber.\n\nAbout Nourish the Children\n\nIn 2002, Nu Skin took action to address the tragedy of childhood hunger and malnutrition with the development of the Nourish the Children initiative with a highly nutritious food known as VitaMeal, developed by Nu Skin's nutritional scientists. The company's sales leaders, customers and employees can purchase VitaMeal and then choose to keep it or donate the food to a third-party nonprofit organization that specializes in distributing relief to those suffering from malnutrition and famine.\n\nAbout Nu Skin Enterprises, Inc.\n\nThe Nu Skin Enterprises Inc. (NYSE: NUS) family of companies includes Nu Skin and Rhyz Inc. Nu Skin is an integrated beauty and wellness company, powered by a dynamic affiliate opportunity platform, which operates in nearly 50 markets worldwide. Backed by 40 years of scientific research, the company's products help people look, feel and live their best with brands including Nu Skin® personal care, Pharmanex® nutrition and ageLOC® anti-aging, which includes an award-winning line of beauty device systems. Formed in 2018, Rhyz is a synergistic ecosystem of consumer, technology and manufacturing companies focused on innovation within the beauty, wellness and lifestyle categories.\n\nStory continues\n\n* Nu Skin is a for-profit distributor of nutritional and skin care products and is traded on the New York Stock Exchange (NUS). Nourish the Children is an initiative of Nu Skin and is registered in some states as a commercial co-venture. The initiative enables Nu Skin’s Brand Affiliates and customers to purchase VitaMeal from Nu Skin and donate it to charitable organizations to help solve the complex world problem of feeding malnourished children. The price of VitaMeal includes the cost of manufacturing, general overhead, distribution and sales. As is the case with other Nu Skin products, Brand Affiliates are paid commissions and Nu Skin earns a profit margin from each sale of VitaMeal.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240726855752/en/\n\nContacts\n\nMedia: media@nuskin.com, (801) 345-6397\r\nInvestors: investorrelations@nuskin.com, (801) 345-3577\n\nView comments",
        "link": "https://finance.yahoo.com/news/nu-skin-surpasses-850-million-180000377.html",
        "symbols": [
            "NUS.BE",
            "NUS.MU",
            "NUS.STU",
            "NUS.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.996,
            "neg": 0.024,
            "neu": 0.847,
            "pos": 0.129
        }
    },
    {
        "date": "2024-07-26T08:05:11+00:00",
        "title": "Reflecting On Personal Care Stocks’ Q1 Earnings: Nu Skin (NYSE:NUS)",
        "content": "Reflecting On Personal Care Stocks’ Q1 Earnings: Nu Skin (NYSE:NUS)\n\nWrapping up Q1 earnings, we look at the numbers and key takeaways for the personal care stocks, including Nu Skin (NYSE:NUS) and its peers.\n\nWhile personal care products products may seem more discretionary than food, consumers tend to maintain or even boost their spending on the category during tough times. This phenomenon is known as \"the lipstick effect\" by economists, which states that consumers still want some semblance of affordable luxuries like beauty and wellness when the economy is sputtering. Consumer tastes are constantly changing, and personal care companies are currently responding to the public’s increased desire for ethically produced goods by featuring natural ingredients in their products.\n\nThe 13 personal care stocks we track reported a mixed Q1; on average, revenues beat analyst consensus estimates by 0.8%. while next quarter's revenue guidance was 7.5% below consensus. Inflation progressed towards the Fed's 2% goal at the end of 2023, leading to strong stock market performance. The start of 2024 has been a bumpier ride, as the market switches between optimism and pessimism around rate cuts due to mixed inflation data, and while some of the personal care stocks have fared somewhat better than others, they collectively declined, with share prices falling 1.9% on average since the previous earnings results.\n\nNu Skin (NYSE:NUS)\n\nWith person-to-person marketing and sales rather than selling through retail stores, Nu Skin (NYSE:NUS) is a personal care and dietary supplements company that engages in direct selling.\n\nNu Skin reported revenues of $417.3 million, down 13.3% year on year, falling short of analysts' expectations by 3.5%. Overall, it was a slower quarter for the company with full-year revenue guidance missing analysts' expectations and a miss of analysts' gross margin estimates. Nu Skin Total Revenue\n\nThe stock is down 13.4% since reporting and currently trades at $10.75.\n\nRead our full report on Nu Skin here, it's free.\n\nBest Q1: The Honest Company (NASDAQ:HNST)\n\nCo-founded by actress Jessica Alba, The Honest Company (NASDAQ:HNST) sells diapers and wipes, skin care products, and household cleaning products.\n\nThe Honest Company reported revenues of $86.22 million, up 3.4% year on year, outperforming analysts' expectations by 3.5%. It was a stunning quarter for the company with an impressive beat of analysts' earnings estimates. The Honest Company Total Revenue\n\nThe market seems happy with the results as the stock is up 37.1% since reporting. It currently trades at $4.03.\n\nIs now the time to buy The Honest Company? Access our full analysis of the earnings results here, it's free.\n\nStory continues\n\nWeakest Q1: USANA (NYSE:USNA)\n\nGoing to market with a direct selling model rather than through traditional retailers, USANA Health Sciences (NYSE:USNA) manufactures and sells nutritional, personal care, and skincare products.\n\nUSANA reported revenues of $212.9 million, down 10.6% year on year, falling short of analysts' expectations by 3.7%. It was a weak quarter for the company with underwhelming earnings guidance for the full year and a miss of analysts' earnings estimates.\n\nUSANA had the weakest performance against analyst estimates in the group. As expected, the stock is down 8.7% since the results and currently trades at $41.85.\n\nRead our full analysis of USANA's results here.\n\ne.l.f. (NYSE:ELF)\n\ne.l.f. Beauty (NYSE:ELF), which stands for ‘eyes, lips, face’, offers high-quality beauty products at accessible price points.\n\ne.l.f. reported revenues of $321.1 million, up 71.4% year on year, surpassing analysts' expectations by 9.8%. Overall, it was a mixed quarter for the company with an impressive beat of analysts' earnings estimates but underwhelming earnings guidance for the full year.\n\ne.l.f. delivered the biggest analyst estimates beat and fastest revenue growth, but had the weakest full-year guidance update among its peers. The stock is up 9.6% since reporting and currently trades at $170.55.\n\nRead our full, actionable report on e.l.f. here, it's free.\n\nBeautyHealth (NASDAQ:SKIN)\n\nOperating in the emerging beauty health category, the appropriately named BeautyHealth (NASDAQ:SKIN) is a skincare company best known for its Hydrafacial product that cleanses and hydrates skin.\n\nBeautyHealth reported revenues of $81.4 million, down 5.7% year on year, in line with analysts' expectations. More broadly, it was a mixed quarter for the company with an impressive beat of analysts' earnings estimates but revenue guidance for next quarter missing analysts' expectations.\n\nThe stock is down 47.9% since reporting and currently trades at $1.87.\n\nRead our full, actionable report on BeautyHealth here, it's free.\n\nJoin Paid Stock Investor Research\n\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.\n\nView comments",
        "link": "https://finance.yahoo.com/news/reflecting-personal-care-stocks-q1-080511321.html",
        "symbols": [
            "0EF.STU",
            "ELF.US",
            "HNST.US",
            "NUS.BE",
            "NUS.MU",
            "NUS.STU",
            "NUS.US",
            "SKIN.US",
            "USNA.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.034,
            "neu": 0.819,
            "pos": 0.147
        }
    },
    {
        "date": "2024-07-26T08:02:53+00:00",
        "title": "Spotting Winners: Herbalife (NYSE:HLF) And Personal Care Stocks In Q1",
        "content": "Spotting Winners: Herbalife (NYSE:HLF) And Personal Care Stocks In Q1\n\nThe end of an earnings season can be a great time to discover new stocks and assess how companies are handling the current business environment. Let’s take a look at how Herbalife (NYSE:HLF) and the rest of the personal care stocks fared in Q1.\n\nWhile personal care products products may seem more discretionary than food, consumers tend to maintain or even boost their spending on the category during tough times. This phenomenon is known as \"the lipstick effect\" by economists, which states that consumers still want some semblance of affordable luxuries like beauty and wellness when the economy is sputtering. Consumer tastes are constantly changing, and personal care companies are currently responding to the public’s increased desire for ethically produced goods by featuring natural ingredients in their products.\n\nThe 13 personal care stocks we track reported a mixed Q1; on average, revenues beat analyst consensus estimates by 0.8%. while next quarter's revenue guidance was 7.5% below consensus. Valuation multiples for many growth stocks have not yet reverted to their early 2021 highs, but the market was optimistic at the end of 2023 due to cooling inflation. The start of 2024 has been a different story as mixed signals have led to market volatility, and while some of the personal care stocks have fared somewhat better than others, they collectively declined, with share prices falling 1.6% on average since the previous earnings results.\n\nHerbalife (NYSE:HLF)\n\nWith the first products sold out of the trunk of the founder’s car, Herbalife (NYSE:HLF) today offers a portfolio of shakes, supplements, personal care products, and weight management programs to help customers reach their nutritional and fitness goals.\n\nHerbalife reported revenues of $1.26 billion, flat year on year, in line with analysts' expectations. Overall, it was an ok quarter for the company with an impressive beat of analysts' earnings estimates but a miss of analysts' organic revenue growth estimates.\n\n“We achieved our second consecutive quarter of year-over-year net sales growth. We are laser focused on cost reductions, which drove outperformance of our Adjusted EBITDA1 guidance,” said Michael Johnson, Chairman and CEO. Herbalife Total Revenue\n\nThe stock is up 36.1% since reporting and currently trades at $11.83.\n\nIs now the time to buy Herbalife? Access our full analysis of the earnings results here, it's free.\n\nBest Q1: The Honest Company (NASDAQ:HNST)\n\nCo-founded by actress Jessica Alba, The Honest Company (NASDAQ:HNST) sells diapers and wipes, skin care products, and household cleaning products.\n\nStory continues\n\nThe Honest Company reported revenues of $86.22 million, up 3.4% year on year, outperforming analysts' expectations by 3.5%. It was a stunning quarter for the company with an impressive beat of analysts' earnings estimates. The Honest Company Total Revenue\n\nThe market seems happy with the results as the stock is up 37.1% since reporting. It currently trades at $4.03.\n\nIs now the time to buy The Honest Company? Access our full analysis of the earnings results here, it's free.\n\nWeakest Q1: USANA (NYSE:USNA)\n\nGoing to market with a direct selling model rather than through traditional retailers, USANA Health Sciences (NYSE:USNA) manufactures and sells nutritional, personal care, and skincare products.\n\nUSANA reported revenues of $212.9 million, down 10.6% year on year, falling short of analysts' expectations by 3.7%. It was a weak quarter for the company with underwhelming earnings guidance for the full year and a miss of analysts' earnings estimates.\n\nUSANA posted the weakest performance against analyst estimates in the group. As expected, the stock is down 8.7% since the results and currently trades at $41.85.\n\nRead our full analysis of USANA's results here.\n\nNu Skin (NYSE:NUS)\n\nWith person-to-person marketing and sales rather than selling through retail stores, Nu Skin (NYSE:NUS) is a personal care and dietary supplements company that engages in direct selling.\n\nNu Skin reported revenues of $417.3 million, down 13.3% year on year, falling short of analysts' expectations by 3.5%. Zooming out, it was a slower quarter for the company with full-year revenue guidance missing analysts' expectations and a miss of analysts' gross margin estimates.\n\nThe stock is down 13.4% since reporting and currently trades at $10.75.\n\nRead our full, actionable report on Nu Skin here, it's free.\n\nOlaplex (NASDAQ:OLPX)\n\nRising to fame on TikTok because of its “bond building\" hair products, Olaplex (NASDAQ:OLPX) offers products and treatments that repair the damage caused by traditional heat and chemical-based styling goods.\n\nOlaplex reported revenues of $98.91 million, down 13.1% year on year, surpassing analysts' expectations by 3.9%. More broadly, it was a mixed quarter for the company with a decent beat of analysts' gross margin estimates but a miss of analysts' earnings estimates.\n\nThe stock is up 53.6% since reporting and currently trades at $2.15.\n\nRead our full, actionable report on Olaplex here, it's free.\n\nJoin Paid Stock Investor Research\n\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.\n\nView comments",
        "link": "https://finance.yahoo.com/news/spotting-winners-herbalife-nyse-hlf-080253610.html",
        "symbols": [
            "HLF.US",
            "HNST.US",
            "HOO.BE",
            "HOO.MU",
            "HOO.STU",
            "NUS.US",
            "OLPX.US",
            "USJ.MU",
            "USJ.STU",
            "USNA.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.044,
            "neu": 0.774,
            "pos": 0.182
        }
    },
    {
        "date": "2024-07-19T20:28:37+00:00",
        "title": "Sell These 3 Stocks Before the Upcoming Recession",
        "content": "In today’s volatile market, identifying stocks to sell is critical to preserving capital invested. As economic uncertainties loom, learning which investments might falter can safeguard portfolios. Here, the focus is on three stocks that hold vulnerabilities, signaling potential downturns. Each company faces unique adversities.\n\nTo begin with, the first one contends with fluctuating international currencies impacting the top-line. Meanwhile, the second one needs help with subdued consumer spending on high-ticket items. Finally, the third one navigates turbulence stemming from strategic restructuring moves. These factors collectively highlight their susceptibility to broader economic downturns. They are making these companies prime candidates for investors considering a strategic exit.\n\nTo put it briefly, these businesses suffer from basic market dynamics flaws. Selling them can reduce risk and improve the portfolio’s performance. It is crucial to actively manage assets, investigate novel approaches, and understand why certain stocks are worth watching during economic ups and downs. Investigating these businesses’ complexities can help one make informed investing choices in today’s erratic stock market.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nNu Skin Enterprises (NUS) woman smiling with white background\n\nSource: Odua Images via Shutterstock\n\nNu Skin Enterprises (NYSE:NUS) is a direct-selling company that offers a range of skincare and nutritional products. The company had a top-line of $417.3 million for Q1 2024. This was impacted negatively by foreign currency fluctuations, amounting to a 3.8% decrease or approximately $18.2 million. This indicates that a considerable portion of Nu Skin’s top-line is subject to currency exchange rates. It can fluctuate unpredictably and impact performance adversely. The negative FX impact of 3.8% on top-line highlights the vulnerability of Nu Skin’s results to international currency movements. This dependency makes forecasting complex and hinders consistent growth.\n\nMoreover, Nu Skin has adversities in several international markets due to macroeconomic conditions, such as heavy inflationary pressures affecting consumer spending. Specific regions, like South Korea and Japan, were mentioned. Economic factors like housing market crises and unfavorable consumer sentiments have dampened growth prospects. Despite moves to manage expenses and optimize costs, Nu Skin’s gross margin decreased to 70.5% from 72.3% annually, partly due to these external economic pressures.\n\nStory continues\n\nOverall, Nu Skin’s exposure to forex volatility and economic adversities in key markets makes it a top mark on the top stocks to sell list.\n\nBig Lots (BIG) Photo of a Big Lots (BIG) store shot from the parking lot with a shopping cart in the foreground and clear blue sky in the background. BIG stock\n\nSource: Jonathan Weiss / Shutterstock.com\n\nBig Lots (NYSE:BIG) is a discount retailer that sells a variety of merchandise, including furniture, home decor and consumer goods. There is a considerable consumer pullback on big-ticket items. Despite moves to maintain market lead, these discretionary categories experienced a solid decline, negatively impacting sales performance. In Q1 2024, Big Lots delivered a comp sales decline of 9.9%, missing their mid-single-digit guidance. The high-ticket items like furniture and patio furniture needed to perform better, contributing to the sales miss.\n\nAdditionally, Big Lots has made strides in increasing the penetration of extreme bargains and optimizing its product assortment. This is particularly true through its five key action strategies. The heavy mix in home furnishing categories remains a drag on performance. The strategy to achieve 75% bargain penetration and increase extreme bargain penetration to 50% by year-end reflects a proactive pricing and assortment management approach. However, the disproportionate impact of slow-moving categories like furniture underscores a strategic vulnerability that limits the company’s agility in responding to changing consumer preferences.\n\nTherefore, Big Lots is at the top of the list of stocks to sell due to declining consumer spending on high-ticket items and reliance on underperforming product categories.\n\nWorthington Industries (WOR) Steel stocks: rods, bars and other forms of steel\n\nSource: Shutterstock\n\nWorthington Industries (NYSE:WOR) leads in products such as steel, aluminum and specialty metals. In Q4 fiscal 2024, Worthington delivered a loss from continuing operations amounting to 64 cents, a stark contrast to the earnings of $1.01 per share delivered in Q4 2023. This downturn in profitability can largely be attributed to restructuring, impairment and one-time charges totaling $74 million. This translates to $1.38 per share. These charges primarily stem from selling a 51% stake in their Sustainable Energy Solutions segment to form a joint venture with Hexagon Composites.\n\nSuch strategic moves may also improve focus or streamline processes but they have had a significant instant impact. Furthermore, Worthington’s performance represented larger obstacles across all of its parts. Adjusted EBITDA decreased from $94 million in Q4 2023 to $63 million in Q4 2024, indicating a drop in profitability even with efforts to lessen the impact. Additionally, the yearly gross profit dropped from $94 million to $79 million. This illustrates how difficult it has been for the business to continue operating profitably despite operation changes.\n\nIn conclusion, Worthington’s position on the list of the top stocks to sell is reinforced by its challenges to profitability and the competitive pressures it faces in the metals sector.\n\nOn the date of publication, Yiannis Zourmpanos did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nOn the date of publication, the responsible editor did not have (either directly or indirectly) any positions in the securities mentioned in this article.\n\nYiannis Zourmpanos is the founder of Yiazou Capital Research, a stock-market research platform designed to elevate the due diligence process through in-depth business analysis.\n\nMore From InvestorPlace\n\nLegendary Investor Predicts: “Forget AI... THIS Technology Is the Future”\n\nThe post Sell These 3 Stocks Before the Upcoming Recession appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/sell-3-stocks-upcoming-recession-202837329.html",
        "symbols": [
            "BIG.US",
            "NUS.BE",
            "NUS.MU",
            "NUS.STU",
            "NUS.US",
            "WOR.US",
            "WTH.BE",
            "WTH.F",
            "WTH.MU",
            "WTH.STU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.977,
            "neg": 0.055,
            "neu": 0.85,
            "pos": 0.095
        }
    },
    {
        "date": "2024-07-16T08:02:11+00:00",
        "title": "Q1 Earnings Outperformers: USANA (NYSE:USNA) And The Rest Of The Personal Care Stocks",
        "content": "Q1 Earnings Outperformers: USANA (NYSE:USNA) And The Rest Of The Personal Care Stocks\n\nLooking back on personal care stocks' Q1 earnings, we examine this quarter's best and worst performers, including USANA (NYSE:USNA) and its peers.\n\nWhile personal care products products may seem more discretionary than food, consumers tend to maintain or even boost their spending on the category during tough times. This phenomenon is known as \"the lipstick effect\" by economists, which states that consumers still want some semblance of affordable luxuries like beauty and wellness when the economy is sputtering. Consumer tastes are constantly changing, and personal care companies are currently responding to the public’s increased desire for ethically produced goods by featuring natural ingredients in their products.\n\nThe 13 personal care stocks we track reported a mixed Q1; on average, revenues beat analyst consensus estimates by 1.1%. while next quarter's revenue guidance was 7.5% below consensus. Stocks, especially growth stocks where cash flows further in the future are more important to the story, had a good end of 2023. But the beginning of 2024 has seen more volatile stock performance due to mixed inflation data, and personal care stocks have had a rough stretch, with share prices down 5.2% on average since the previous earnings results.\n\nUSANA (NYSE:USNA)\n\nGoing to market with a direct selling model rather than through traditional retailers, USANA Health Sciences (NYSE:USNA) manufactures and sells nutritional, personal care, and skincare products.\n\nUSANA reported revenues of $227.8 million, down 8.3% year on year, in line with analysts' expectations. Overall, it was an ok quarter for the company with a solid beat of analysts' earnings estimates but full-year revenue guidance missing analysts' expectations.\n\n“Our top line results during the first quarter were driven by a successful sales incentive in mainland China, which helped counter the seasonal slowdown that we experience during the Lunar New Year holiday,” said Jim Brown, President and Chief Executive Officer. USANA Total Revenue\n\nThe stock is up 9% since reporting and currently trades at $45.23.\n\nIs now the time to buy USANA? Access our full analysis of the earnings results here, it's free.\n\nBest Q1: The Honest Company (NASDAQ:HNST)\n\nCo-founded by actress Jessica Alba, The Honest Company (NASDAQ:HNST) sells diapers and wipes, skin care products, and household cleaning products.\n\nThe Honest Company reported revenues of $86.22 million, up 3.4% year on year, outperforming analysts' expectations by 3.5%. It was a stunning quarter for the company with an impressive beat of analysts' earnings estimates.\n\nStory continues The Honest Company Total Revenue\n\nThe market seems happy with the results as the stock is up 14.6% since reporting. It currently trades at $3.37.\n\nIs now the time to buy The Honest Company? Access our full analysis of the earnings results here, it's free.\n\nWeakest Q1: Medifast (NYSE:MED)\n\nKnown for its Optavia program that combines portion-controlled meal replacements with coaching, Medifast (NYSE:MED) has a broad product portfolio of bars, snacks, drinks, and desserts for those looking to lose weight or consume healthier foods.\n\nMedifast reported revenues of $174.7 million, down 49.9% year on year, in line with analysts' expectations. It was a weak quarter for the company with revenue guidance for next quarter missing analysts' expectations.\n\nMedifast had the slowest revenue growth in the group. As expected, the stock is down 47.5% since the results and currently trades at $18.63.\n\nRead our full analysis of Medifast's results here.\n\nHerbalife (NYSE:HLF)\n\nWith the first products sold out of the trunk of the founder’s car, Herbalife (NYSE:HLF) today offers a portfolio of shakes, supplements, personal care products, and weight management programs to help customers reach their nutritional and fitness goals.\n\nHerbalife reported revenues of $1.26 billion, flat year on year, in line with analysts' expectations. Overall, it was an ok quarter for the company with an impressive beat of analysts' earnings estimates but a miss of analysts' organic revenue growth estimates.\n\nThe stock is up 29.6% since reporting and currently trades at $11.26.\n\nRead our full, actionable report on Herbalife here, it's free.\n\nNu Skin (NYSE:NUS)\n\nWith person-to-person marketing and sales rather than selling through retail stores, Nu Skin (NYSE:NUS) is a personal care and dietary supplements company that engages in direct selling.\n\nNu Skin reported revenues of $417.3 million, down 13.3% year on year, falling short of analysts' expectations by 3.5%. Overall, it was a slower quarter for the company with full-year revenue guidance missing analysts' expectations and a miss of analysts' gross margin estimates.\n\nNu Skin had the weakest performance against analyst estimates among its peers. The stock is down 15.5% since reporting and currently trades at $10.49.\n\nRead our full, actionable report on Nu Skin here, it's free.\n\nJoin Paid Stock Investor Research\n\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.\n\nView comments",
        "link": "https://finance.yahoo.com/news/q1-earnings-outperformers-usana-nyse-080211559.html",
        "symbols": [
            "HLF.US",
            "HNST.US",
            "HOO.BE",
            "HOO.MU",
            "HOO.STU",
            "MDF.BE",
            "MDF.MU",
            "MDF.STU",
            "MED.US",
            "NUS.BE",
            "NUS.MU",
            "NUS.STU",
            "NUS.US",
            "USJ.MU",
            "USJ.STU",
            "USNA.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.041,
            "neu": 0.779,
            "pos": 0.18
        }
    },
    {
        "date": "2024-07-04T13:09:40+00:00",
        "title": "Nu Skin Enterprises, Inc. (NYSE:NUS) is largely controlled by institutional shareholders who own 80% of the company",
        "content": "Key Insights\n\nInstitutions' substantial holdings in Nu Skin Enterprises implies that they have significant influence over the company's share price 50% of the business is held by the top 10 shareholders Recent sales by insiders\n\nIf you want to know who really controls Nu Skin Enterprises, Inc. (NYSE:NUS), then you'll have to look at the makeup of its share registry. The group holding the most number of shares in the company, around 80% to be precise, is institutions. That is, the group stands to benefit the most if the stock rises (or lose the most if there is a downturn).\n\nBecause institutional owners have a huge pool of resources and liquidity, their investing decisions tend to carry a great deal of weight, especially with individual investors. Hence, having a considerable amount of institutional money invested in a company is often regarded as a desirable trait.\n\nLet's take a closer look to see what the different types of shareholders can tell us about Nu Skin Enterprises.\n\nView our latest analysis for Nu Skin Enterprises  ownership-breakdown\n\nWhat Does The Institutional Ownership Tell Us About Nu Skin Enterprises?\n\nInstitutional investors commonly compare their own returns to the returns of a commonly followed index. So they generally do consider buying larger companies that are included in the relevant benchmark index.\n\nWe can see that Nu Skin Enterprises does have institutional investors; and they hold a good portion of the company's stock. This implies the analysts working for those institutions have looked at the stock and they like it. But just like anyone else, they could be wrong. It is not uncommon to see a big share price drop if two large institutional investors try to sell out of a stock at the same time. So it is worth checking the past earnings trajectory of Nu Skin Enterprises, (below). Of course, keep in mind that there are other factors to consider, too. earnings-and-revenue-growth\n\nInvestors should note that institutions actually own more than half the company, so they can collectively wield significant power. Nu Skin Enterprises is not owned by hedge funds. Looking at our data, we can see that the largest shareholder is BlackRock, Inc. with 17% of shares outstanding. The Vanguard Group, Inc. is the second largest shareholder owning 13% of common stock, and State Street Global Advisors, Inc. holds about 4.1% of the company stock.\n\nWe did some more digging and found that 10 of the top shareholders account for roughly 50% of the register, implying that along with larger shareholders, there are a few smaller shareholders, thereby balancing out each others interests somewhat.\n\nStory continues\n\nWhile it makes sense to study institutional ownership data for a company, it also makes sense to study analyst sentiments to know which way the wind is blowing. Quite a few analysts cover the stock, so you could look into forecast growth quite easily.\n\nInsider Ownership Of Nu Skin Enterprises\n\nThe definition of company insiders can be subjective and does vary between jurisdictions. Our data reflects individual insiders, capturing board members at the very least. The company management answer to the board and the latter should represent the interests of shareholders. Notably, sometimes top-level managers are on the board themselves.\n\nInsider ownership is positive when it signals leadership are thinking like the true owners of the company. However, high insider ownership can also give immense power to a small group within the company. This can be negative in some circumstances.\n\nShareholders would probably be interested to learn that insiders own shares in Nu Skin Enterprises, Inc.. It has a market capitalization of just US$545m, and insiders have US$11m worth of shares, in their own names. It is good to see some investment by insiders, but it might be worth checking if those insiders have been buying.\n\nGeneral Public Ownership\n\nThe general public, who are usually individual investors, hold a 18% stake in Nu Skin Enterprises. While this group can't necessarily call the shots, it can certainly have a real influence on how the company is run.\n\nNext Steps:\n\nIt's always worth thinking about the different groups who own shares in a company. But to understand Nu Skin Enterprises better, we need to consider many other factors. Consider risks, for instance. Every company has them, and we've spotted  1 warning sign for Nu Skin Enterprises  you should know about.\n\nBut ultimately  it is the future, not the past, that will determine how well the owners of this business will do. Therefore we think it advisable to take a look at this free report showing whether analysts are predicting a brighter future.\n\nNB: Figures in this article are calculated using data from the last twelve months, which refer to the 12-month period ending on the last date of the month the financial statement is dated. This may not be consistent with full year annual report figures.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nView comments",
        "link": "https://finance.yahoo.com/news/nu-skin-enterprises-inc-nyse-130940385.html",
        "symbols": [
            "NUS.BE",
            "NUS.MU",
            "NUS.STU",
            "NUS.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.992,
            "neg": 0.018,
            "neu": 0.899,
            "pos": 0.083
        }
    },
    {
        "date": "2024-07-03T11:00:00+00:00",
        "title": "3 Overvalued Stocks to Sell Before the Bubble Bursts",
        "content": "Finding overvalued stocks to sell is crucial for investors to safeguard their portfolios in today’s erratic markets. Here, the emphasis is on three well-known businesses whose valuation measures have lately come under investigation. Though each firm works in a different industry—cash, direct marketing, or cryptocurrency—they are all seen to be overpriced. Analyzing these stocks’ financial fundamentals and market dynamics is necessary to understand why they are associated with downside risks.\n\nFrom volatile cryptocurrency markets to tactical changes affecting cannabis sales to financial strains, every example sheds light on possible weak points. These businesses have difficulties that can jeopardize their market positions and investor trust against shifting regulations, economic downturns, and strategic pivots. Understanding the warning signals of overvaluation is essential to protecting portfolios. An analysis of these case studies gives a more profound comprehension of the reasons behind these stocks’ potential risk status as investments. This is consistent with managing portfolio risks in unstable market situations.\n\nCoinbase Global (COIN) The Coinbase (COIN stock) logo on a smartphone screen with a BTC token. Crypto winter is setting in.\n\nSource: Primakov / Shutterstock.com\n\nCoinbase Global (NASDAQ:COIN) operates a leading cryptocurrency exchange. Increased volatility and pricing in cryptocurrency assets contributed to Coinbase’s notable 103% sequential gain in transaction revenue in Q1 2024. Although the Q1 results were positively impacted, Coinbase’s reliance on the cryptocurrency market exposes the company to its inherent volatility. This can cause significant fluctuations and impact the stability of its income in the coming quarters.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nAlthough the business reports that Q1 market conditions were encouraging, historical patterns indicate that cryptocurrency assets’ market capitalization and prices can be volatile. Hence, sustained revenue growth might be jeopardized by this uncertainty, particularly if market circumstances improve or deteriorate.\n\nTotal expenses rose by 5% every quarter due to increasing stock-based compensation and other operating expenditures. For Q2, the business expects to see more increases in administrative, marketing, and technology and development costs. Based on increased trading volumes and customer support requirements, these forecasts indicate that profitability margins will continue under pressure.\n\nOverall, Coinbase is on the overvalued stocks to sell list due to its top- and bottom-line volatility and dependence on the crypto ecosystem.\n\nStory continues\n\nAurora Cannabis (ACB) Closeup of mobile phone screen with logo lettering of cannabinoid company Aurora Cannabis (ACB, blurred marijuana leaf (focus on left part of letter R in center)\n\nSource: Ralf Liebhold / Shutterstock.com\n\nAurora Cannabis (NASDAQ:ACB) leads in the cannabis market. Over the year, the company’s net revenue from consumer cannabis decreased from $14.5 million to $10.2 million (fiscal 2024). The reduction can be attributable to the shift towards higher-margin medicinal cannabis sales in foreign markets over consumer products with lower profits.\n\nThe consumer cannabis industry’s adjusted gross margin dropped dramatically from 25% to 16%, suggesting a less desirable product mix than the year before. Even if it is not as profitable as medicinal cannabis, consumer cannabis nonetheless commands a considerable portion of the market. In developed countries like Canada and emerging markets, this is crucial.\n\nFurther, the drop in this segment’s revenue and profitability raises the possibility that Aurora is losing market share or needs help competing successfully. The strategic shift away from consumer cannabis may limit Aurora’s ability to capitalize on the full spectrum of the cannabis market, including recreational users and less medically stringent markets, as the company concentrates more on high-margin medical cannabis markets, such as those in Europe and Australia.\n\nIn short, Aurora’s shift away from consumer cannabis may negatively impact revenue growth, solidifying its place on the overvalued stocks to sell list.\n\nNu Skin (NUS) woman smiling with white background\n\nSource: Odua Images via Shutterstock\n\nNu Skin (NYSE:NUS) leads the direct sale of skincare and nutritional products. But customers and paid affiliates have significantly decreased, according to Nu Skin. In particular, annual declines in paid affiliates and consumers totaled 19% and 30%, respectively (adjusted to 14% ignoring eligibility changes).\n\nAdditionally, the negative consumer moods brought on by regional economic problems (such as South Korea’s property market crisis) and strong forex pressures have made things more difficult in some areas, such as South Korea and Japan. Nu Skin has struggled to increase sales, leading trends, and its client base.\n\nMoreover, revenue for Nu Skin in Q1 2024 was $417.3 million, a 13.3% decline from the $481.5 million in the same quarter the previous year. With 154,171 paid affiliates, there was a solid decrease of 30% from the previous year. When eligibility modifications were taken into account, there was a 14% decline. Despite attempts to reduce SKUs, Nu Skin’s gross margin dropped from 72.3% to 70.5% annually, suggesting pressure on profitability.\n\nTo conclude, Nu Skin needs help with declining customer and affiliate numbers amidst economic challenges. These elements led the company’s presence on the overvalued stock list to sell.\n\nOn the date of publication, Yiannis Zourmpanos did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nOn the date of publication, the responsible editor did not have (either directly or indirectly) any positions in the securities mentioned in this article.\n\nYiannis Zourmpanos is the founder of Yiazou Capital Research, a stock-market research platform designed to elevate the due diligence process through in-depth business analysis.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. Legendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\n\nThe post 3 Overvalued Stocks to Sell Before the Bubble Bursts appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/3-overvalued-stocks-sell-bubble-110000655.html",
        "symbols": [
            "1QZ.F",
            "1QZ.XETRA",
            "ACB.US",
            "C2OI34.SA",
            "COIN.US",
            "NUS.BE",
            "NUS.MU",
            "NUS.STU",
            "NUS.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.968,
            "neg": 0.057,
            "neu": 0.86,
            "pos": 0.082
        }
    },
    {
        "date": "2024-07-02T20:05:00+00:00",
        "title": "Nu Skin Enterprises to Announce Second Quarter 2024 Financial Results",
        "content": "PROVO, Utah, July 02, 2024--(BUSINESS WIRE)--Nu Skin Enterprises, Inc. (NYSE: NUS) today announced it will release second quarter 2024 results after the market closes on Thursday, Aug. 8. The Nu Skin management team will host a conference call with the investment community later that same day at 5 p.m. ET. During the call, management will discuss recent results and upcoming business initiatives.\n\nThe webcast of the conference call, including the financial information presented, will be available on the investor relations page of the company’s website at ir.nuskin.com. A replay of the webcast will be available at the same location through Thursday, Aug. 22.\n\nAbout Nu Skin Enterprises, Inc.\n\nThe Nu Skin Enterprises Inc. (NYSE: NUS) family of companies includes Nu Skin and Rhyz Inc. Nu Skin is an integrated beauty and wellness company, powered by a dynamic affiliate opportunity platform, which operates in nearly 50 markets worldwide. Backed by 40 years of scientific research, the company’s products help people look, feel and live their best with brands including Nu Skin® personal care, Pharmanex® nutrition and ageLOC® anti-aging, which includes an award-winning line of beauty device systems. Formed in 2018, Rhyz is a synergistic ecosystem of consumer, technology and manufacturing companies focused on innovation within the beauty, wellness and lifestyle categories.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240702855120/en/\n\nContacts\n\nMedia: media@nuskin.com, (801) 345-6397\r\nInvestors: investorrelations@nuskin.com, (801) 345-3577\n\nView comments",
        "link": "https://finance.yahoo.com/news/nu-skin-enterprises-announce-second-200500999.html",
        "symbols": [
            "NUS.BE",
            "NUS.MU",
            "NUS.STU",
            "NUS.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.989,
            "neg": 0,
            "neu": 0.845,
            "pos": 0.155
        }
    },
    {
        "date": "2024-06-21T13:47:00+00:00",
        "title": "Investor Sell Alert: 3 Stocks to Dump Before July 2024",
        "content": "Optimizing portfolios may require scanning stocks to sell before a certain period. Understanding which stocks might provide hazards is more important than ever as July 2024 approaches. Businesses frequently encounter particular obstacles. These may result from changing market conditions, operational problems, or strategic errors that, over time, reduce market value. In short, finding the stocks to dump before July 2024 requires proactive portfolio management rather than pessimism.\n\nThese three companies should be considered for divestiture before the middle of 2024. Every company has challenges, such as being vulnerable to currency changes that impact profits, declining sales in specific categories, and being exposed to unstable semiconductor markets and geopolitical threats. Looking at these examples, one may find geopolitical risks, obstacles unique to a certain industry, and operational inefficiencies. These insights enable portfolios to be in line with current market circumstances and provide protection against future financial downturns.\n\nNu Skin (NUS) woman smiling with white background\n\nSource: Odua Images via Shutterstock\n\nNu Skin (NYSE:NUS) operates in the personal care and wellness industry. Q1 2024’s gross margin decreased from 72.3% to 70.5% from the previous year’s quarter. A weaker foreign currency position raises the cost of items sold when the top line is translated back to the reporting currency. The gross margin for the Nu Skin core business increased from 76.4% in Q1 2023 to 76.9% (+0.5%).\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nMoreover, the operating margin for the quarter came to 2.1% or 3.8%, with restructuring expenses subtracted. This is a drop from the previous year’s 3.3%, or 5.4%, without restructuring expenses. Despite cost-cutting efforts, the reduced operating margin shows that FX pressures have a real impact on profitability. The requirement to handle debt in different currencies is also a reason for the rise in interest expenditure from $4.9 million in the previous year to $7.3 million in the current quarter. Hence, this underscores the financial burden FX fluctuation can bring under the ongoing higher-for-longer environment.\n\nOverall, Nu Skin’s inclusion on the list of stocks to sell before July 2024 list stems from its vulnerability to foreign exchange fluctuations.\n\nWorthington (WOR) A close-up shot of a cobalt pile in front of a black background.\n\nSource: Shutterstock\n\nWorthington (NYSE:WOR) is a diversified metals manufacturing company. Worthington’s building products category experienced the most significant decline in net sales, dropping by $35.8 million in Q3 fiscal 2024. Specifically, reduced volumes, an unfavorable product mix, and lower average selling prices led to this decline. This segment’s adjusted EBITDA dropped from $58 million in Q3 2023 to $53 million. This is a $5 million decline attributed to lower sales and an unfavorable product mix that hurt profitability.\n\nStory continues\n\nFurther, comparing the performance from the previous year to breakeven, Sustainable Energy Solutions reported an adjusted EBITDA loss of $3 million. The segment’s volumes remained too low to absorb fixed expenses, causing this negative EBITDA, even with an 11% rise in net sales. Due to reduced gross profit and increased selling and administration expenditures, the operating income for Q3 decreased to $8 million on an adjusted basis from $16.9 million in Q3 2023, indicating a sizable decline in profitability.\n\nTo sum up, Worthington faces challenges due to declining sales caused by lower volumes, pricing pressures, and an unfavorable product mix, putting it on the list of stocks to dump before July 2024.\n\nAxcelis (ACLS) Image of the Axcelis (ACLS) logo on a web browser amplified through the lens of a magnifying glass\n\nSource: Pavel Kapysh / Shutterstock.com\n\nAxcelis (NASDAQ:ACLS) designs, manufactures, and services ion implantation and processing equipment for semiconductor chips. While Axcelis’spower segment is resilient and may continue to grow throughout the year, other market segments are struggling and may not recover until 2025. With 59% of total sales in the first quarter of 2024 coming from China, the country represents a significant geographic market for Axcelis. Because of this high top-line concentration, the company is more exposed to the geopolitical and economic risks associated with the Chinese market.\n\nAdditionally, fewer sales shares go to the US, Japan, Europe, Korea, and the rest of the globe (17%, 7%, 4%, 4%, and 9%, respectively), suggesting a persistent lack of geographic diversity. Moreover, fluctuations in gross margins based on product mix indicate vulnerability. For instance, changes in the product mix and the shutdown of assessment systems—which typically provide lower profits—will likely result in variations in the gross margins for each quarter.\n\nTo conclude, Axcelis faces market segment challenges, particularly in memory markets like DRAM and NAND, with significant geopolitical risks in China posing potential threats. If you are looking for stocks to dump out of your portfolio, start here.\n\nOn the date of publication, Yiannis Zourmpanos did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nYiannis Zourmpanos is the founder of Yiazou Capital Research, a stock-market research platform designed to elevate the due diligence process through in-depth business analysis.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. Legendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\n\nThe post Investor Sell Alert: 3 Stocks to Dump Before July 2024 appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/investor-sell-alert-3-stocks-134700317.html",
        "symbols": [
            "ACLS.US",
            "NUS.BE",
            "NUS.MU",
            "NUS.STU",
            "NUS.US",
            "WOR.US",
            "WTH.BE",
            "WTH.F",
            "WTH.MU",
            "WTH.STU",
            "XXA1.F",
            "XXA1.STU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": -0.986,
            "neg": 0.103,
            "neu": 0.83,
            "pos": 0.067
        }
    },
    {
        "date": "2024-06-08T10:13:00+00:00",
        "title": "Escape the Downturn: 3 Must-Sell Stocks Before July",
        "content": "In a market like this, you should identify stocks most likely to underperform as a way of protecting your portfolio. Some stocks have had poor performances in the past years but then they have some very significant challenges that can take their value into a slump.\n\nDeep, top-line declines and restructuring deceleration have weighed down these same companies, and this usually consumes a lot of sales headwinds from various sectors. Realizing them early enough as an investor helps you make informed decisions and become cautious regarding losses.\n\nStocks to sell are those that have performed poorly with declining revenue, deteriorating profit margins or adverse market conditions. We identify must-sell stocks by considering factors like their financial health, market trends, and the effects of external factors upon them.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nHere are three companies currently finding the going very rough and seem to be on the way to a downturn. Their recent financial and market challenges suggest they may not recover soon, qualifying them as stocks to sell.\n\nSnap (SNAP) Advertiser Appeal and Innovations Will Continue to Lift Snap Stock\n\nSource: Christopher Penler / Shutterstock.com\n\nAlthough Snap (NYSE:SNAP) derived a 21% YoY boost in sales in Q1 2024, the company has projected a 15% to 18% growth rate in Q2 2024. Compared to the first quarter, this estimate indicates a three- to six-point slowdown.\n\nMoreover, the Middle East conflict was one of the major external variables influencing the total advertising income growth rate in non-North American areas, including Europe and the rest of the world (ROW). Thus, the unstable climate created by these geopolitical considerations may make it difficult for Snap to maintain steady revenue growth in all markets.\n\nAdditionally, Snap’s revenue is primarily derived from advertising. Despite surging 194% year-over-year to $87 million in the period, other revenue streams such as Snapchat+ subscriptions still comprise only a small portion of the consolidated top line. Because of its dependence on advertising, Snap is highly sensitive to ups and downs in advertiser spending, economic downturns and ad industry swings.\n\nFinally, losses narrowed slightly from last year. Snap recorded a $305 million net loss versus losses of $329 million a year ago. Hence, Snap is still losing a lot of money even with the decrease, raising questions about its long-term viability.\n\nNu Skin (NUS) woman smiling with white background\n\nSource: Odua Images via Shutterstock\n\nFor Q1 2024, Nu Skin (NYSE:NUS) reported a significant decrease in revenue, down 13.3% from last year. The decrease was exacerbated by negative foreign exchange (FX) impacts of $18.2 million, or 3.8%. The company’s susceptibility to currency rate changes is a clear concern.\n\nStory continues\n\nAdditionally, the business posted a loss of 1 cent for the quarter or an adjusted profit of 9 cents when excluding restructuring expenses. This is a significant decrease from profits of 23 cents and 37 cents, respectively, last year. Hence, the severity of this profit decline underscores the serious underlying financial difficulties Nu Skin is facing.\n\nFurther, Nu Skin’s clientele dropped from 1,080,915 to 875,261, a 19% decrease. In addition, there were 154,171 paid affiliates as opposed to 220,216 a year ago, a 30% decline. The significant drop in affiliates and consumers points to systemic problems with affiliate recruiting and retention. These are essential to the business’s direct selling strategy.\n\nLastly, there were 38,609 sales leaders, down 12% from 43,870. This drop is very problematic, given the importance of sales leaders in generating revenue and attracting new affiliates.\n\nAvnet (AVT) The logo for Avnet (AVT) is seen on the side of a building.\n\nSource: Michael Vi / Shutterstock.com\n\nAvnet (NASDAQ:AVT) reported a significant revenue decline for Q3 fiscal 2024, down 12.3% YoY. This decline is a crucial symptom of the business’ difficulties in maintaining its market position and rate of expansion.\n\nAdditionally, Avnet’s revenues are declining globally, not just in a specific region. Sales in the Americas fell by 18% from last year, Europe, Middle East and Africa were down 15% and Asia by 7% in constant currency. This global decline in revenues underscores Avnet’s challenge in continuing to grow over its entire global footprint.\n\nMoreover, the operating income margin for the third quarter of the year was reported to be 3.4%, down 1.4 percentage points from Q3 2023’s 4.8%. After rising to 4.8% YoY, the adjusted operating income margin decreased to 3.6%. This margin drop reflects the difficult market circumstances, further straining the business’s profitability.\n\nFinally, despite reporting an operating margin of 4.1%, the electronic components (EC) industry faces significant challenges in maintaining profitability due to diminishing revenues, making it a prime candidate for the stocks to sell list.\n\nOn the date of publication, Yiannis Zourmpanos did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nYiannis Zourmpanos is the founder of Yiazou Capital Research, a stock-market research platform designed to elevate the due diligence process through in-depth business analysis.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. Legendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\n\nThe post Escape the Downturn: 3 Must-Sell Stocks Before July appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/escape-downturn-3-must-sell-101300246.html",
        "symbols": [
            "1SI.F",
            "1SI.STU",
            "1SI.XETRA",
            "AVT.US",
            "NUS.BE",
            "NUS.MU",
            "NUS.STU",
            "NUS.US",
            "SNAP.US",
            "VNI.F",
            "VNI.MU",
            "VNI.STU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.933,
            "neg": 0.073,
            "neu": 0.834,
            "pos": 0.093
        }
    },
    {
        "date": "2024-06-06T09:41:00+00:00",
        "title": "Unpacking Q1 Earnings: BeautyHealth (NASDAQ:SKIN) In The Context Of Other Personal Care Stocks",
        "content": "Unpacking Q1 Earnings: BeautyHealth (NASDAQ:SKIN) In The Context Of Other Personal Care Stocks\n\nThe end of an earnings season can be a great time to discover new stocks and assess how companies are handling the current business environment. Let’s take a look at how BeautyHealth (NASDAQ:SKIN) and the rest of the personal care stocks fared in Q1.\n\nWhile personal care products products may seem more discretionary than food, consumers tend to maintain or even boost their spending on the category during tough times. This phenomenon is known as \"the lipstick effect\" by economists, which states that consumers still want some semblance of affordable luxuries like beauty and wellness when the economy is sputtering. Consumer tastes are constantly changing, and personal care companies are currently responding to the public’s increased desire for ethically produced goods by featuring natural ingredients in their products.\n\nThe 13 personal care stocks we track reported a mixed Q1; on average, revenues beat analyst consensus estimates by 1.1%. while next quarter's revenue guidance was 7.5% below consensus. Valuation multiples for many growth stocks have not yet reverted to their early 2021 highs, but the market was optimistic at the end of 2023 due to cooling inflation. The start of 2024 has been a different story as mixed signals have led to market volatility, and while some of the personal care stocks have fared somewhat better than others, they collectively declined, with share prices falling 1.9% on average since the previous earnings results.\n\nBeautyHealth (NASDAQ:SKIN)\n\nOperating in the emerging beauty health category, the appropriately named BeautyHealth (NASDAQ:SKIN) is a skincare company best known for its Hydrafacial product that cleanses and hydrates skin.\n\nBeautyHealth reported revenues of $81.4 million, down 5.7% year on year, in line with analysts' expectations. It was an ok quarter for the company, with an impressive beat of analysts' earnings estimates but revenue guidance for next quarter missing analysts' expectations.\n\n\"Our first quarter results demonstrate the progress we are making on our near-term strategic priorities, including sales excellence, operational excellence, and financial discipline,” said BeautyHealth Chief Executive Officer Marla Beck. BeautyHealth Total Revenue\n\nThe stock is down 43.7% since the results and currently trades at $2.02.\n\nIs now the time to buy BeautyHealth? Access our full analysis of the earnings results here, it's free.\n\nBest Q1: The Honest Company (NASDAQ:HNST)\n\nCo-founded by actress Jessica Alba, The Honest Company (NASDAQ:HNST) sells diapers and wipes, skin care products, and household cleaning products.\n\nStory continues\n\nThe Honest Company reported revenues of $86.22 million, up 3.4% year on year, outperforming analysts' expectations by 3.5%. It was a stunning quarter for the company, with an impressive beat of analysts' earnings estimates. The Honest Company Total Revenue\n\nThe stock is down 8.5% since the results and currently trades at $2.69.\n\nIs now the time to buy The Honest Company? Access our full analysis of the earnings results here, it's free.\n\nWeakest Q1: Medifast (NYSE:MED)\n\nKnown for its Optavia program that combines portion-controlled meal replacements with coaching, Medifast (NYSE:MED) has a broad product portfolio of bars, snacks, drinks, and desserts for those looking to lose weight or consume healthier foods.\n\nMedifast reported revenues of $174.7 million, down 49.9% year on year, in line with analysts' expectations. It was a weak quarter for the company, with revenue guidance for next quarter missing analysts' expectations and a miss of analysts' operating margin estimates.\n\nMedifast had the slowest revenue growth in the group. The stock is down 38% since the results and currently trades at $22.\n\nRead our full analysis of Medifast's results here.\n\nNu Skin (NYSE:NUS)\n\nWith person-to-person marketing and sales rather than selling through retail stores, Nu Skin (NYSE:NUS) is a personal care and dietary supplements company that engages in direct selling.\n\nNu Skin reported revenues of $417.3 million, down 13.3% year on year, falling short of analysts' expectations by 3.5%. It was a weak quarter for the company, with full-year revenue guidance missing analysts' expectations.\n\nNu Skin had the weakest performance against analyst estimates among its peers. The stock is up 8.5% since the results and currently trades at $13.47.\n\nRead our full, actionable report on Nu Skin here, it's free.\n\nEstée Lauder (NYSE:EL)\n\nNamed after its founder, who was an entrepreneurial woman from New York with a passion for skincare, Estée Lauder (NYSE:EL) is a one-stop beauty shop with products in skincare, fragrance, makeup, sun protection, and men’s grooming.\n\nEstée Lauder reported revenues of $3.94 billion, up 5% year on year, in line with analysts' expectations. It was a solid quarter for the company, with an impressive beat of analysts' earnings estimates.\n\nThe stock is down 16.2% since the results and currently trades at $122.98.\n\nRead our full, actionable report on Estée Lauder here, it's free.\n\nJoin Paid Stock Investor Research\n\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.\n\nView comments",
        "link": "https://finance.yahoo.com/news/unpacking-q1-earnings-beautyhealth-nasdaq-094100935.html",
        "symbols": [
            "EL.US",
            "HNST.US",
            "MDF.BE",
            "MDF.MU",
            "MDF.STU",
            "MED.US",
            "NUS.BE",
            "NUS.MU",
            "NUS.STU",
            "NUS.US",
            "SKIN.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.037,
            "neu": 0.773,
            "pos": 0.19
        }
    },
    {
        "date": "2024-05-30T10:38:13+00:00",
        "title": "Here's Why It's Unlikely That Nu Skin Enterprises, Inc.'s (NYSE:NUS) CEO Will See A Pay Rise This Year",
        "content": "Key Insights\n\nNu Skin Enterprises' Annual General Meeting to take place on 5th of June Salary of US$991.9k is part of CEO Ryan Napierski's total remuneration Total compensation is 136% above industry average Nu Skin Enterprises' three-year loss to shareholders was 76% while its EPS was down 69% over the past three years\n\nNu Skin Enterprises, Inc. (NYSE:NUS) has not performed well recently and CEO Ryan Napierski will probably need to up their game. At the upcoming AGM on 5th of June, shareholders can hear from the board including their plans for turning around performance. This will be also be a chance where they can challenge the board on company direction and vote on resolutions such as executive remuneration. From our analysis, we think CEO compensation may need a review in light of the recent performance.\n\nCheck out our latest analysis for Nu Skin Enterprises\n\nComparing Nu Skin Enterprises, Inc.'s CEO Compensation With The Industry\n\nAccording to our data, Nu Skin Enterprises, Inc. has a market capitalization of US$663m, and paid its CEO total annual compensation worth US$5.8m over the year to December 2023. We note that's an increase of 23% above last year. While we always look at total compensation first, our analysis shows that the salary component is less, at US$992k.\n\nFor comparison, other companies in the American Personal Products industry with market capitalizations ranging between US$400m and US$1.6b had a median total CEO compensation of US$2.5m. This suggests that Ryan Napierski is paid more than the median for the industry. Moreover, Ryan Napierski also holds US$1.4m worth of Nu Skin Enterprises stock directly under their own name.\n\nComponent 2023 2022 Proportion (2023) Salary US$992k US$942k 17% Other US$4.8m US$3.8m 83% Total Compensation US$5.8m US$4.8m 100%\n\nOn an industry level, around 54% of total compensation represents salary and 46% is other remuneration. It's interesting to note that Nu Skin Enterprises allocates a smaller portion of compensation to salary in comparison to the broader industry. If non-salary compensation dominates total pay, it's an indicator that the executive's salary is tied to company performance. ceo-compensation\n\nA Look at Nu Skin Enterprises, Inc.'s Growth Numbers\n\nOver the last three years, Nu Skin Enterprises, Inc. has shrunk its earnings per share by 69% per year. It saw its revenue drop 9.4% over the last year.\n\nFew shareholders would be pleased to read that EPS have declined. This is compounded by the fact revenue is actually down on last year. These factors suggest that the business performance wouldn't really justify a high pay packet for the CEO. Looking ahead, you might want to check this free visual report on analyst forecasts for the company's future earnings..\n\nStory continues\n\nHas Nu Skin Enterprises, Inc. Been A Good Investment?\n\nWith a total shareholder return of -76% over three years, Nu Skin Enterprises, Inc. shareholders would by and large be disappointed. This suggests it would be unwise for the company to pay the CEO too generously.\n\nIn Summary...\n\nGiven that shareholders haven't seen any positive returns on their investment, not to mention the lack of earnings growth, this may suggest that few of them would be willing to award the CEO with a pay rise. At the upcoming AGM, the board will get the chance to explain the steps it plans to take to improve business performance.\n\nCEO compensation is a crucial aspect to keep your eyes on but investors also need to keep their eyes open for other issues related to business performance. We did our research and spotted 1 warning sign for Nu Skin Enterprises that investors should look into moving forward.\n\nArguably, business quality is much more important than CEO compensation levels. So check out this freelist of interesting companies that have HIGH return on equity and low debt.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nView comments",
        "link": "https://finance.yahoo.com/news/heres-why-unlikely-nu-skin-103813242.html",
        "symbols": [
            "NUS.BE",
            "NUS.MU",
            "NUS.STU",
            "NUS.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.739,
            "neg": 0.039,
            "neu": 0.911,
            "pos": 0.05
        }
    },
    {
        "date": "2024-05-26T14:16:00+00:00",
        "title": "It Might Not Be A Great Idea To Buy Nu Skin Enterprises, Inc. (NYSE:NUS) For Its Next Dividend",
        "content": "Regular readers will know that we love our dividends at Simply Wall St, which is why it's exciting to see Nu Skin Enterprises, Inc. (NYSE:NUS) is about to trade ex-dividend in the next four days. The ex-dividend date is usually set to be one business day before the record date which is the cut-off date on which you must be present on the company's books as a shareholder in order to receive the dividend. The ex-dividend date is an important date to be aware of as any purchase of the stock made on or after this date might mean a late settlement that doesn't show on the record date. Meaning, you will need to purchase Nu Skin Enterprises' shares before the 31st of May to receive the dividend, which will be paid on the 12th of June.\n\nThe company's upcoming dividend is US$0.06 a share, following on from the last 12 months, when the company distributed a total of US$0.24 per share to shareholders. Looking at the last 12 months of distributions, Nu Skin Enterprises has a trailing yield of approximately 1.8% on its current stock price of US$13.24. We love seeing companies pay a dividend, but it's also important to be sure that laying the golden eggs isn't going to kill our golden goose! So we need to investigate whether Nu Skin Enterprises can afford its dividend, and if the dividend could grow.\n\nCheck out our latest analysis for Nu Skin Enterprises\n\nDividends are usually paid out of company profits, so if a company pays out more than it earned then its dividend is usually at greater risk of being cut. Nu Skin Enterprises reported a loss last year, so it's not great to see that it has continued paying a dividend. With the recent loss, it's important to check if the business generated enough cash to pay its dividend. If cash earnings don't cover the dividend, the company would have to pay dividends out of cash in the bank, or by borrowing money, neither of which is long-term sustainable. Dividends consumed 72% of the company's free cash flow last year, which is within a normal range for most dividend-paying organisations.\n\nClick here to see the company's payout ratio, plus analyst estimates of its future dividends. historic-dividend\n\nHave Earnings And Dividends Been Growing?\n\nWhen earnings decline, dividend companies become much harder to analyse and own safely. If earnings fall far enough, the company could be forced to cut its dividend. Nu Skin Enterprises reported a loss last year, and the general trend suggests its earnings have also been declining in recent years, making us wonder if the dividend is at risk.\n\nStory continues\n\nAnother key way to measure a company's dividend prospects is by measuring its historical rate of dividend growth. Nu Skin Enterprises has seen its dividend decline 15% per annum on average over the past 10 years, which is not great to see. While it's not great that earnings and dividends per share have fallen in recent years, we're encouraged by the fact that management has trimmed the dividend rather than risk over-committing the company in a risky attempt to maintain yields to shareholders.\n\nWe update our analysis on Nu Skin Enterprises every 24 hours, so you can always get the latest insights on its financial health, here.\n\nFinal Takeaway\n\nIs Nu Skin Enterprises an attractive dividend stock, or better left on the shelf? First, it's not great to see the company paying a dividend despite being loss-making over the last year. On the plus side, the dividend was covered by free cash flow.\" It's not that we think Nu Skin Enterprises is a bad company, but these characteristics don't generally lead to outstanding dividend performance.\n\nHaving said that, if you're looking at this stock without much concern for the dividend, you should still be familiar of the risks involved with Nu Skin Enterprises. In terms of investment risks, we've identified 1 warning sign with Nu Skin Enterprises and understanding them should be part of your investment process.\n\nIf you're in the market for strong dividend payers, we recommend checking our selection of top dividend stocks.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nView comments",
        "link": "https://finance.yahoo.com/news/might-not-great-idea-buy-141600408.html",
        "symbols": [
            "NUS.BE",
            "NUS.MU",
            "NUS.STU",
            "NUS.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.98,
            "neg": 0.071,
            "neu": 0.833,
            "pos": 0.097
        }
    },
    {
        "date": "2024-05-14T20:10:00+00:00",
        "title": "Nu Skin Releases 2023 Social Impact and Sustainability Report",
        "content": "2023 Nu Skin Social Impact and Sustainability Report (Photo: Business Wire)\n\nReport highlights the beauty and wellness brand’s global social impact and sustainability achievements\n\nPROVO, Utah, May 14, 2024--(BUSINESS WIRE)--Nu Skin, a global leader in beauty and wellness, today released its 2023 Social Impact and Sustainability Report. The report outlines progress on the company’s environmental and social priorities, including its sustainability commitments and global giving efforts.\n\n\"Nu Skin was built on a strong legacy of being a global force for good and today this purpose is more important than ever,\" said Ryan Napierski, Nu Skin president and CEO. \"While we celebrate our achievements from last year and are proud of the progress we have made, we realize we still have work to do as we look to further enhancing our efforts and continuing to have a great impact on those in need. We are committed to being a force for good, ensuring that the Nu Skin legacy is not only about empowering entrepreneurs, but also about helping children and leaving a better planet for future generations.\"\n\nThe Nu Skin Force for Good Foundation is the heart of the company’s mission. The nonprofit foundation has worked for more than 25 years to help children around the world in more than 50 countries. The Foundation supports numerous health and wellness projects that benefit hundreds of thousands of children. It also aids the preservation of more than 1.4 million acres of natural habitats to better the planet for future generations.\n\nHighlights from the 2023 Social Impact and Sustainability Report include:\n\nSocial Impact\n\nDonated more than $6.8 million globally to causes around the world, including projects supporting conservation efforts and children-related causes. Since 1999, more than 30,000 heart surgeries have been performed through the Greater China and Southeast Asia children’s heart funds, with more than 600 of those surgeries taking place in 2023. Nu Skin conducted global service projects with more than 4,000 volunteers benefitting people throughout the world. Partnerships with employees, brand affiliates, and charity partners in more than 40 markets around the world made a difference with Force for Good projects on every continent except Antarctica. Nu Skin’s family of brand affiliates, customers, and employees purchased and donated 33 million meals to children in more than 12 countries including Malawi, Mainland China, Mexico and others through the company’s for-profit Nourish the Children initiative. To date, more than 800 million meals have been purchased and donated to children through the initiative since 2002.*\n\nStory continues\n\nSustainability\n\nAchieved our 2023 sustainability commitment to assess, score, and make plans to improve the environmental impact score of 100% of our products. Reduced 40 tons of plastic and 12.5 tons of paper as a result of environmental initiatives. Achieved RSPO sourcing for 100% of the palm and palm-derived ingredients for our personal care products using a combination of the Roundtable Sustainable Palm Oil (RSPO) mass balance and book and claim models. Opened a new state-of-the-art manufacturing facility in Shanghai, China using smart and autonomous systems fueled by real-time data analysis and machine learning. The Shanghai location was constructed in accordance with green building standards, maintaining a high production capacity while conserving energy and reducing water consumption. Continued to make progress on product-related sustainability commitments, including making all product packaging recycled, recyclable, reusable, reduced or renewable by 2030.\n\nCorporate Social Responsibility Awards\n\nReceived 20 awards for sustainable products, business excellence, social impact and sustainability efforts, including honors from Global Green Beauty, Communitas and Pure Beauty Awards.\n\nTo learn more about Nu Skin's social and environmental impact efforts, visit https://www.nuskin.com/content/nuskin/en_US/forceforgood/home.html\n\nAbout Nu Skin Enterprises, Inc.\n\nThe Nu Skin Enterprises Inc. (NYSE: NUS) family of companies includes Nu Skin and Rhyz Inc. Nu Skin is an integrated beauty and wellness company, powered by a dynamic affiliate opportunity platform, which operates in nearly 50 markets worldwide. Backed by 40 years of scientific research, the company's products help people look, feel and live their best with brands including Nu Skin® personal care, Pharmanex® nutrition and ageLOC® anti-aging, which includes an award-winning line of beauty device systems. Formed in 2018, Rhyz is a synergistic ecosystem of consumer, technology and manufacturing companies focused on innovation within the beauty, wellness and lifestyle categories.\n\n* Nu Skin is a for-profit distributor of nutritional and skin care products and is traded on the New York Stock Exchange (NUS). Nourish the Children is an initiative of Nu Skin and is registered in some states as a commercial co-venture. The initiative enables Nu Skin’s Brand Affiliates and customers to purchase VitaMeal from Nu Skin and donate it to charitable organizations to help solve the complex world problem of feeding malnourished children. The price of VitaMeal includes the cost of manufacturing, general overhead, distribution and sales. As is the case with other Nu Skin products, Brand Affiliates are paid commissions and Nu Skin earns a profit margin from each sale of VitaMeal.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240514507419/en/\n\nContacts\n\nMedia: media@nuskin.com, (801) 345-6397\r\nInvestors: investorrelations@nuskin.com, (801) 345-3577\n\nView comments",
        "link": "https://finance.yahoo.com/news/nu-skin-releases-2023-social-201000914.html",
        "symbols": [
            "NUS.BE",
            "NUS.MU",
            "NUS.STU",
            "NUS.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.004,
            "neu": 0.765,
            "pos": 0.232
        }
    },
    {
        "date": "2024-05-13T19:52:18+00:00",
        "title": "Even after rising 8.4% this past week, Nu Skin Enterprises (NYSE:NUS) shareholders are still down 75% over the past three years",
        "content": "Every investor on earth makes bad calls sometimes. But you have a problem if you face massive losses more than once in a while. So spare a thought for the long term shareholders of Nu Skin Enterprises, Inc. (NYSE:NUS); the share price is down a whopping 78% in the last three years. That would certainly shake our confidence in the decision to own the stock. And over the last year the share price fell 65%, so we doubt many shareholders are delighted. The falls have accelerated recently, with the share price down 24% in the last three months. We note that the company has reported results fairly recently; and the market is hardly delighted. You can check out the latest numbers in our company report.\n\nOn a more encouraging note the company has added US$51m to its market cap in just the last 7 days, so let's see if we can determine what's driven the three-year loss for shareholders.\n\nView our latest analysis for Nu Skin Enterprises\n\nWhile markets are a powerful pricing mechanism, share prices reflect investor sentiment, not just underlying business performance. One imperfect but simple way to consider how the market perception of a company has shifted is to compare the change in the earnings per share (EPS) with the share price movement.\n\nOver the three years that the share price declined, Nu Skin Enterprises' earnings per share (EPS) dropped significantly, falling to a loss. Extraordinary items contributed to this situation. Due to the loss, it's not easy to use EPS as a reliable guide to the business. However, we can say we'd expect to see a falling share price in this scenario.\n\nThe graphic below depicts how EPS has changed over time (unveil the exact values by clicking on the image). earnings-per-share-growth\n\nBefore buying or selling a stock, we always recommend a close examination of historic growth trends, available here.\n\nWhat About Dividends?\n\nIt is important to consider the total shareholder return, as well as the share price return, for any given stock. Whereas the share price return only reflects the change in the share price, the TSR includes the value of dividends (assuming they were reinvested) and the benefit of any discounted capital raising or spin-off. Arguably, the TSR gives a more comprehensive picture of the return generated by a stock. As it happens, Nu Skin Enterprises' TSR for the last 3 years was -75%, which exceeds the share price return mentioned earlier. And there's no prize for guessing that the dividend payments largely explain the divergence!\n\nA Different Perspective\n\nNu Skin Enterprises shareholders are down 63% for the year (even including dividends), but the market itself is up 28%. However, keep in mind that even the best stocks will sometimes underperform the market over a twelve month period. Unfortunately, last year's performance may indicate unresolved challenges, given that it was worse than the annualised loss of 11% over the last half decade. Generally speaking long term share price weakness can be a bad sign, though contrarian investors might want to research the stock in hope of a turnaround. I find it very interesting to look at share price over the long term as a proxy for business performance. But to truly gain insight, we need to consider other information, too. Consider risks, for instance. Every company has them, and we've spotted  1 warning sign for Nu Skin Enterprises  you should know about.\n\nStory continues\n\nOf course, you might find a fantastic investment by looking elsewhere. So take a peek at this freelist of companies we expect will grow earnings.\n\nPlease note, the market returns quoted in this article reflect the market weighted average returns of stocks that currently trade on American exchanges.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nView comments",
        "link": "https://finance.yahoo.com/news/even-rising-8-4-past-195218987.html",
        "symbols": [
            "NUS.BE",
            "NUS.MU",
            "NUS.STU",
            "NUS.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.996,
            "neg": 0.068,
            "neu": 0.789,
            "pos": 0.143
        }
    },
    {
        "date": "2024-05-09T14:03:03+00:00",
        "title": "Nu Skin Enterprises, Inc. (NYSE:NUS) Q1 2024 Earnings Call Transcript",
        "content": "Nu Skin Enterprises, Inc. (NYSE:NUS) Q1 2024 Earnings Call Transcript May 8, 2024\n\nNu Skin Enterprises, Inc. isn't one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here).\n\nOperator: Good day. Thank you for standing by. Welcome to the Q1 2024 Nu Skin Enterprise Earnings Conference Call. At this time, all participants are in a listen-only mode. After the speakers' presentation, there will be a question-and-answer session. [Operator Instructions] Please be advised that today's conference is being recorded. I would now like to hand the conference over to your speaker today, Scott Pond, Vice President, Investor Relations. Please go ahead.\n\nScott Pond: Thanks, Michelle, and good afternoon, everyone. Today on the call with me are Ryan Napierski, President and CEO; and James Thomas, CFO. On today's call, comments will be made that include some forward-looking statements. These statements involve risks and uncertainties, and actual results may differ materially from those discussed or anticipated. Please refer to today's earnings release and our SEC filings for a complete discussion of these risks. Also during the call, certain financial numbers may be discussed that differ from comparable numbers obtained in our financial statements. We believe these non-GAAP numbers assist in comparing period-to-period results in a more consistent manner. Please refer to our investor website for any required reconciliation of non-GAAP numbers. And now I'd like to turn the call over to Ryan.\n\nRyan Napierski: Thanks, Scott. Hello, everyone. Thanks for joining us today. Having just returned from our top sales leader, alignment and activation, all in event in Abu Dhabi and Dubai, I'm eager to provide an update on the state of our business as we enter our 40-year anniversary, pursuing our mission of being a global force for good by empowering people to look, fill and live better lives. I'll provide a performance summary for Q1 as well as the progress update on our ongoing enterprise transformation vision, strategy and plans. Our results for the first quarter were in line with guidance. At a high level, our business is on track with established expectations, and we are maintaining our full year outlook. Revenue for the quarter was in the middle of our guidance range despite experiencing more FX pressure than we had anticipated.\n\nWe were also pleased with our progress on expense reduction initiatives, which helped us deliver first quarter non-GAAP earnings per share at the high end of our range. Our Rhyz business delivered another strong quarter with revenues up 57% to more than $62 million, led by both our Mavely technology platform and Wasatch manufacturing business. The revenue contribution from Rhyz accounted for approximately 15% of total enterprise revenue in the first quarter, and we continue to expect this segment to account for 20% to 25% of our overall mix by 2025. Looking at the performance of our core Nu Skin business, our new product innovations delivered solid results. Ageloc, Wellspa IO and RenewspA IO, the holistic wellness and beauty devices we launched recently, along with Ageloc Trme, our personalized weight management system that also launched in 2023 contributed approximately $42 million to our Q1 revenue.\n\nStory continues\n\nEurope and Africa, there was a very favorable response to Trme during Q1. There were also positive trends in a handful of our Southeast Asia Pacific markets, and we were encouraged by continued improvements in our sales leader trend in Mainland China despite a generally tepid macroeconomic climate. In other regions, we continue to battle macroeconomic challenges, including heavy inflationary pressures on consumer spending for premium goods, which, together with our aggressive price increases from a year ago have hampered our customer and affiliate acquisition efforts. In the Americas region, our subscription business in North America continues to be pressured by these factors, and we're making some adjustments to our model in Latin America to counter macro forces, particularly in Argentina.\n\nIn South Korea, consumer sentiment remains negative due to the housing market crisis, making it difficult to grow with customers and build the channel. Consumer sentiment is also a factor in Japan in addition to significant FX pressure on our results. So to combat these external factors, we are placing more emphasis on product innovation in the affordable luxury space, and we will be introducing several new products at our upcoming West and East live sales conferences in Q3, our first multimarket in-person events since COVID. Despite these headwinds, we remain committed to our long-term enterprise vision of transforming our core Nu Skin business while building out Rhyz in our long-term beauty, wellness and lifestyle ecosystem. As I mentioned earlier, we just returned from our meetings with our top leaders where there was a palpable level of energy and excitement about the future.\n\nWe introduced our next major product innovation, Mind 360 [ph] a new division targeted at the rapidly growing $10 billion cognitive health market. Mind 360 takes a holistic approach to addressing the interrelated factors of stress, sleep and cognitive performance that are impacting the well-being of consumers in today's busy world. We're excited to preview Mind 360 at our upcoming live events in Q3 with planned introductions of Mind 360 to follow towards the end of the year and into 2025. Channel activation within our core Nu Skin business is a top priority for us, and we're pleased to announce the promotion of Justin Keisel as our new President of Global Sales. Justin has been leading the work to expand our affiliate model across the Americas over the past several years.\n\nHe has extensive sales leadership experience, both at Nu Skin and in prior roles and has demonstrated his commitment to our leaders success. Justin is spearheading our efforts to retool our entire global sales organization and bring a much more rigorous lens to the sales performance management and channel activation. To this end, we recently launched a new series of incentives, including a new customer acquisition and leadership performance program to reenergize the field. We anticipate these new initiatives to take root through the remainder of this year. Also, let me quickly give an update on last quarter's announcement of our intent to enter India, one of the fastest-growing direct selling markets in the world. We are taking a very new approach to this high potential emerging market that will enable us to reach a much wider array of customers and entrepreneurs.\n\nOur product offering, business model and operational footprint will be synchronized to enable broader market - mid-market appeal. We are just beginning to activate our channel towards a targeted market opening in 2025 with a digital-first approach that is more agile and will enable us to scale more quickly throughout the market. We see India and our emerging market business model as a gateway to many new markets in the future and anticipate these learnings will help us delve deeper in the second and third-tier markets within Latin America, Southeast Asia and China. Growing out rise in our Rhyz and our Rhyz business is a critical element of our overall enterprise vision as we seek to build out the world's leading beauty, wellness and lifestyle ecosystem. A smiling woman applying a product from the company's skin care line.\n\nOver the past several years, we've constructed essential infrastructure consisting of manufacturing, technology and operations to support Nu Skin's core business while enabling other brands to grow. We are now applying this ecosystem to BeautyBio to enable it to scale and see additional opportunities to extend our comprehensive suite of services, spanning product R&D, production, packaging, cutting-edge technology and logistics to the Indybeauty [ph] and wellness industry for influencers and creators. We see great potential for this influencer incubator over the mid to long term, and we are well positioned to capitalize on these opportunities as we lean into the disruption of the beauty and wellness industry due to social influencers and Indy brands.\n\nWe are utilizing our capital to invest in additional manufacturing, services, capabilities and opportunities to enable future growth. So in summary, first quarter results were in line with guidance, and we are maintaining our 2024 outlook. From a top line perspective, we are acutely focused on channel activation with new incentives and continue to lean into our product strategy, including the upcoming launch of Mind 360 as well as affordable luxury. We also continue to invest in our Rhyz business to accelerate growth and further transform our enterprise to leverage our competitive advantages within the beauty, wellness and lifestyle industries. Expense prudence remains a critical focus in 2024. And while we made significant progress on these initiatives during the first quarter, there are still opportunities to drive further efficiency, including our SKU optimization plan to eliminate 25% to 30% of our SKUs by the end of 2025.\n\nDespite the challenging conditions in many of our markets in the near to midterm, we remain focused on executing our long-term vision of becoming the world's leading integrated beauty and wellness ecosystem. And with that, I'll turn the call over to James to cover the first quarter results in more detail along with our guidance. James?\n\nJames Thomas: Thank you, Ryan, and thanks to all of you for joining today. I'll provide a brief Q1 update and then speak to Q2 and 2024 guidance. For additional details, please visit our Investor Relations website. For the first quarter, we posted revenue of $417.3 million, which was at the midpoint of our previous guidance range and included a negative foreign currency impact of 3.8% or $18.2 million, which created more pressure from our initial guidance. Reported earnings landed near the top end of our guidance range at negative $0.01 or $0.09, excluding restructuring charges. Our gross margin was 70.5% compared to 72.3% in the prior year quarter. Gross margin for the Nu Skin core business improved 50 basis points to 76.9% compared to 76.4% in the prior year quarter due to our SKU rationalization initiatives and targeted promotion mix.\n\nSelling expense as a percentage of revenue decreased to 36.8% and compared to 39.1% in the prior year quarter. For the Nu Skin core business, selling expense was 41.7%, flat with the prior year. The lower overall gross margin and selling expense is due in growth due to growth in our Rhyz segment, which now accounts for 15% of our business. General and administrative expense declined $9.3 million year-over-year and as a percentage of revenue, was 29.9% compared to 27.8%. The increased percentage can be attributed to lower quarterly revenue levels. As previously discussed, we've been strategically evaluating our Nu Skin core business and better aligning our operating costs to be in line with revenue. In the first quarter, we incurred an additional $7.1 million restructuring charge, and we will continue our cost efficiency plan through next quarter with an anticipated $3 million to $8 million of restructuring charges.\n\nWe continue to expect this cost efficiency plan to deliver annual savings of between $40 million and $65 million before taxes. We will continue to seek business efficiencies in all areas and believe these actions will help us maximize cash flows, focus on improved margins and enhanced earnings per share going forward. Our operating margin for the quarter was 2.1% or 3.8% excluding restructuring charges compared to 3.3% or 5.4%, excluding restructuring charges in the prior year. Our interest expense was $7.3 million for the quarter compared to $4.9 million in the prior year. The other income expense line reflects a $0.4 million expense compared to a $3.4 million gain in the prior year quarter. In the first quarter, our cash flow from operations rose to a positive $3.3 million, driven by a concentrated effort on inventory management.\n\nIn contrast with the $22.1 million cash outflow in the same period last year. Cash from operations is typically the lowest in the first quarter due to lower revenue levels in what is seasonally our slowest quarter. We paid $3 million in dividends and paid down our outstanding debt, $20 million in the quarter. We did not repurchase any stock and have $162.4 million remaining on the current authorization. Our tax rate for the quarter was 148.4% or 48.5% excluding restructuring charges compared to 22%. For the second quarter, we anticipate an elevated tax rate in the range of 45% to 55% and anticipate a projected 2024 annual tax rate of 25% to 35%. This annual rate reflects an anticipated higher global effective tax rate, primarily due to the expected geographical mix of earnings during the year and the rate impact from our stock awards in Q1.\n\nShifting focus now to guidance. In light of the continued economic pressures, challenges associated with our transforming our business and increased volatility in foreign exchange rates, we are reiterating 2024 revenue in the $1.73 billion to $1.87 billion range. We anticipate earnings per share of $0.77 to $1.16 or adjusted earnings of $0.95 to $1.35. Our guidance now assumes an increased foreign currency headwind of approximately 2% to 3%. We are projecting second quarter revenue of $420 million to $455 million, assuming a foreign currency headwind of approximately 3% to 4% with reported earnings per share of $0.01 to $0.10 or $0.10 to $0.20, excluding restructuring charges. And with that, operator, we'll now open the call up for questions.\n\nOperator: Thank you [Operator Instructions] Our first question comes from the line of Chasen Bender with Citi. Your line is open. Please go ahead.\n\nSee also Kevin O’Leary’s Stock Portfolio: 10 Stock Picks for 2024 and\n\n12 Best Investments for Beginners in 2024.\n\nTo continue reading the Q&A session, please click here.\n\nView comments",
        "link": "https://finance.yahoo.com/news/nu-skin-enterprises-inc-nyse-140303594.html",
        "symbols": [
            "NUS.BE",
            "NUS.MU",
            "NUS.STU",
            "NUS.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.037,
            "neu": 0.834,
            "pos": 0.129
        }
    },
    {
        "date": "2024-05-09T07:54:51+00:00",
        "title": "Nu Skin Enterprises Inc (NUS) (Q1 2024) Earnings Call Transcript Highlights: Resilience Amid ...",
        "content": "Revenue: Q1 revenue was $417.3 million, aligning with the midpoint of guidance despite a 3.8% negative impact from foreign exchange. Gross Margin: Improved by 50 basis points in the Nu Skin core business to 76.9%; overall gross margin was 70.5%. Net Income: Reported earnings were near the top end of guidance at negative $0.01 or $0.09, excluding restructuring charges. Earnings Per Share: For Q1, EPS was near the top end of the guidance range; full-year EPS guidance is $0.77 to $1.16, adjusted EPS $0.95 to $1.35. Operating Margin: Q1 operating margin was 2.1%, or 3.8% excluding restructuring charges. Cash Flow from Operations: Improved to a positive $3.3 million from a $22.1 million outflow in the prior year. Debt Management: Reduced outstanding debt by $20 million during the quarter. Dividends: Paid $3 million in dividends during the quarter. Product Segments: Rise business revenue up 57% to over $62 million; Nu Skin core products like ageLOC contributed approximately $42 million to Q1 revenue.\n\nWarning! GuruFocus has detected 9 Warning Signs with NUS.\n\nRelease Date: May 08, 2024\n\nFor the complete transcript of the earnings call, please refer to the full earnings call transcript.\n\nPositive Points\n\nNu Skin Enterprises Inc (NYSE:NUS) reported Q1 revenue at the midpoint of guidance despite foreign exchange pressures, indicating resilience in its business model. The company's RISE business segment showed strong performance with a 57% increase in revenue, contributing significantly to the total enterprise revenue. Nu Skin Enterprises Inc (NYSE:NUS) is maintaining its full-year outlook, reflecting confidence in its business strategy and operational execution. Significant progress in expense reduction initiatives helped deliver non-GAAP earnings per share at the high end of the guidance range. New product innovations, particularly in the holistic wellness and beauty devices, contributed approximately $42 million to Q1 revenue, demonstrating effective innovation and market responsiveness.\n\nNegative Points\n\nNu Skin Enterprises Inc (NYSE:NUS) faced increased foreign currency headwinds, which negatively impacted revenue by 3.8% or $18.2 million more than initially anticipated. Macroeconomic challenges, including inflationary pressures, are affecting consumer spending on premium goods, particularly impacting customer and affiliate acquisition efforts in the Americas. Consumer sentiment remains negative in key markets like South Korea and Japan, posing challenges to growth and channel building due to external economic factors. The company's subscription business in North America continues to be pressured by macroeconomic factors, necessitating adjustments to the business model in Latin America to counter these challenges. Despite maintaining the full-year outlook, there are ongoing concerns about the worsening trend in sales leaders, customer count, and affiliate numbers, raising questions about future performance.\n\nStory continues\n\nQ & A Highlights\n\nQ: What's really giving you confidence in the second half improvement, considering the worsening trend in sales leaders, customer count, and affiliate numbers?A: Ryan Napierski, President and CEO, highlighted channel activation plans and incentives aimed at improving these metrics. He mentioned the introduction of new products like Mind 360 and affordable luxury items, which are expected to combat inflationary effects and boost customer and affiliate acquisition. James Thomas, CFO, added that historically, Q3 and Q4 tend to be stronger, and they anticipate this trend will continue, contributing to the expected improvement.\n\nQ: Can you expand on the affordable luxury innovation and how it fits into your price architecture?A: Ryan Napierski explained that the company is focusing on expanding its portfolio to include more affordable luxury products, priced between $10 to $30, to meet consumer demand amidst inflation. These products are designed to maintain high quality while being cost-effective, addressing the essential benefits consumers seek.\n\nQ: What are the biggest areas of cost savings, and how do you plan to reinvest these savings?A: Ryan Napierski mentioned that SKU rationalization is a significant area of cost savings, which will be reinvested in product innovation and growth initiatives, particularly in the RISE business. James Thomas noted that as they work through existing inventory, they expect to see more savings, which will also support new product launches and market expansions.\n\nQ: How is the acquisition of Beauty Bio informing your core business, and what benefits have you realized from this acquisition?A: Ryan Napierski stated that Beauty Bio brings unique IP and insights into omnichannel and influencer-led branding, which are crucial for Nu Skin's growth in the beauty device market and broader beauty and wellness industry. The acquisition is seen as a strategic move to integrate influencer insights and omni-channel strategies into Nu Skin's business model.\n\nQ: Could you provide more details on the Mine 360 product line and how it differs from your existing supplement offerings?A: Ryan Napierski described Mine 360 as a holistic approach to cognitive health, addressing interrelated factors like stress, sleep, and cognitive performance. The product line will include various forms such as supplements, gummies, and drinkables, focusing on sustainability and innovative packaging to minimize environmental impact.\n\nQ: What macro pressures are currently impacting customer and affiliate growth, and how are you addressing these challenges?A: Ryan Napierski acknowledged the impact of inflation on consumer spending but noted the continued strength in their connected device business. He emphasized the strategic focus on affordable luxury and new product innovations like Mine 360 to meet consumer needs effectively despite economic pressures.\n\nFor the complete transcript of the earnings call, please refer to the full earnings call transcript.\n\nThis article first appeared on GuruFocus.\n\nView comments",
        "link": "https://finance.yahoo.com/news/nu-skin-enterprises-inc-nus-075451731.html",
        "symbols": [
            "NUS.BE",
            "NUS.MU",
            "NUS.STU",
            "NUS.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.996,
            "neg": 0.037,
            "neu": 0.84,
            "pos": 0.123
        }
    },
    {
        "date": "2024-05-08T20:45:11+00:00",
        "title": "Nu Skin (NYSE:NUS) Misses Q1 Revenue Estimates",
        "content": "Nu Skin (NYSE:NUS) Misses Q1 Revenue Estimates\n\nPersonal care company Nu Skin (NYSE:NUS) missed analysts' expectations in Q1 CY2024, with revenue down 13.3% year on year to $417.3 million. Next quarter's revenue guidance of $437.5 million also underwhelmed, coming in 3.7% below analysts' estimates. It made a non-GAAP profit of $0.09 per share, down from its profit of $0.37 per share in the same quarter last year.\n\nIs now the time to buy Nu Skin? Find out in our full research report.\n\nNu Skin (NUS) Q1 CY2024 Highlights:\n\nRevenue: $417.3 million vs analyst estimates of $432.4 million (3.5% miss) EPS (non-GAAP): $0.09 vs analyst estimates of $0.05 ($0.04 beat) Revenue Guidance for Q2 CY2024 is $437.5 million at the midpoint, below analyst estimates of $454.4 million EPS (non-GAAP) Guidance for Q2 CY2024 is $0.15 at the midpoint, below analyst estimates of $0.35 The company reconfirmed its revenue guidance for the full year of $1.8 billion at the midpoint Gross Margin (GAAP): 70.5%, down from 72.3% in the same quarter last year Market Capitalization: $608.4 million\n\nWith person-to-person marketing and sales rather than selling through retail stores, Nu Skin (NYSE:NUS) is a personal care and dietary supplements company that engages in direct selling.\n\nPersonal Care\n\nWhile personal care products products may seem more discretionary than food, consumers tend to maintain or even boost their spending on the category during tough times. This phenomenon is known as \"the lipstick effect\" by economists, which states that consumers still want some semblance of affordable luxuries like beauty and wellness when the economy is sputtering. Consumer tastes are constantly changing, and personal care companies are currently responding to the public’s increased desire for ethically produced goods by featuring natural ingredients in their products.\n\nSales Growth\n\nNu Skin carries some recognizable brands and products but is a mid-sized consumer staples company. Its size could bring disadvantages compared to larger competitors benefiting from better brand awareness and economies of scale. On the other hand, Nu Skin can still achieve high growth rates because its revenue base is not yet monstrous.\n\nAs you can see below, the company's revenue has declined over the last three years, dropping 11.4% annually. This is among the worst in the consumer staples industry, where demand is typically stable. Nu Skin Total Revenue\n\nThis quarter, Nu Skin missed Wall Street's estimates and reported a rather uninspiring 13.3% year-on-year revenue decline, generating $417.3 million in revenue. The company is guiding for a 12.5% year-on-year revenue decline next quarter to $437.5 million, a further deceleration from the 10.8% year-on-year decrease it recorded in the same quarter last year. Looking ahead, Wall Street expects revenue to decline 4.1% over the next 12 months.\n\nStory continues\n\nUnless you’ve been living under a rock, it should be obvious by now that generative AI is going to have a huge impact on how large corporations do business. While Nvidia and AMD are trading close to all-time highs, we prefer a lesser-known (but still profitable) semiconductor stock benefitting from the rise of AI. Click here to access our free report on our favorite semiconductor growth story.\n\nOperating Margin\n\nOperating margin is a key profitability metric for companies because it accounts for all expenses enabling a business to operate smoothly, including marketing and advertising, IT systems, wages, and other administrative costs.\n\nThis quarter, Nu Skin generated an operating profit margin of 2.1%, down 1.2 percentage points year on year. Because Nu Skin's gross margin decreased more than its operating margin, we can infer the company had weaker pricing power and higher raw materials/transportation costs. Nu Skin Operating Margin (GAAP)\n\nZooming out, Nu Skin was profitable over the last eight quarters but held back by its large expense base. It's demonstrated subpar profitability for a consumer staples business, producing an average operating margin of 2.9%. On top of that, Nu Skin's margin has slightly declined by 1.4 percentage points on average over the last year. This shows Nu Skin has faced some speed bumps along the way.\n\nKey Takeaways from Nu Skin's Q1 Results\n\nWe were impressed by how significantly Nu Skin blew past analysts' EPS expectations this quarter. We were also excited its operating margin outperformed Wall Street's estimates. On the other hand, its earnings forecast for next quarter missed analysts' expectations. Overall, the results could have been better. The stock is flat after reporting and currently trades at $12.3 per share.\n\nSo should you invest in Nu Skin right now? When making that decision, it's important to consider its valuation, business qualities, as well as what has happened in the latest quarter. We cover that in our actionable full research report which you can read here, it's free.\n\nView comments",
        "link": "https://finance.yahoo.com/news/nu-skin-nyse-nus-misses-204511024.html",
        "symbols": [
            "NUS.BE",
            "NUS.MU",
            "NUS.STU",
            "NUS.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.036,
            "neu": 0.834,
            "pos": 0.13
        }
    },
    {
        "date": "2024-05-08T20:06:00+00:00",
        "title": "Nu Skin Enterprises Reports First Quarter Results",
        "content": "PROVO, Utah, May 08, 2024--(BUSINESS WIRE)--Nu Skin Enterprises Inc. (NYSE: NUS) today announced first quarter results in line with guidance.\n\nExecutive Summary\r\nQ1 2024 vs. Prior-year Quarter Revenue $417.3 million; (13.3)%\n\n(3.8)% FX impact or $(18.2) million Rhyz revenue $62.5 million; 57.5% Earnings Per Share (EPS) $(0.01) or $0.09 excluding restructuring charges compared to $0.23 or $0.37 excluding restructuring charges Customers 875,261; (19)% Paid Affiliates 154,171; (30)% or (14)% excluding an adjustment to eligibility requirements Sales Leaders 38,609; (12)%\n\n\"Our first quarter revenue came in at the mid-point of our guidance, negatively impacted more than anticipated by foreign currency headwinds, while our cost management efforts helped us post earnings per share in the upper half of our guide,\" said Ryan Napierski, Nu Skin president and CEO. \"We are continuing our business transformation efforts and making progress in developing our integrated beauty, wellness and lifestyle ecosystem. During the quarter, we again drove strong gains in our Rhyz business, growing nearly 60% year-over-year. In our Nu Skin core business, the macro-economic environment impacted affiliate and customer growth around the globe, but we are encouraged by the performance of our ageLOC WellSpa iO, RenuSpa iO and TRMe launches.\n\n\"At our annual top sales leader event, we aligned around the upcoming preview of our new MYND360 cognitive health line and saw healthy energy for the opening of India next year. We also introduced some new early affiliate rewards and top leader incentives to help drive customer acquisition and business growth. While we continue to navigate the challenges of a business transformation amid these disruptive times, we continue to evolve our strategy for both our Nu Skin and Rhyz businesses and remain focused on generating long-term growth and returning value to shareholders.\"\n\nQ1 2024 Year-over-year Operating Results Revenue $417.3 million compared to $481.5 million\n\n(3.8)% FX impact or $(18.2) million Rhyz revenue $62.5 million; 57.5% Gross Margin 70.5% compared to 72.3%\n\nNu Skin business was 76.9% compared to 76.4% Selling Expenses 36.8% compared to 39.1%\n\nNu Skin business was 41.7% compared to 41.7% G&A Expenses 29.9% compared to 27.8% Operating Margin 2.1% or 3.8% excluding restructuring charges compared to 3.3% or 5.4% excluding restructuring charges Interest Expense $7.3 million compared to $4.9 million Other Income/(Expense) $(0.4) million compared to $3.4 million Income Tax Rate 148.4% or 48.5% excluding restructuring charges compared to 22.0% EPS $(0.01) or $0.09 excluding restructuring charges compared to $0.23 or $0.37 excluding restructuring charges\n\nStockholder Value Dividend Payments $3.0 million Stock Repurchases $0.0 million\n\n$162.4 million remaining in authorization\n\nQ2 and Full-year 2024 Outlook Q2 2024 Revenue $420 to $455 million; (16)% to (9)%\n\nApproximately (4) to (3)% FX impact Q2 2024 EPS $0.01 to $0.10 or $0.10 to $0.20 non-GAAP 2024 Revenue $1.73 to $1.87 billion; (12)% to (5)%\n\nApproximately (3) to (2)% FX impact 2024 EPS $0.77 to $1.16 or $0.95 to $1.35 non-GAAP\n\n\"We continue to implement strategic measures to refine our cost structure in line with business performance and strengthen our financial outlook,\" said James D. Thomas, chief financial officer. \"The additional efficiencies garnered from our cost-saving initiatives underscore our dedication to boosting productivity. We remain vigilant in scrutinizing all facets of our operations and prioritizing initiatives to drive revenue, amplify margins and secure our financial position. Although negative foreign currency impacted our results more than initially expected and will likely continue to do so, we are keeping our 2024 guidance numbers intact. For the second quarter, we project sequential improvement with revenue of $420 to $455 million, assuming an increased foreign currency impact, with reported earnings per share of $0.01 to $0.10 or $0.10 to $0.20 excluding restructuring charges.\"\n\nStory continues\n\nConference Call\n\nThe Nu Skin Enterprises management team will host a conference call with the investment community today at 5 p.m. (ET). Those wishing to access the webcast, as well as the financial information presented during the call, can visit the Investor Relations page on the company's website at ir.nuskin.com. A replay of the webcast will be available on the same page through May 22, 2024.\n\nAbout Nu Skin Enterprises Inc.\n\nThe Nu Skin Enterprises Inc. (NYSE: NUS) family of companies includes Nu Skin and Rhyz Inc. Nu Skin is an integrated beauty and wellness company, powered by a dynamic affiliate opportunity platform, which operates in nearly 50 markets worldwide. Backed by 40 years of scientific research, the company’s products help people look, feel and live their best with brands including Nu Skin® personal care, Pharmanex® nutrition and ageLOC® anti-aging, which includes an award-winning line of beauty device systems. Formed in 2018, Rhyz is a synergistic ecosystem of consumer, technology and manufacturing companies focused on innovation within the beauty, wellness and lifestyle categories.\n\nImportant Information Regarding Forward-Looking Statements: This press release contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, that represent the company’s current expectations and beliefs. All statements other than statements of historical fact are \"forward-looking statements\" for purposes of federal and state securities laws and include, but are not limited to, statements of management’s expectations regarding the macro environment and the company’s performance, growth and growth opportunities, shareholder value, productivity, product previews and launches, transformation, evolution, investments, initiatives, digital tools and initiatives, and new market expansion; projections regarding revenue, expenses, margins, tax rates, earnings per share, foreign currency fluctuations, future dividends, uses of cash, financial position and other financial items; statements of belief; and statements of assumptions underlying any of the foregoing. In some cases, you can identify these statements by forward-looking words such as \"believe,\" \"expect,\" \"anticipate,\" \"accelerate,\" \"project,\" \"vision,\" \"continue,\" \"outlook,\" \"guidance,\" \"improve,\" \"will,\" \"would,\" \"could,\" \"may,\" \"might,\" the negative of these words and other similar words.\n\nThe forward-looking statements and related assumptions involve risks and uncertainties that could cause actual results and outcomes to differ materially from any forward-looking statements or views expressed herein. These risks and uncertainties include, but are not limited to, the following:\n\nany failure of current or planned initiatives or products to generate interest among the company’s sales force and customers and generate sponsoring and selling activities on a sustained basis; risk that direct selling laws and regulations in any of the company’s markets, including the United States and Mainland China, may be modified, interpreted or enforced in a manner that results in negative changes to the company’s business model or negatively impacts its revenue, sales force or business, including through the interruption of sales activities, loss of licenses, increased scrutiny of sales force actions, imposition of fines, or any other adverse actions or events; economic conditions and events globally; competitive pressures in the company’s markets; risk that epidemics, including COVID-19 and related disruptions, or other crises could negatively impact our business; adverse publicity related to the company’s business, products, industry or any legal actions or complaints by the company’s sales force or others; political, legal, tax and regulatory uncertainties, including trade policies, associated with operating in Mainland China and other international markets; uncertainty regarding meeting restrictions and other government scrutiny in Mainland China, as well as negative media and consumer sentiment in Mainland China on our business operations and results; risk of foreign-currency fluctuations and the currency translation impact on the company’s business associated with these fluctuations; uncertainties regarding the future financial performance of the businesses the company has acquired; risks related to accurately predicting, delivering or maintaining sufficient quantities of products to support planned initiatives or launch strategies, and increased risk of inventory write-offs if the company over-forecasts demand for a product or changes its planned initiatives or launch strategies; regulatory risks associated with the company’s products, which could require the company to modify its claims or inhibit its ability to import or continue selling a product in a market if the product is determined to be a medical device or if the company is unable to register the product in a timely manner under applicable regulatory requirements; and the company’s future tax-planning initiatives, any prospective or retrospective increases in duties or tariffs on the company’s products imported into the company’s markets outside of the United States, and any adverse results of tax audits or unfavorable changes to tax laws in the company’s various markets.\n\nThe company’s financial performance and the forward-looking statements contained herein are further qualified by a detailed discussion of associated risks set forth in the documents filed by the company with the Securities and Exchange Commission. The forward-looking statements set forth the company’s beliefs as of the date that such information was first provided, and the company assumes no duty to update the forward-looking statements contained in this release to reflect any change except as required by law.\n\nNon-GAAP Financial Measures: Constant-currency revenue change is a non-GAAP financial measure that removes the impact of fluctuations in foreign-currency exchange rates, thereby facilitating period-to-period comparisons of the company’s performance. It is calculated by translating the current period’s revenue at the same average exchange rates in effect during the applicable prior-year period and then comparing that amount to the prior-year period’s revenue. The company believes that constant-currency revenue change is useful to investors, lenders and analysts because such information enables them to gauge the impact of foreign-currency fluctuations on the company’s revenue from period to period.\n\nEarnings per share, operating margin and income tax rate, each excluding restructuring and/or impairment charges, also are non-GAAP financial measures. Restructuring and impairment charges are not part of the ongoing operations of our underlying business. The company believes that these non-GAAP financial measures are useful to investors, lenders and analysts because removing the impact of these charges facilitates period-to-period comparisons of the company’s performance. Please see the reconciliations of these items to our earnings per share, operating margin and income tax rate calculated under GAAP, below.\n\nThe following table sets forth revenue for the three-month periods ended March 31, 2024, and 2023 for each of our reportable segments (U.S. dollars in thousands):\n\nThree Months Ended\n\nMarch 31, Constant-\r\nCurrency 2024 2023 Change Change Nu Skin Americas $ 75,031 $ 101,157 (25.8)% (20.1)% Mainland China 61,067 67,976 (10.2)% (6.1)% Southeast Asia/Pacific 60,065 67,810 (11.4)% (8.1)% Japan 44,236 52,606 (15.9)% (5.6)% Europa & Africa 42,273 47,444 (10.9)% (11.8)% South Korea 40,963 70,324 (41.8)% (39.3)% Hong Kong/Taiwan 30,466 34,548 (11.8)% (9.8)% Nu Skin other 672 (115) 684.3% 684.3% Total Nu Skin 354,773 441,750 (19.7)% (15.6)% Rhyz Investments Manufacturing 50,302 35,767 40.6% 40.6% Rhyz other 12,231 3,945 210.0% 210.0% Total Rhyz Investments 62,533 39,712 57.5% 57.5% Total $ 417,306 $ 481,462 (13.3)% (9.5)%\n\nThe following table provides information concerning the number of Customers, Paid Affiliates and Sales Leaders in our core Nu Skin business for the three-month periods ended March 31, 2024, and 2023:\n\nThree Months Ended\r\nMarch 31, 2024 2023 Change Customers Americas 199,399 266,378 (25)% Mainland China 162,239 217,101 (25)% Southeast Asia/Pacific 93,411 117,266 (20)% Japan 108,808 115,161 (6)% Europe & Africa 163,481 190,313 (14)% South Korea 100,230 120,907 (17)% Hong Kong/Taiwan 47,693 56,410 (15)% Total Customers 875,261 1,083,536 (19)%\n\nPaid Affiliates Americas 29,081 38,707 (25)% Mainland China 24,405 24,522 — Southeast Asia/Pacific 29,778 36,431 (18)% Japan(1) 21,679 37,155 (42)% Europe & Africa(1) 18,313 27,654 (34)% South Korea(1) 20,594 40,599 (49)% Hong Kong/Taiwan(1) 10,321 16,286 (37)% Total Paid Affiliates 154,171 221,354 (30)%\n\nSales Leaders Americas 6,616 8,242 (20)% Mainland China 9,600 10,034 (4)% Southeast Asia/Pacific 5,570 6,337 (12)% Japan 6,385 5,688 12% Europe & Africa 3,715 4,524 (18)% South Korea 4,122 6,242 (34)% Hong Kong/Taiwan 2,601 2,688 (3)% Total Sales Leaders 38,609 43,755 (12)%\n\n(1) The March 31, 2024, number is affected by a change in eligibility requirements for receiving certain rewards within our compensation structure. We plan to implement these changes in additional segments over the next several quarters. We estimate the change in eligibility requirements resulted in a reduction of approximately 14,000; 5,000; 13,000 and 3,000 for Japan, Europe & Africa, South Korea and Hong Kong/Taiwan, respectively.\n\n\"Customers\" are persons who have purchased directly from the Company during the three months ended as of the date indicated. Our Customer numbers include members of our sales force who made such a purchase, including Paid Affiliates and those who qualify as Sales Leaders, but they do not include consumers who purchase directly from members of our sales force. \"Paid Affiliates\" are any Brand Affiliates, as well as members of our sales force in Mainland China, who earned sales compensation during the three-month period. In all of our markets besides Mainland China, we refer to members of our independent sales force as \"Brand Affiliates\" because their primary role is to promote our brand and products through their personal social networks. \"Sales Leaders\" are the three-month average of our monthly Brand Affiliates, as well as sales employees and independent marketers in Mainland China, who achieved certain qualification requirements as of the end of each month of the quarter.\n\nNU SKIN ENTERPRISES, INC.\n\nConsolidated Statements of Income (Unaudited)\n\n(U.S. dollars in thousands, except per share amounts) Three Months Ended\n\nMarch 31, 2024 2023 Revenue $ 417,306 $ 481,462 Cost of sales 123,242 133,588 Gross profit 294,064 347,874 Operating expenses: Selling expenses 153,542 188,124 General and administrative expenses 124,566 133,899 Restructuring and impairment expenses 7,134 9,787 Total operating expenses 285,242 331,810 Operating income 8,822 16,064 Interest expense 7,325 4,888 Other income (expense), net (396) 3,412 Income before provision for income taxes 1,101 14,588 Provision for income taxes 1,634 3,212 Net (loss) income $ (533) $ 11,376 Net (loss) income per share: Basic $ (0.01) $ 0.23 Diluted $ (0.01) $ 0.23 Weighted-average common shares outstanding (000s): Basic 49,538 49,644 Diluted 49,538 50,058\n\nNU SKIN ENTERPRISES, INC.\n\nConsolidated Balance Sheets (Unaudited)\n\n(U.S. dollars in thousands) March 31,\n\n2024 December 31, 2023 ASSETS Current assets: Cash and cash equivalents $ 212,532 $ 256,057 Current investments 8,674 11,759 Accounts receivable, net 67,041 72,879 Inventories, net 265,100 279,978 Prepaid expenses and other 93,913 81,198 Total current assets 647,260 701,871 Property and equipment, net 422,818 432,965 Operating lease right-of-use assets 93,092 90,107 Goodwill 230,768 230,768 Other intangible assets, net 101,933 105,309 Other assets 246,044 245,443 Total assets $ 1,741,915 $ 1,806,463 LIABILITIES AND STOCKHOLDERS’ EQUITY Current liabilities: Accounts payable $ 32,237 $ 43,505 Accrued expenses 247,068 260,366 Current portion of long-term debt 30,000 25,000 Total current liabilities 309,305 328,871 Operating lease liabilities 74,198 70,943 Long-term debt 453,183 478,040 Other liabilities 95,023 106,641 Total liabilities 931,709 984,495 Commitments and contingencies Stockholders’ equity: Class A common stock – 500 million shares authorized, $0.001 par value, 90.6 million shares issued 91 91 Additional paid-in capital 618,706 621,853 Treasury stock, at cost – 40.9 million and 41.1 million shares (1,564,942) (1,570,440) Accumulated other comprehensive loss (110,607) (100,006) Retained earnings 1,866,958 1,870,470 Total stockholders’ equity 810,206 821,968 Total liabilities and stockholders’ equity $ 1,741,915 $ 1,806,463\n\nNU SKIN ENTERPRISES, INC.\r\nReconciliation of Operating Margin Excluding Impact of Restructuring to GAAP Operating Margin (in thousands, except for per share amounts) Three months ended\r\nMarch 31, 2024 2023 Operating Income $ 8,822 $ 16,064 Impact of restructuring and impairment: Restructuring and impairment 7,134 9,787 Adjusted operating income $ 15,956 $ 25,851 Operating margin 2.1% 3.3% Operating margin, excluding restructuring impact 3.8% 5.4% Revenue $ 417,306 $ 481,462\n\nNU SKIN ENTERPRISES, INC.\r\nReconciliation of Effective Tax Rate Excluding Impact of Restructuring to GAAP Effective Tax Rate (in thousands, except for per share amounts) Three months ended\r\nMarch 31, 2024 2023 Provision (benefit) for income taxes $ 1,634 $ 3,212 Impact of restructuring on provision for income taxes 2,356 2,593 Provision for income taxes, excluding impact of restructuring $ 3,990 $ 5,805 Income before provision for income taxes 1,101 14,588 Impact of restructuring and impairment expense: Restructuring and impairment 7,134 9,787 Income before provision for income taxes, excluding impact of restructuring $ 8,235 $ 24,375 Effective tax rate 148.4% 22.0% Effective tax rate, excluding restructuring impact 48.5% 23.8%\n\nNU SKIN ENTERPRISES, INC.\r\nReconciliation of Earnings Per Share Excluding Impact of Restructuring to GAAP Earnings Per Share (in thousands, except for per share amounts) Three months ended\r\nMarch 31, 2024 2023 Net (loss) income $ (533) $ 11,376 Impact of restructuring and impairment expense: Restructuring and impairment 7,134 9,787 Tax impact (2,356) (2,593) Adjusted net income $ 4,245 $ 18,570 Diluted earnings per share $ (0.01) $ 0.23 Diluted earnings per share, excluding restructuring impact $ 0.09 $ 0.37 Weighted-average common shares outstanding (000) 49,538 50,058\n\nNU SKIN ENTERPRISES, INC.\n\nReconciliation of Earnings Per Share Excluding Impact of Restructuring to GAAP Earnings Per Share Three months ended\r\nJune 30, Year ended\r\nDecember 31, 2024 - Low-end 2024 High-end 2024 - Low-end 2024 High-end Earnings Per Share $ 0.01 $ 0.10 $ 0.77 $ 1.16 Impact of restructuring expense: Restructuring 0.15 0.15 0.29 0.29 Tax impact (0.06) (0.05) (0.11) (0.10) Adjusted EPS $ 0.10 $ 0.20 $ 0.95 $ 1.35\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240508284158/en/\n\nContacts\n\nMedia: media@nuskin.com, (801) 345-6397\r\nInvestors: investorrelations@nuskin.com, (801) 345-3577\n\nView comments",
        "link": "https://finance.yahoo.com/news/nu-skin-enterprises-reports-first-200600727.html",
        "symbols": [
            "NUS.BE",
            "NUS.MU",
            "NUS.STU",
            "NUS.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.052,
            "neu": 0.83,
            "pos": 0.118
        }
    },
    {
        "date": "2024-05-08T20:05:00+00:00",
        "title": "Nu Skin Enterprises Announces Quarterly Dividend",
        "content": "PROVO, Utah, May 08, 2024--(BUSINESS WIRE)--Nu Skin Enterprises, Inc. (NYSE: NUS) today announced its board of directors has declared a quarterly cash dividend of $0.06 per share, which will be paid on June 12, 2024, to shareholders of record on May 31, 2024.\n\nAbout Nu Skin Enterprises, Inc.\n\nThe Nu Skin Enterprises Inc. (NYSE: NUS) family of companies includes Nu Skin and Rhyz Inc. Nu Skin is an integrated beauty and wellness company, powered by a dynamic affiliate opportunity platform, which operates in nearly 50 markets worldwide. Backed by 40 years of scientific research, the company’s products help people look, feel and live their best with brands including Nu Skin® personal care, Pharmanex® nutrition and ageLOC® anti-aging, which includes an award-winning line of beauty device systems. Rhyz is the strategic investment arm of Nu Skin Enterprises. Formed in 2018, Rhyz is a synergistic ecosystem of consumer, technology and manufacturing companies focused on innovation within the beauty, wellness and lifestyle categories.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240508634250/en/\n\nContacts\n\nMedia: media@nuskin.com, (801) 345-6397\r\nInvestors: investorrelations@nuskin.com, (801) 345-3577\n\nView comments",
        "link": "https://finance.yahoo.com/news/nu-skin-enterprises-announces-quarterly-200500757.html",
        "symbols": [
            "NUS.BE",
            "NUS.MU",
            "NUS.STU",
            "NUS.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.99,
            "neg": 0,
            "neu": 0.798,
            "pos": 0.202
        }
    },
    {
        "date": "2024-05-07T07:11:11+00:00",
        "title": "Nu Skin (NUS) Q1 Earnings: What To Expect",
        "content": "Nu Skin (NUS) Q1 Earnings: What To Expect\n\nPersonal care company Nu Skin (NYSE:NUS) will be announcing earnings results tomorrow after market close. Here's what to expect.\n\nNu Skin beat analysts' revenue expectations by 2.6% last quarter, reporting revenues of $488.6 million, down 6.5% year on year. It was a weak quarter for the company, with revenue guidance for next quarter missing analysts' expectations.\n\nIs Nu Skin a buy or sell going into earnings? Read our full analysis here, it's free.\n\nThis quarter, analysts are expecting Nu Skin's revenue to decline 10.2% year on year to $432.4 million, improving from the 20.4% decrease it recorded in the same quarter last year. Adjusted earnings are expected to come in at $0.05 per share. Nu Skin Total Revenue\n\nThe majority of analysts covering the company have reconfirmed their estimates over the last 30 days, suggesting they anticipate the business to stay the course heading into earnings. Nu Skin has missed Wall Street's revenue estimates five times over the last two years.\n\nLooking at Nu Skin's peers in the personal care segment, some have already reported their Q1 results, giving us a hint as to what we can expect. Coty delivered year-on-year revenue growth of 7.5%, meeting analysts' expectations, and USANA reported a revenue decline of 8.3%, in line with consensus estimates. USANA traded up 9.6% following the results.\n\nRead our full analysis of Coty's results here and USANA's results here.\n\nInvestors in the personal care segment have had steady hands going into earnings, with share prices flat over the last month. Nu Skin is down 2.6% during the same time and is heading into earnings with an average analyst price target of $14.5 (compared to the current share price of $12.2).\n\nUnless you’ve been living under a rock, it should be obvious by now that generative AI is going to have a huge impact on how large corporations do business. While Nvidia and AMD are trading close to all-time highs, we prefer a lesser-known (but still profitable) semiconductor stock benefitting from the rise of AI. Click here to access our free report on our favorite semiconductor growth story.\n\nView comments",
        "link": "https://finance.yahoo.com/news/nu-skin-nus-q1-earnings-071111948.html",
        "symbols": [
            "NUS.BE",
            "NUS.MU",
            "NUS.STU",
            "NUS.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.985,
            "neg": 0.019,
            "neu": 0.872,
            "pos": 0.108
        }
    },
    {
        "date": "2024-04-05T09:53:35+00:00",
        "title": "Q4 Earnings Roundup: Nu Skin (NYSE:NUS) And The Rest Of The Personal Care Segment",
        "content": "Q4 Earnings Roundup: Nu Skin (NYSE:NUS) And The Rest Of The Personal Care Segment\n\nLet's dig into the relative performance of Nu Skin (NYSE:NUS) and its peers as we unravel the now-completed Q4 personal care earnings season.\n\nWhile personal care products products may seem more discretionary than food, consumers tend to maintain or even boost their spending on the category during tough times. This phenomenon is known as \"the lipstick effect\" by economists, which states that consumers still want some semblance of affordable luxuries like beauty and wellness when the economy is sputtering. Consumer tastes are constantly changing, and personal care companies are currently responding to the public’s increased desire for ethically produced goods by featuring natural ingredients in their products.\n\nThe 13 personal care stocks we track reported a mixed Q4; on average, revenues beat analyst consensus estimates by 4% while next quarter's revenue guidance was 13.4% below consensus. Inflation (despite slowing) has investors prioritizing near-term cash flows, and while some of the personal care stocks have fared somewhat better than others, they have not been spared, with share prices declining 6.6% on average since the previous earnings results.\n\nNu Skin (NYSE:NUS)\n\nWith person-to-person marketing and sales rather than selling through retail stores, Nu Skin (NYSE:NUS) is a personal care and dietary supplements company that engages in direct selling.\n\nNu Skin reported revenues of $488.6 million, down 6.5% year on year, topping analyst expectations by 2.6%. It was a weak quarter for the company, with full-year revenue guidance missing analysts' expectations and underwhelming earnings guidance for the full year.\n\n“While we continue to work toward our long-term vision of becoming the world’s leading integrated beauty and wellness platform, our progress was impacted by persistent macro-economic pressures and disruptions associated with transforming our business,” said Ryan Napierski, Nu Skin president and CEO.\n\nStory continues Nu Skin Total Revenue\n\nNu Skin delivered the weakest full-year guidance update of the whole group. The stock is down 28.3% since the results and currently trades at $12.48.\n\nRead our full report on Nu Skin here, it's free.\n\nBest Q4: The Honest Company (NASDAQ:HNST)\n\nCo-founded by actress Jessica Alba, The Honest Company (NASDAQ:HNST) sells diapers and wipes, skin care products, and household cleaning products.\n\nThe Honest Company reported revenues of $90.26 million, up 10.3% year on year, outperforming analyst expectations by 7.3%. It was a very strong quarter for the company, with an impressive beat of analysts' revenue, adjusted EBITDA, and EPS expectations. The Honest Company Total Revenue\n\nThe stock is up 25.5% since the results and currently trades at $3.89.\n\nIs now the time to buy The Honest Company? Access our full analysis of the earnings results here, it's free.\n\nWeakest Q4: Medifast (NYSE:MED)\n\nKnown for its Optavia program that combines portion-controlled meal replacements with coaching, Medifast (NYSE:MED) has a broad product portfolio of bars, snacks, drinks, and desserts for those looking to lose weight or consume healthier foods.\n\nMedifast reported revenues of $191 million, down 43.4% year on year, exceeding analyst expectations by 3.7%. It was a weak quarter for the company, with revenue guidance for next quarter missing analysts' expectations.\n\nMedifast had the slowest revenue growth in the group. The stock is down 31.1% since the results and currently trades at $33.69.\n\nRead our full analysis of Medifast's results here.\n\nCoty (NYSE:COTY)\n\nWith a portfolio boasting many household brands, Coty (NYSE:COTY) is a beauty products powerhouse with offerings in cosmetics, fragrances, and skincare.\n\nCoty reported revenues of $1.73 billion, up 13.4% year on year, surpassing analyst expectations by 2.9%. It was a strong quarter for the company, with optimistic earnings guidance for the full year and a solid beat of analysts' earnings estimates.\n\nThe stock is down 8.9% since the results and currently trades at $11.11.\n\nRead our full, actionable report on Coty here, it's free.\n\nEstée Lauder (NYSE:EL)\n\nNamed after its founder, who was an entrepreneurial woman from New York with a passion for skincare, Estée Lauder (NYSE:EL) is a one-stop beauty shop with products in skincare, fragrance, makeup, sun protection, and men’s grooming.\n\nEstée Lauder reported revenues of $4.28 billion, down 7.4% year on year, in line with analyst expectations. It was a decent quarter for the company, with an impressive beat of analysts' earnings estimates but underwhelming earnings guidance for the next quarter.\n\nThe stock is up 7.8% since the results and currently trades at $144.64.\n\nRead our full, actionable report on Estée Lauder here, it's free.\n\nJoin Paid Stock Investor Research\n\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.",
        "link": "https://finance.yahoo.com/news/q4-earnings-roundup-nu-skin-095335770.html",
        "symbols": [
            "COTY.US",
            "EL.US",
            "HNST.US",
            "MDF.BE",
            "MDF.MU",
            "MDF.STU",
            "MED.US",
            "NUS.BE",
            "NUS.MU",
            "NUS.STU",
            "NUS.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.022,
            "neu": 0.846,
            "pos": 0.133
        }
    },
    {
        "date": "2024-04-03T20:05:00+00:00",
        "title": "Nu Skin Enterprises to Announce First Quarter 2024 Financial Results",
        "content": "PROVO, Utah, April 03, 2024--(BUSINESS WIRE)--Nu Skin Enterprises, Inc. (NYSE: NUS) today announced it will release first quarter 2024 results after the market closes on Wednesday, May 8. The Nu Skin management team will host a conference call with the investment community later that same day at 5 p.m. ET. During the call, management will discuss recent results and upcoming business initiatives.\n\nThe webcast of the conference call, including the financial information presented, will be available on the investor relations page of the company’s website at ir.nuskin.com. A replay of the webcast will be available at the same location through Wednesday, May 22.\n\nAbout Nu Skin Enterprises, Inc.\n\nThe Nu Skin Enterprises Inc. (NYSE: NUS) family of companies includes Nu Skin and Rhyz Inc. Nu Skin is an integrated beauty and wellness company, powered by a dynamic affiliate opportunity platform, which operates in nearly 50 markets worldwide. Backed by 40 years of scientific research, the company’s products help people look, feel and live their best with brands including Nu Skin® personal care, Pharmanex® nutrition and ageLOC® anti-aging, which includes an award-winning line of beauty device systems. Formed in 2018, Rhyz is a synergistic ecosystem of consumer, technology and manufacturing companies focused on innovation within the beauty, wellness and lifestyle categories.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240403305871/en/\n\nContacts\n\nMedia: media@nuskin.com, (801) 345-6397\r\nInvestors: investorrelations@nuskin.com, (801) 345-3577\n\nView comments",
        "link": "https://finance.yahoo.com/news/nu-skin-enterprises-announce-first-200500070.html",
        "symbols": [
            "NUS.BE",
            "NUS.MU",
            "NUS.STU",
            "NUS.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.989,
            "neg": 0,
            "neu": 0.845,
            "pos": 0.155
        }
    },
    {
        "date": "2024-03-18T18:08:25+00:00",
        "title": "High-Yield Dividend Stocks to Avoid: 3 Dangerous Picks",
        "content": "Dividends that provide a passive source of revenue for investors often seem great on the surface. Stocks with high yields can sometimes indicate a company’s instability or solely serve the purpose of attracting investors without offering sustainable returns.\n\nThe three stocks we’ll introduce in this article have very high dividends but shaky financials and past troubles with cuts. Investors should be aware of the real picture behind the attractive dividend rates that these companies proclaim.\n\nTo better understand these stocks, we’ll detail their long-term performances, any significant changes made to their dividend rates, and relevant financial history.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nIcahn Enterprises (IEP) Icahn Enterprises Conglomerate company logo seen displayed on smart phone. IEP stock\n\nSource: IgorGolovniov / Shutterstock.com\n\nIcahn Enterprises (NASDAQ:IEP) is the company of Carl Icahn, a well-known investor. Despite a history of large payouts, it has seen a lot of scrutiny in its time. Troubles that Icahn Enterprises has faced include a federal investigation for fraud. This is a questionable trend by short-sellers who profit from a stock’s poor performance.\n\nAfter the investigation was announced last May, Icahn Enterprises’ stock price took a significant hit. It dropped from its $50 base to its current $17 low. This is still reflected in IEP’s current price.\n\nAs a result of this poor performance, Icahn Enterprises offers a forward yield of 22.90%, a significant cut from its more than 30% yield from a year ago. The negative performance has also attracted the attention of short-sellers who regularly take advantage of the downward trends that affect it.\n\nWith the current state of Icahn Enterprises and its ability to provide investors with promised returns, you should think twice before buying or keeping this stock.\n\nNu Skin Enterprises (NUS) woman smiling with white background\n\nSource: Odua Images via Shutterstock\n\nCurrently, Nu Skin Enterprises (NYSE:NUS) has a forward yield of 11.77%. But, the company’s financials from the past year indicate payouts are unlikely to be sustainable.\n\nStory continues\n\nIn fact, Nu Skin Enterprises has paid out over 130% of its profit yet was still forced to make quarterly dividend cuts. And this year, it is experiencing negative dividend growth. The company is not making more than it is paying. So payouts are unlikely for its current dividend yield.\n\nPart of these cuts come from a year-over-year (YOY) revenue decline of near 6%. Additionally, the company’s layoffs last November were part of a restructuring project. These terminations were a direct result of the company’s poor performance in last year’s Q3.\n\nWith Nu Skin Enterprises’ current low, investors should understand the possibility of further dividend cuts. Think twice before buying NUS simply for the high yield.\n\nAT&T (T) AT&T Retail cell phone and mobility store. T stock\n\nSource: Jonathan Weiss / Shutterstock.com\n\nPossibly the largest worldwide telecommunications companies, AT&T (NYSE:T) offers a dividend yield of 6.52%. By comparison, the S&P500 average is 2%. However, AT&T’s Q4 report included a -$0.07 drop in earnings per share YOY.\n\nEven though revenue was up in 2023 YOY, the company continues facing daunting debt of over $150 billion with rising interest rates. High debt is accompanied by the risk that AT&T will not be able to pay the high dividend it promises.\n\nIn addition to lower-than-expected earnings last year, AT&T hasn’t performed in line with the S&P 500 average in total returns. It’s never been an outstanding performer for investors in the past. Therefore, despite promises of high yields, the safety of those dividends should be called into question.\n\nOn the date of publication, Joel Lim did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nJoel Lim is a finance freelance writer who writes content for several companies like LTSE and Realtor, along with financial publications, including Mises Institute and Foundation for Economic Education.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. It doesn’t matter if you have $500 or $5 million. Do this now.\n\nThe post High-Yield Dividend Stocks to Avoid: 3 Dangerous Picks appeared first on InvestorPlace.",
        "link": "https://finance.yahoo.com/news/high-yield-dividend-stocks-avoid-180825552.html",
        "symbols": [
            "ATTB34.SA",
            "IEP.US",
            "NUS.BE",
            "NUS.MU",
            "NUS.STU",
            "NUS.US",
            "SOBA.BE",
            "SOBA.DU",
            "SOBA.F",
            "SOBA.HM",
            "SOBA.STU",
            "SOBA.XETRA",
            "T.MX",
            "T.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": -0.901,
            "neg": 0.106,
            "neu": 0.798,
            "pos": 0.095
        }
    },
    {
        "date": "2024-02-27T12:00:00+00:00",
        "title": "Nu Skin Launches RenuSpa iO, a New Personalized Beauty and Wellness Device",
        "content": "The new self-care system uses unique adaptive microcurrent technology to help the body restore, revitalize and refresh through skin stimulation\n\nPROVO, Utah, Feb. 27, 2024 /PRNewswire/ -- Nu Skin Enterprises (NYSE: NUS), a global beauty and wellness leader, today introduced Nu Skin RenuSpa iO, a smart beauty and wellness device designed to promote overall wellness and body confidence through skin stimulation. RenuSpa iO is an FDA-cleared microcurrent body device and the latest innovation from the world's best-selling brand for beauty device systems for six consecutive years.*\n\nExperience the full interactive Multichannel News Release here: https://www.multivu.com/players/English/9197951-nu-skin-launches-personalized-beauty-and-wellness-device-renuspa-io/\n\nRenuSpa iO is a one-of-a-kind device that helps to restore wellbeing, revitalize your appearance and refresh your body through skin stimulation. The device uses patent-pending adaptive microcurrent technology that continuously adapts (more than 80 times per second) to your skin's conductivity throughout each session. The patent-pending design of the metallic nodes on the device help provide a smooth, comfortable massage. Designed for use on the upper and lower legs, arms and abdomen, the nodes are designed to perfectly fit the contours of your body and glide smoothly over your skin.\n\n\"We've expanded our best-selling beauty device portfolio to now include our first integrated beauty and wellness device,\" said Ryan Napierski, president and CEO at Nu Skin. \"RenuSpa iO provides visible beauty benefits, as well as comprehensive wellness benefits to help the body restore, revitalize and refresh. RenuSpa iO delivers all these benefits with a unique and personalized at-home experience.\"\n\nUsing the Nu Skin Vera® app, you can view live data insights throughout your personalized RenuSpa iO experience to see how the adaptive microcurrent technology adjusts in real time. The app offers guided tutorials, a library of routines and usage tracking to help see results over time. You also get a personalized iO score to help you stay motivated.\n\nStory continues\n\n\"RenuSpa iO is game-changing technology for the global beauty and wellness market,\" said Steve Hatchett, executive vice president and chief product officer at Nu Skin. \"RenuSpa iO is the result of years of Nu Skin research on microcurrent technology and how to make it easy to use, comfortable and effective. On average, RenuSpa iO makes 25,000 real-time adjustments each session, creating one of the most personalized and powerful ways to support improvements to beauty and overall feelings of wellbeing.\"\n\nThrough skin stimulation, RenuSpa iO helps to:\n\nDepuff the skin's appearance Visibly contour and reduce the appearance of dimples for a smoother, radiant look Visibly tone and sculpt Visibly firm and tighten for a more youthful appearance Provide a spa-like experience to lift mood, improve overall feelings of wellbeing, and help you look and feel better Leave the skin feeling energized Leave the body feeling refreshed and relaxed Provide a smooth, comfortable massage\n\nClinical Testing\n\nNu Skin commissioned a 12-week study of the RenuSpa iO with 42 participants between the ages of 25 and 65. The participants used the RenuSpa iO device with Nu Skin Conductive Gel five times a week for five minutes per area (e.g., abdomen, back of upper arm, back of upper thigh including buttocks) to assess visible skin depuffing, toning and sculpting. Thigh and arm circumferences were taken at baseline and at weeks 2, 4, 8 and 12.\n\nComparing use after 12 weeks to baseline, the study showed the ability of Nu Skin RenuSpa iO device, through skin stimulation, to visibly tone, hydrate, and reduce the appearance of dimpled skin on the upper thigh and abdomen. Participants noted improvements in the appearance of their skin's firmness, smoothness and contour.\n\nAvailability\n\nThe Nu Skin RenuSpa iO is now available in the U.S. for $375. For more information, visit nuskin.com.\n\nThe Nu Skin Vera app is available for download on all smart phones and pairs with any RenuSpa iO device to deliver a premium connected experience.\n\nAbout Nu Skin Enterprises\n\nThe Nu Skin Enterprises Inc. (NYSE: NUS) family of companies includes Nu Skin and Rhyz Inc. Nu Skin is an integrated beauty and wellness company, powered by a dynamic affiliate opportunity platform, which operates in nearly 50 markets worldwide. Backed by nearly 40 years of scientific research, the company's products help people look, feel and live their best with brands including Nu Skin® personal care, Pharmanex® nutrition and ageLOC® anti-aging, which includes an award-winning line of beauty device systems. Formed in 2018, Rhyz is a synergistic ecosystem of consumer, technology and manufacturing companies focused on innovation within the beauty, wellness and lifestyle categories.\n\n*Source Euromonitor International Limited; Retail Value RSP terms; all channels; 2017 to 2022. Beauty Systems are at-home Skin Care Beauty Devices that are exclusively paired or recommended to be used with a topical consumable of the same brand. Claim verification based on Euromonitor custom research and methodology conducted April - June of 2023. Sales of at-home skin care beauty devices includes sales of electric facial cleansers as defined in Passport database. This category does not include hair care/removal appliances, body shavers, and oral care appliances.\n\nNu Skin Social Media Channels\n\nfb.com/nuskin  x.com/nuskin instagram.com/nuskin Introducing Nu Skin RenuSpa iO Nu_Skin_Logo_v1 Cision\n\nView original content:https://www.prnewswire.com/news-releases/nu-skin-launches-renuspa-io-a-new-personalized-beauty-and-wellness-device-302071713.html\n\nSOURCE Nu Skin Enterprises, Inc.",
        "link": "https://finance.yahoo.com/news/nu-skin-launches-renuspa-io-120000398.html",
        "symbols": [
            "NUS.BE",
            "NUS.MU",
            "NUS.STU",
            "NUS.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.007,
            "neu": 0.76,
            "pos": 0.233
        }
    },
    {
        "date": "2024-02-19T19:12:58+00:00",
        "title": "Analysts Just Shaved Their Nu Skin Enterprises, Inc. (NYSE:NUS) Forecasts Dramatically",
        "content": "Today is shaping up negative for Nu Skin Enterprises, Inc. (NYSE:NUS) shareholders, with the analysts delivering a substantial negative revision to this year's forecasts. Both revenue and earnings per share (EPS) forecasts went under the knife, suggesting analysts have soured majorly on the business.\n\nFollowing the downgrade, the consensus from three analysts covering Nu Skin Enterprises is for revenues of US$1.8b in 2024, implying a discernible 7.9% decline in sales compared to the last 12 months. Per-share earnings are expected to jump 473% to US$0.99. Prior to this update, the analysts had been forecasting revenues of US$2.0b and earnings per share (EPS) of US$2.15 in 2024. Indeed, we can see that the analysts are a lot more bearish about Nu Skin Enterprises' prospects, administering a measurable cut to revenue estimates and slashing their EPS estimates to boot.\n\nSee our latest analysis for Nu Skin Enterprises  earnings-and-revenue-growth\n\nIt'll come as no surprise then, to learn that the analysts have cut their price target 26% to US$15.50.\n\nOne way to get more context on these forecasts is to look at how they compare to both past performance, and how other companies in the same industry are performing. One more thing stood out to us about these estimates, and it's the idea that Nu Skin Enterprises' decline is expected to accelerate, with revenues forecast to fall at an annualised rate of 7.9% to the end of 2024. This tops off a historical decline of 4.2% a year over the past five years. Compare this against analyst estimates for companies in the broader industry, which suggest that revenues (in aggregate) are expected to grow 7.1% annually. So it's pretty clear that, while it does have declining revenues, the analysts also expect Nu Skin Enterprises to suffer worse than the wider industry.\n\nThe Bottom Line\n\nThe most important thing to take away is that analysts cut their earnings per share estimates, expecting a clear decline in business conditions. Regrettably, they also downgraded their revenue estimates, and the latest forecasts imply the business will grow sales slower than the wider market. Given the scope of the downgrades, it would not be a surprise to see the market become more wary of the business.\n\nStory continues\n\nEven so, the longer term trajectory of the business is much more important for the value creation of shareholders. We have estimates - from multiple Nu Skin Enterprises analysts - going out to 2025, and you can see them free on our platform here.\n\nOf course, seeing company management  invest large sums of money in a stock can be just as useful as knowing whether analysts are downgrading their estimates. So you may also wish to search this free list of stocks that insiders are buying.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.",
        "link": "https://finance.yahoo.com/news/analysts-just-shaved-nu-skin-191258656.html",
        "symbols": [
            "NUS.BE",
            "NUS.MU",
            "NUS.STU",
            "NUS.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.905,
            "neg": 0.053,
            "neu": 0.872,
            "pos": 0.075
        }
    },
    {
        "date": "2024-02-18T12:36:53+00:00",
        "title": "Nu Skin Enterprises (NYSE:NUS) Is Reducing Its Dividend To $0.06",
        "content": "Nu Skin Enterprises, Inc. (NYSE:NUS) is reducing its dividend from last year's comparable payment to $0.06 on the 6th of March. This means that the annual payment is 1.8% of the current stock price, which is lower than what the rest of the industry is paying.\n\nView our latest analysis for Nu Skin Enterprises\n\nNu Skin Enterprises Is Paying Out More Than It Is Earning\n\nIt would be nice for the yield to be higher, but we should also check if higher levels of dividend payment would be sustainable. Before making this announcement, Nu Skin Enterprises' dividend was higher than its profits, but the free cash flows quite comfortably covered it. Generally, we think cash is more important than accounting measures of profit, so with the cash flows easily covering the dividend, we don't think there is much reason to worry.\n\nOver the next year, EPS is forecast to grow rapidly. If recent patterns in the dividend continues, we would start to get a bit worried, with the payout ratio possibly reaching 138%. historic-dividend\n\nDividend Volatility\n\nThe company's dividend history has been marked by instability, with at least one cut in the last 10 years. Since 2014, the dividend has gone from $1.20 total annually to $0.24. Dividend payments have fallen sharply, down 80% over that time. Declining dividends isn't generally what we look for as they can indicate that the company is running into some challenges.\n\nDividend Growth Potential Is Shaky\n\nGiven that dividend payments have been shrinking like a glacier in a warming world, we need to check if there are some bright spots on the horizon. Over the past five years, it looks as though Nu Skin Enterprises' EPS has declined at around 40% a year. This steep decline can indicate that the business is going through a tough time, which could constrain its ability to pay a larger dividend each year in the future. Over the next year, however, earnings are actually predicted to rise, but we would still be cautious until a track record of earnings growth can be built.\n\nStory continues\n\nNu Skin Enterprises' Dividend Doesn't Look Sustainable\n\nOverall, it's not great to see that the dividend has been cut, but this might be explained by the payments being a bit high previously. In the past, the payments have been unstable, but over the short term the dividend could be reliable, with the company generating enough cash to cover it. This company is not in the top tier of income providing stocks.\n\nCompanies possessing a stable dividend policy will likely enjoy greater investor interest than those suffering from a more inconsistent approach. Meanwhile, despite the importance of dividend payments, they are not the only factors our readers should know when assessing a company. For example, we've picked out 3 warning signs for Nu Skin Enterprises that investors should know about before committing capital to this stock. Looking for more high-yielding dividend ideas? Try our collection of strong dividend payers.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.",
        "link": "https://finance.yahoo.com/news/nu-skin-enterprises-nyse-nus-123653128.html",
        "symbols": [
            "NUS.BE",
            "NUS.MU",
            "NUS.STU",
            "NUS.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.986,
            "neg": 0.065,
            "neu": 0.83,
            "pos": 0.105
        }
    },
    {
        "date": "2024-02-16T10:50:36+00:00",
        "title": "Nu Skin Enterprises Full Year 2023 Earnings: EPS Misses Expectations",
        "content": "Nu Skin Enterprises (NYSE:NUS) Full Year 2023 Results\n\nKey Financial Results\n\nRevenue: US$1.97b (down 12% from FY 2022). Net income: US$8.60m (down 92% from FY 2022). Profit margin: 0.4% (down from 4.7% in FY 2022). EPS: US$0.17 (down from US$2.10 in FY 2022). earnings-and-revenue-growth\n\nAll figures shown in the chart above are for the trailing 12 month (TTM) period\n\nNu Skin Enterprises EPS Misses Expectations\n\nRevenue was in line with analyst estimates. Earnings per share (EPS) missed analyst estimates by 72%.\n\nLooking ahead, revenue is forecast to grow 1.2% p.a. on average during the next 2 years, compared to a 7.0% growth forecast for the Personal Products industry in the US.\n\nPerformance of the American Personal Products industry.\n\nThe company's shares are down 22% from a week ago.\n\nRisk Analysis\n\nBe aware that  Nu Skin Enterprises is showing  3 warning signs in our investment analysis and 1 of those is significant...\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.",
        "link": "https://finance.yahoo.com/news/nu-skin-enterprises-full-2023-105036335.html",
        "symbols": [
            "NUS.BE",
            "NUS.MU",
            "NUS.STU",
            "NUS.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.452,
            "neg": 0.043,
            "neu": 0.91,
            "pos": 0.047
        }
    },
    {
        "date": "2024-02-15T18:02:18+00:00",
        "title": "Why Nu Skin (NUS) Stock Is Trading Lower Today",
        "content": "Why Nu Skin (NUS) Stock Is Trading Lower Today\n\nWhat Happened:\n\nShares of personal care company Nu Skin (NYSE:NUS) fell 27.3% in the mornin session after the company reported fourth-quarter results and provided underwhelming guidance. Specifically, full-year revenue and EPS guidance missed analysts' expectations by a large amount. Next quarter's guidance was no better, with both revenue and EPS again coming in below expectations. Overall, this was a mediocre quarter for Nu Skin.\n\nThe stock market overreacts to news, and big price drops can present good opportunities to buy high-quality stocks. Is now the time to buy Nu Skin? Access our full analysis report here, it's free.\n\nWhat is the market telling us:\n\nNu Skin's shares are not very volatile than the market average and over the last year have had only 10 moves greater than 5%. Moves this big are very rare for Nu Skin and that is indicating to us that this news had a significant impact on the market's perception of the business.\n\nNu Skin is down 33.4% since the beginning of the year, and at $13.53 per share it is trading 70.2% below its 52-week high of $45.38 from February 2023. Investors who bought $1,000 worth of Nu Skin's shares 5 years ago would now be looking at an investment worth $214.44.\n\nHere at StockStory, we certainly understand the potential of thematic investing. Diverse winners from Microsoft (MSFT) to Alphabet (GOOG), Coca-Cola (KO) to Monster Beverage (MNST) could all have been identified as promising growth stories with a megatrend driving the growth. So, in that spirit, we’ve identified a relatively under-the-radar profitable growth stock benefitting from the rise of AI, available to you FREE via this link.",
        "link": "https://finance.yahoo.com/news/why-nu-skin-nus-stock-180218880.html",
        "symbols": [
            "NUS.BE",
            "NUS.MU",
            "NUS.STU",
            "NUS.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.992,
            "neg": 0.031,
            "neu": 0.781,
            "pos": 0.188
        }
    },
    {
        "date": "2024-02-15T13:13:53+00:00",
        "title": "Nu Skin Enterprises, Inc. (NYSE:NUS) Q4 2023 Earnings Call Transcript",
        "content": "Nu Skin Enterprises, Inc. (NYSE:NUS) Q4 2023 Earnings Call Transcript February 14, 2024\n\nNu Skin Enterprises, Inc. isn't one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here).\n\nOperator: Thank you for standing by, and welcome to Nu Skin Enterprises Q4 2023 Earnings Conference Call. At this time, all participants are in a listen-only mode. After the speakers’ presentation, there will be a question-and-answer session. [Operator Instructions] Please be advised that today's call is being recorded. I would now like to turn the conference over to your host, Mr. Scott Pond, Vice President of Investor Relations. Please go ahead.\n\nScott Pond: Thanks, Valerie, and good afternoon, everyone. Today on the call with me are Ryan Napierski, President and CEO; and James Thomas, CFO. On today's call comments will be made that include some forward-looking statements. These statements involve risks and uncertainties and actual results may differ materially from those discussed or anticipated. Please refer to today's earnings release and our SEC filings for a complete discussion of these risks. Also during the call, certain financial numbers may be discussed that differ from comparable numbers obtained in our financial statements. We believe these non-GAAP numbers assist in comparing period-to-period results in a more consistent manner. Please refer to our investor website for any required reconciliation of non-GAAP numbers. And with that, I'll turn the call over to Ryan.\n\nRyan Napierski: Thanks, Scott. Hello, everyone. Thanks for joining our call today. We have a lot to cover in today's call. So let's jump into business performance and then, on to expanded enterprise vision and strategy. We are pleased to deliver fourth quarter revenue above our latest guidance range driven by the continued rollout of ageLOC WellSpa iO in many markets, seasonal promotions in China and the continued strong performance of our Rhyz businesses. This quarter further demonstrated that while we continue to make progress towards our long-term vision, much of our headway was concealed by the persistent macroeconomic pressures impacting consumer spending and customer acquisition around the globe, as well as disruptions associated with the ongoing transformation of our core business.\n\nStory continues\n\nThis was particularly evident in the fourth quarter results, which were down in our Americas, South Korea and Europe and Africa segments. This was offset by seasonal promotions in Mainland, China stabilization in Japan and modest growth in our Hong Kong, Taiwan segment. In addition, we achieved over 100% growth in our Rhyz businesses, which accounted for 13% of our revenue in the fourth quarter and continues to become a more meaningful part of our [Technical Difficulty] end users are achieving their desired results with this more personalized approach. WellSpa iO has been a strong addition to our number one beauty device systems brand and is generating consumer interest with demonstrable results. WellSpa iO is scheduled to launch in Mainland China in Q2 and we'll be launching a similar device RenuSpa iO in the U.S. later this quarter.\n\nMoving into 2024, we are preparing to enter the rapidly growing $10 billion brain health market. Stress, sleep and mental acuity are all growing concerns for consumers around the world, and our unique approach to holistic wellness positions us to provide integrated solutions to help our consumers find better balance in their lives. We will be introducing this new division and brand at our live events in Q3. We also continue to focus on deepening connectivity with customers and affiliates through enhanced capabilities and feature sets in the Vera and Stela apps which we believe will enable deeper connections with our customers to meet their personalized needs. Geographically, we continue to see near-term pressures on consumer spending related to extended hyperinflationary conditions around the globe.\n\nThe Americas, South Korea, Europe and Southeast Asia all experienced a more difficult year as consumers shifted purchasing habits towards lower-priced goods and services. In the meantime, we will be introducing new affordable luxury products targeting the masstige customer segments, including a series of new product regimens being rolled out in the U.S. and South Korea this quarter. Together with WellSpa, RenuSpa and our [indiscernible], we anticipate leveling trends in the business moving into the second half of 2024. Mainland China experienced stabilization in our business in the fourth quarter, which was associated with seasonal promotions. While we continue to believe in the potential of this great market, we anticipate ongoing challenges as the economy works to recover over the coming year.\n\nWe are introducing a new go-to-market model, partnering with Douyin, a sister app of TikTok, which will begin being tested and refined in the first half of '24. Japan, Hong Kong and Taiwan each showed favorable outcomes in 2023, and we anticipate these trends to continue moving into 2024. Next, let me discuss our expanded enterprise ecosystem vision and strategy, including Rhyz, which is becoming a more substantial part of our business. As consumer discovery and purchasing behavior shift further from traditional media into social media, influencer and affiliate marketing continues to grow at an accelerating pace. A recent statistic study estimates influencer marketing in the U.S. to grow from $6 billion to around $69 billion by 2029. We believe that we are well positioned to capitalize upon this shift as we expand our enterprise vision towards becoming the world's leading integrated beauty, wellness and lifestyle ecosystem.\n\nThis implies an even broader opportunity in the mid to long term as we further build out our Rhyz business segments and seek synergistic opportunities across our business units. By applying our nearly 40 years of learnings and affiliate marketing from our core business with new capabilities and learnings from our Rhyz businesses, we see greater potential for driving enterprise value over time via this expansive beauty, wellness and lifestyle ecosystem. In order to further enable this expanded vision, we have been reviewing all aspects of our business and reassessing our approach to capital allocation to invest in long-term growth and business evolution. This includes rebalancing our dividend payout ratio to be more in line with or better than our industry peers.\n\nThis move will provide increased financial flexibility, enabling us to effectively seize forthcoming opportunities. This was a difficult decision for our management team and the Board and one that we don't take lightly. However, after extensive analysis and careful deliberation, we believe this move is in the best interest of all stakeholders as we pursue our long-term enterprise ecosystem vision for growth. This capital reallocation will free up approximately $65 million annually that will be directed towards high potential growth investments, which in the near term will be relatively evenly spread across the following three areas. Number one, accelerating the growth opportunities in our Rhyz ecosystem, which grew 41% last year and is becoming a more substantial portion of the overall enterprise.\n\nNumber two, facilitating a progressive new market expansion model for our core Nu Skin business, beginning with India, anticipated in 2025. And number three, furthering the build-out of our digital first affiliate opportunity platform with an extended technology partnership with Infosys. Given the importance of our updates to strategy and capital allocation, I want to spend a few minutes diving deeper into the areas we are now targeting for stepping up investment. I'll start with Rhyz, which was established back in 2018 as part of our enterprise diversification strategy. Rhyz is a synergistic ecosystem of consumer, technology and manufacturing companies focused on innovation within the beauty, wellness and lifestyle space. These companies synergistically support our core business and/or have capabilities that provide greater growth potential to our expanding ecosystem vision.\n\nRhyz has experienced healthy organic and acquisition led growth and most of the businesses are still very early in their life cycles. In the fourth quarter, Rhyz revenues were up over 100% or 87% excluding last year's BeautyBio acquisition. Rhyz segments accounted for 13% of total enterprise revenue in the fourth quarter, and we anticipate this growing to 20% to 25% by 2025. With an increased investment in Rhyz, we plan to increase manufacturing capabilities and capacity to service Nu Skin as well as additional consumer goods and indie brands, expand technology capabilities for Mavely, which is rapidly becoming a leading affiliate brand marketplace and technology provider for our other businesses and develop a creator led indie beauty brand Incubator, including new and acquired brands. A smiling woman applying a product from the company's skin care line.\n\nFor the Incubator, we will be able to leverage the BeautyBio integration and acceleration framework that we developed last year. For the past several years, we've been building the infrastructure necessary to incubate, launch and support creator brands with an array of services, including product R&D, manufacturing and packaging, technology, logistics and internationalization. These additional Rhyz investments will enable us to delve further into the influencer or creator economy and is far reaching opportunities in the beauty, wellness and lifestyle space. We are well positioned to service the creator economy and indie brand markets by leveraging our vast array of resources on our way to becoming the world's leading integrated beauty, wellness and lifestyle ecosystem.\n\nNext, new market expansion, beginning with India. This vibrant country is rapidly becoming the world's fastest growing economy with 1.4 billion people, a growing middle class and the highest per capita digital and mobile adoption, we see India as a market holding great potential for us. Nu Skin has a rich history of international expansion that has fueled our growth into nearly 50 markets around the globe. We plan to reinvent the way we go-to-market with a progressive digital first model, which will enable us to expand our global footprint more quickly and cost effectively accelerating our ability to bring Nu Skin to people around the world who are seeking to look, feel and live better. We will be aligning with our global sales leaders around an anticipated 2025 entry into the strategically important market at our annual team elite trip this April.\n\nAnd third -- our third area of focus is further investment in our digital first affiliate opportunity platform. We aim to provide our brand affiliates with a simpler, faster and easier way to engage in our businesses around the globe. Through our expanded partnership with Infosys, we plan to enhance our digital ecosystem, accelerate our global Equinox rollout and streamline the affiliate journey to minimize friction and accelerate growth. So in summary, 2024 will be another year filled with transformation of our core Nu Skin business to win in the future and further our build-out of the Rhyz ecosystem. Our initial outlook for 2024 reflects further macro challenges in the core lessening throughout the year, partially offset by continued double-digit growth from the Rhyz segments.\n\nThroughout these challenging times, we remain optimistic in our future growth potential as we continue to reposition the enterprise towards becoming the world's leading integrated beauty, wellness and lifestyle ecosystem. And with that, I'll turn the call over to James to dive deeper into our guidance and the financials. James?\n\nJames Thomas: Thank you, Ryan, and thanks to all of you for joining today. I'll provide a brief Q4 and 2023 full year financial review and then, give Q1 and 2024 projections. For additional details, please visit our Investor Relations website. For 2023, we generated revenue of $1.97 billion with a negative foreign currency impact of 3% or $60 million. Earnings per share for the year were $0.17 or $1.85 excluding restructuring and other charges compared to $2.07 or $2.90, excluding restructuring and impairment charges. For the fourth quarter, we posted revenue of $488.6 million which was ahead of our previous guidance range and included a negative foreign currency impact of 1% or $7.2 million. Reported earnings, which also came in slightly ahead of previous guidance were $0.15 or $0.37, excluding restructuring and other charges compared to $1.15 or $0.89, excluding restructuring impairment charges and a favorable tax rate in Q4 2022.\n\nOur gross margin was 72.1% compared to 71.7%. Fourth quarter gross margin for the core Nu Skin business was 77.4% compared to 74.9% in the prior year quarter. The 250 basis point improvement in our core business was primarily driven by the strategic decision to rebalance our product portfolio, reduce product promotions and the intentional focus on higher margin products. Selling expense as a percentage of revenue decreased to 37.1% compared to 38.5% in the prior year quarter. The lower selling expense is due in large part to growth in our Rhyz manufacturing segment, which carries a lower selling expense. For the core Nu Skin business, selling expense was 40.8% compared to 40.5%, in line with expectations. General and administrative expenses as a percentage of revenue were 29.7% compared to 24.4%.\n\nThe increased percentage can largely be attributed to lower quarterly revenue levels and increased promotional campaign spend in the quarter. As previously discussed, during the fourth quarter, we made the decision to strategically reevaluate our Nu Skin core business and align our operating costs to be in line with revenue. In the fourth quarter, we incurred an initial $10 million charge in severance and made the determination to extend our restructuring and cost efficiency program through Q2 of 2024 with an anticipated additional $15 million of restructuring charges. We expect the cost efficiency program to deliver annual savings of between $40 million and $65 million before taxes in the core Nu Skin operating plan, excluding investments in Rhyz.\n\nWe will continue to seek business efficiencies in all areas and believe these actions will help us maximize cash flows, target improve margins and enhance earnings per share going forward. Operating margin for the quarter was 3.3% or 6.4%, excluding restructuring and other charges compared to 5.3% or 8.8%, excluding restructuring and impairment charges in the prior year. The other income expense line reflects a $6.7 million expense compared to a $3.1 million expense in the prior year quarter. We generated strong cash from operations for the fourth quarter of $54 million compared to $26 million in the prior year period. This was mainly, driven by focused efforts in improving existing inventory levels and tightening our supply chain. We paid $19.3 million in dividends and did not repurchase any stock.\n\nWe have $162.4 million remaining on the current authorization. Our tax rate for the quarter was 21.9% or 24.9% excluding restructuring and impairment charges compared to negative 134.9% or negative 3.7%, excluding restructuring impairment charges in the prior year period. For the first quarter, we anticipate an elevated tax rate in the range of 60% to 70% due to rate impacts from stock awards and anticipate a projected 2024 annual tax rate of 25% to 35%. This annual rate reflects an anticipated higher global effective tax rate primarily due to the expected geographical mix of earnings during the year and the rate impact from our stock awards in Q1. As Ryan mentioned and as part of our long-term transformational goals today, today, we announced an update to our capital allocation strategy, rebalancing the quarterly dividend of $0.06 per share.\n\nWe remain in a strong financial position and will continue to generate healthy cash flow. This dividend change plus our overall payout ratio more in line with or better than our industry peers and will provide approximately $65 million in capital that can be used to fund growth opportunities. This action also enables us to prioritize responsible debt management, actively pursue inorganic growth opportunities and enhance shareholder value through opportunistic share repurchases. Shifting focus now to guidance. Taking into account the aforementioned economic conditions and challenges associated with transforming our business, we are projecting 2024 revenue in the $1.73 billion to $1.87 billion range. We anticipate earnings per share of $0.75 to $1.15 or adjusted earnings of $0.95 to $1.35.\n\nOur guidance assumes a negative foreign currency impact of approximately 1% and assumes a higher effective tax rate of 25% to 35%, primarily due to the expected geographic mix of earnings during the year. We are projecting first quarter revenue of $400 million to $435 million, assuming a foreign currency headwind of approximately 3% with reported earnings per share of negative $0.07 to $0.03 and or to $0.00 to $0.10 excluding restructuring charges. In closing, as we realign the company for success by transforming our core Nu Skin business and expand our Rhyz ecosystem, we are structuring ourselves to increase investments in promising high-growth opportunities that will benefit all stakeholders as we implement our comprehensive enterprise vision and strategy.\n\nOur dedication to generating lasting value for the enterprise remains steadfast as we position ourselves for future growth. And with that, operator, we'll now open the call up for questions.\n\nSee also 30 Unhappiest Countries In The World and 35 Biggest Football Clubs in the World.\n\nTo continue reading the Q&A session, please click here.",
        "link": "https://finance.yahoo.com/news/nu-skin-enterprises-inc-nyse-131353354.html",
        "symbols": [
            "NUS.BE",
            "NUS.MU",
            "NUS.STU",
            "NUS.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.028,
            "neu": 0.832,
            "pos": 0.141
        }
    },
    {
        "date": "2024-02-14T22:14:30+00:00",
        "title": "Nu Skin Enterprises Inc. Reports Mixed 2023 Financial Results Amidst Economic Challenges",
        "content": "Revenue: $1.97 billion in 2023, a decrease of 12% from the previous year. Earnings Per Share (EPS): $0.17, or $1.85 excluding certain charges, down from $2.07 or $2.90 in 2022. Gross Margin: Improved to 72.1% in Q4 2023 from 71.7% in Q4 2022. Operating Margin: 3.3% in Q4 2023, or 6.4% excluding charges, compared to 5.3% or 8.8% in Q4 2022. Dividend: A quarterly cash dividend of $0.06 per share announced, payable on March 6, 2024. 2024 Outlook: Revenue projected between $1.73 to $1.87 billion, with EPS between $0.75 to $1.15, or $0.95 to $1.35 non-GAAP.\n\nWarning! GuruFocus has detected 10 Warning Signs with NUS.\n\nOn February 14, 2024, Nu Skin Enterprises Inc (NYSE:NUS) released its 8-K filing, reporting its fourth quarter and full-year 2023 results which slightly surpassed the company's latest guidance. Nu Skin, a global direct-selling company specializing in health and beauty products, faced a challenging year with a 12% decline in annual revenue, attributed in part to a 3% foreign exchange impact.\n\nFinancial Performance and Challenges\n\nNu Skin's revenue for the fourth quarter was $488.6 million, a 6% decrease compared to the same period in the previous year, with foreign exchange impacting revenue by approximately 1%. The company's Rhyz segment, however, saw a significant increase, contributing $65.1 million in revenue, marking a 101% growth. Earnings per share (EPS) for the quarter stood at $0.15, or $0.37 excluding restructuring and other charges, a decrease from $1.15, or $0.89 excluding similar charges in the prior year.\n\nThe company's President and CEO, Ryan Napierski, acknowledged the impact of macro-economic pressures and the challenges of transforming the business. Despite setbacks in the Americas, South Korea, and Europe & Africa, there was some offsetting growth in Mainland China, Japan, and the Hong Kong/Taiwan segment. Napierski emphasized the company's commitment to long-term value and its strategy to reposition Nu Skin to succeed in the evolving beauty and wellness industries.\n\nStory continues\n\nFinancial Achievements and Industry Importance\n\nNu Skin's gross margin improved to 72.1% in the fourth quarter of 2023 from 71.7% in the same quarter of the previous year. This improvement is particularly significant for a consumer packaged goods company, as it indicates better cost management and the potential for increased profitability. Selling expenses as a percentage of revenue decreased, while general and administrative expenses increased, reflecting the company's ongoing investments in business transformation.\n\nKey Financial Metrics\n\nKey financial metrics for Nu Skin include a decrease in customers by 15% and a 30% reduction in paid affiliates, or 13% when adjusting for changes in eligibility requirements. Sales leaders also saw a 10% decrease. These metrics are crucial as they reflect the direct-selling business model's health and the company's ability to attract and retain sales talent.\n\n\"We are committed to generating long-term enterprise value by repositioning our company to win in the rapidly evolving beauty and wellness industries,\" said Ryan Napierski, Nu Skin president and CEO.\n\nAnalysis of Company Performance\n\nNu Skin's performance in 2023 was a mix of challenges and strategic growth areas. While the overall revenue decline reflects broader economic pressures and the pains of business transformation, the strong growth in the Rhyz segment and improved gross margins suggest areas of resilience and potential for future growth. The company's focus on digital-first affiliate opportunities and planned expansion into new markets like India in 2025 indicate a forward-looking strategy.\n\nThe company's capital allocation priorities have been updated, with a rebalanced dividend payout ratio and a focus on three key investment initiatives. These include accelerating growth in the Rhyz ecosystem, expanding into new markets, and building out a digital-first affiliate opportunity platform.\n\nFor 2024, Nu Skin anticipates continued challenges in the global macro environment but expects improvements throughout the year. The guidance for the year reflects this cautious optimism, with revenue and EPS projections accounting for potential foreign currency impacts and restructuring charges.\n\nNu Skin's board of directors has declared a quarterly cash dividend of $0.06 per share, demonstrating a commitment to shareholder returns even as the company navigates through a transformative period.\n\nFor more detailed financial information and to access the webcast of the management team's conference call with the investment community, investors are encouraged to visit the Investor Relations page on Nu Skin's website.\n\nAs Nu Skin Enterprises Inc (NYSE:NUS) continues to adapt to the evolving landscape of the beauty and wellness industries, investors and stakeholders will be watching closely to see how the company's strategic initiatives unfold in the coming year.\n\nExplore the complete 8-K earnings release (here) from Nu Skin Enterprises Inc for further details.\n\nThis article first appeared on GuruFocus.",
        "link": "https://finance.yahoo.com/news/nu-skin-enterprises-inc-reports-221430813.html",
        "symbols": [
            "NUS.BE",
            "NUS.MU",
            "NUS.STU",
            "NUS.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.995,
            "neg": 0.03,
            "neu": 0.844,
            "pos": 0.127
        }
    },
    {
        "date": "2024-02-14T21:30:29+00:00",
        "title": "Nu Skin's (NYSE:NUS) Q4 Sales Top Estimates But Stock Drops 12.6%",
        "content": "Nu Skin's (NYSE:NUS) Q4 Sales Top Estimates But Stock Drops 12.6%\n\nPersonal care company Nu Skin (NYSE:NUS) reported Q4 FY2023 results topping analysts' expectations , with revenue down 6.5% year on year to $488.6 million. On the other hand, next quarter's revenue guidance of $417.5 million was less impressive, coming in 13% below analysts' estimates. It made a non-GAAP profit of $0.37 per share, down from its profit of $0.89 per share in the same quarter last year.\n\nIs now the time to buy Nu Skin? Find out by accessing our full research report, it's free.\n\nNu Skin (NUS) Q4 FY2023 Highlights:\n\nRevenue: $488.6 million vs analyst estimates of $476.4 million (2.6% beat) EPS (non-GAAP): $0.37 vs analyst estimates of $0.28 (29.9% beat) Revenue Guidance for Q1 2024 is $417.5 million at the midpoint, below analyst estimates of $479.7 million EPS (non-GAAP) Guidance for Q1 2024 is $0.05 at the midpoint, below analyst estimates of $0.34 Management's revenue guidance for the upcoming financial year 2024 is $1.8 billion at the midpoint, missing analyst estimates by 10.6% and implying -8.6% growth (vs -11.2% in FY2023) Gross Margin (GAAP): 72.1%, in line with the same quarter last year Market Capitalization: $859.2 million\n\n“While we continue to work toward our long-term vision of becoming the world’s leading integrated beauty and wellness platform, our progress was impacted by persistent macro-economic pressures and disruptions associated with transforming our business,” said Ryan Napierski, Nu Skin president and CEO.\n\nWith person-to-person marketing and sales rather than selling through retail stores, Nu Skin (NYSE:NUS) is a personal care and dietary supplements company that engages in direct selling.\n\nPersonal Care\n\nPersonal care products include lotions, fragrances, shampoos, cosmetics, and nutritional supplements, among others. While these products may seem more discretionary than food, consumers tend to maintain or even boost their spending on the category during tough times. This phenomenon is known as \"the lipstick effect\" by economists, which states that consumers still want some semblance of affordable luxuries like beauty and wellness when the economy is sputtering. As with other consumer staples categories, personal care brands must exude quality and be priced optimally given the crowded competitive landscape. Consumer tastes are constantly changing, and personal care companies are currently responding to the public’s increased desire for ethically produced goods by featuring natural ingredients in their products.\n\nStory continues\n\nSales Growth\n\nNu Skin carries some recognizable brands and products but is a mid-sized consumer staples company. Its size could bring disadvantages compared to larger competitors benefiting from better brand awareness and economies of scale. On the other hand, Nu Skin can still achieve high growth rates because its revenue base is not yet monstrous.\n\nAs you can see below, the company's revenue has declined over the last three years, dropping 8.6% annually. This is among the worst in the consumer staples industry, where demand is typically stable. Nu Skin Total Revenue\n\nThis quarter, Nu Skin's revenue fell 6.5% year on year to $488.6 million but beat Wall Street's estimates by 2.6%. The company is guiding for a 13.3% year-on-year revenue decline next quarter to $417.5 million, an improvement from the 20.4% year-on-year decrease it recorded in the same quarter last year. Looking ahead, Wall Street expects sales to grow 2.3% over the next 12 months, an acceleration from this quarter.\n\nUnless you’ve been living under a rock, it should be obvious by now that generative AI is going to have a huge impact on how large corporations do business. While Nvidia and AMD are trading close to all-time highs, we prefer a lesser-known (but still profitable) semiconductor stock benefitting from the rise of AI. Click here to access our free report on our favorite semiconductor growth story.\n\nOperating Margin\n\nOperating margin is a key profitability metric for companies because it accounts for all expenses enabling a business to operate smoothly, including marketing and advertising, IT systems, wages, and other administrative costs.\n\nIn Q4, Nu Skin generated an operating profit margin of 3.3%, down 2 percentage points year on year. Conversely, the company's gross margin actually increased, so we can assume the reduction was driven by operational inefficiencies and a step up in discretionary spending in areas like corporate overhead and advertising. Nu Skin Operating Margin (GAAP)\n\nZooming out, Nu Skin was profitable over the last eight quarters but held back by its large expense base. It's demonstrated subpar profitability for a consumer staples business, producing an average operating margin of 3.6%. On top of that, Nu Skin's margin has declined by 2.5 percentage points on average over the last year. This shows the company is heading in the wrong direction, and investors are likely hoping for better results in the future.\n\nKey Takeaways from Nu Skin's Q4 Results\n\nSure, revenue and EPS exceeded Wall Street's expectations this quarter. However, guidance was very bad. Specifically, full-year revenue and EPS guidance missed analysts' expectations by a large amount. Next quarter's guidance was no better, with both revenue and EPS again coming in below expectations. Overall, this was a mediocre quarter for Nu Skin. The company is down 12.6% on the results and currently trades at $15.21 per share.\n\nNu Skin may have had a tough quarter, but does that actually create an opportunity to invest right now? When making that decision, it's important to consider its valuation, business qualities, as well as what has happened in the latest quarter. We cover that in our actionable full research report which you can read here, it's free.",
        "link": "https://finance.yahoo.com/news/nu-skins-nyse-nus-q4-213029280.html",
        "symbols": [
            "NUS.BE",
            "NUS.MU",
            "NUS.STU",
            "NUS.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.039,
            "neu": 0.814,
            "pos": 0.147
        }
    },
    {
        "date": "2024-02-14T21:05:00+00:00",
        "title": "Nu Skin Enterprises Reports Fourth Quarter and Full-year 2023 Results Above Company Guidance",
        "content": "Company updates capital allocation priorities, announces dividend and provides initial outlook for Q1 and FY 2024\n\nPROVO, Utah, February 14, 2024--(BUSINESS WIRE)--Nu Skin Enterprises Inc. (NYSE: NUS) today announced fourth quarter and full-year 2023 results slightly above its latest guidance.\n\nExecutive Summary Q4 2023 vs. Prior-year Quarter\n\nRevenue $488.6 million; (6)%\n\n(1)% FX impact or $(7.2) million Rhyz revenue $65.1 million; 101% Earnings Per Share (EPS) $0.15 or $0.37 excluding restructuring and other charges, compared to $1.15 or $0.89 excluding restructuring and impairment charges and a favorable tax rate in Q4 22 Customers 977,039; (15)% Paid Affiliates 166,886; (30)% or (13)% excluding an adjustment to eligibility requirements Sales Leaders 44,059; (10)%\n\nExecutive Summary 2023 vs. 2022\n\nRevenue: $1.97 billion; (12)%\n\n(3)% FX impact or $(60.4) million Rhyz revenue $216.6 million; 41% Earnings Per Share (EPS): $0.17 or $1.85 excluding inventory write-off and other charges, compared to $2.07 or $2.90 excluding restructuring and impairment charges\n\n\"While we continue to work toward our long-term vision of becoming the world’s leading integrated beauty and wellness platform, our progress was impacted by persistent macro-economic pressures and disruptions associated with transforming our business,\" said Ryan Napierski, Nu Skin president and CEO. \"This was particularly evident with our fourth quarter results, which were down in our Americas, South Korea and Europe & Africa segments. This was offset by seasonal promotions in Mainland China, stabilization in Japan and modest growth in our Hong Kong/Taiwan segment. In addition, we achieved strong growth in our Rhyz businesses, which accounted for 13 percent of our revenue in the fourth quarter.\n\n\"We are committed to generating long-term enterprise value by repositioning our company to win in the rapidly evolving beauty and wellness industries by further transforming our core Nu Skin business and accelerating investment in our rapidly growing Rhyz ecosystem,\" continued Napierski. \"To enhance this transformation, we are reassessing our approach to capital allocation to invest in long-term growth and business evolution. This initiative aims to grant us increased financial flexibility, enabling us to effectively seize forthcoming growth opportunities. This includes rebalancing our dividend payout ratio to be in line with or better than our industry peers. With the additional available capital, we will focus our investments relatively evenly across three key initiatives: 1) accelerating the growth opportunities in Rhyz; 2) facilitating a new market expansion model beginning with India anticipated in 2025; and 3) furthering the build-out of our digital-first affiliate opportunity platform. While we continue to navigate the challenges of a business transformation amid these disruptive times, we have fine-tuned our strategy and remain confident in our ability to generate long-term growth and value for shareholders.\"\n\nStory continues\n\nQ4 2023 Year-over-year Operating Results\n\nRevenue $488.6 million compared to $522.3 million\n\n(1)% FX impact or $(7.2) million Rhyz revenue $65.1 million; 101% Gross Margin 72.1% compared to 71.7%\n\nNu Skin business was 77.4% compared to 74.9% Selling Expenses 37.1% compared to 38.5%\n\nNu Skin business was 40.8% compared to 40.5% G&A Expenses 29.7% compared to 24.4% Operating Margin 3.3% or 6.4% excluding restructuring and other charges compared to 5.3% or 8.8% excluding restructuring and impairment charges Other Expense $(6.7) million compared to $(3.1) million Income Tax Rate 21.9% or 24.9% excluding restructuring and other charges compared to (134.9)% or (3.7)% excluding restructuring and impairment charges EPS $0.15 or $0.37 excluding restructuring and other charges compared to $1.15 or $0.89 excluding restructuring and impairment charges and a tax method change\n\nStockholder Value\n\nDividend Payments $19.3 million Stock Repurchases $0.0 million\n\n$162.4 million remaining in authorization\n\nQ1 and Full-year 2024 Outlook\n\nQ1 2024 Revenue $400 to $435 million; (17)% to (10)%\n\nApproximately (3) to (2)% FX impact Q1 2024 EPS $(0.07) to $0.03 or $0.00 to $0.10 non-GAAP 2024 Revenue $1.73 to $1.87 billion; (12)% to (5)%\n\nApproximately (1)% FX impact 2024 EPS $0.75 to $1.15 or $0.95 to $1.35 non-GAAP\n\n\"Our initial 2024 guidance assumes the global macro environment remains challenging in the near-term, improving throughout the year,\" said James D. Thomas, chief financial officer. \"Our annual revenue guidance is $1.73 to $1.87 billion, with an approximate 1% foreign currency headwind. We anticipate reported EPS of $0.75 to $1.15 or adjusted earnings of $0.95 to $1.35, excluding charges associated with our extended restructuring plan. Our guidance reflects an anticipated higher global effective tax rate, primarily due to the expected geographical mix of earnings during the year. For the first quarter, we project revenue of $400 to $435 million, assuming a negative foreign currency impact of approximately 3%, with reported earnings per share of $(0.07) to $0.03 or $0.00 to $0.10 excluding restructuring charges.\"\n\nDividend Payout The Nu Skin Enterprises board of directors has declared a quarterly cash dividend of $0.06 per share, which will be paid on March 6, 2024, to shareholders of record on Feb. 26, 2024.\n\nConference Call The Nu Skin Enterprises management team will host a conference call with the investment community today at 5 p.m. (ET). Those wishing to access the webcast, as well as the financial information presented during the call, can visit the Investor Relations page on the company's website at ir.nuskin.com. A replay of the webcast will be available on the same page through Feb. 28, 2024.\n\nAbout Nu Skin Enterprises Inc. The Nu Skin Enterprises Inc. (NYSE: NUS) family of companies includes Nu Skin and Rhyz Inc. Nu Skin is an integrated beauty and wellness company, powered by a dynamic affiliate opportunity platform, which operates in nearly 50 markets worldwide. Backed by nearly 40 years of scientific research, the company’s products help people look, feel and live their best with brands including Nu Skin® personal care, Pharmanex® nutrition and ageLOC® anti-aging, which includes an award-winning line of beauty device systems. Formed in 2018, Rhyz is a synergistic ecosystem of consumer, technology and manufacturing companies focused on innovation within the beauty, wellness and lifestyle categories.\n\nImportant Information Regarding Forward-Looking Statements: This press release contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, that represent the company’s current expectations and beliefs. All statements other than statements of historical fact are \"forward-looking statements\" for purposes of federal and state securities laws and include, but are not limited to, statements of management’s expectations regarding the macro environment and the company’s performance, growth and growth opportunities, shareholder value, financial flexibility, transformation, evolution, investments, initiatives, digital tools and initiatives, and new market expansion; projections regarding revenue, expenses, tax rates, earnings per share, foreign currency fluctuations, future dividends, uses of cash and other financial items; statements of belief; and statements of assumptions underlying any of the foregoing. In some cases, you can identify these statements by forward-looking words such as \"believe,\" \"expect,\" \"aim,\" \"commit,\" \"reposition,\" \"anticipate,\" \"accelerate,\" \"project,\" \"vision,\" \"continue,\" \"outlook,\" \"guidance,\" \"improve,\" \"will,\" \"would,\" \"could,\" \"may,\" \"might,\" the negative of these words and other similar words.\n\nThe forward-looking statements and related assumptions involve risks and uncertainties that could cause actual results and outcomes to differ materially from any forward-looking statements or views expressed herein. These risks and uncertainties include, but are not limited to, the following:\n\nany failure of current or planned initiatives or products to generate interest among the company’s sales force and customers and generate sponsoring and selling activities on a sustained basis; risk that direct selling laws and regulations in any of the company’s markets, including the United States and Mainland China, may be modified, interpreted or enforced in a manner that results in negative changes to the company’s business model or negatively impacts its revenue, sales force or business, including through the interruption of sales activities, loss of licenses, increased scrutiny of sales force actions, imposition of fines, or any other adverse actions or events; economic conditions and events globally; competitive pressures in the company’s markets; risk that epidemics, including COVID-19 and related disruptions, or other crises could negatively impact our business; adverse publicity related to the company’s business, products, industry or any legal actions or complaints by the company’s sales force or others; political, legal, tax and regulatory uncertainties, including trade policies, associated with operating in Mainland China and other international markets; uncertainty regarding meeting restrictions and other government scrutiny in Mainland China, as well as negative media and consumer sentiment in Mainland China on our business operations and results; risk of foreign-currency fluctuations and the currency translation impact on the company’s business associated with these fluctuations; uncertainties regarding the future financial performance of the businesses the company has acquired; risks related to accurately predicting, delivering or maintaining sufficient quantities of products to support planned initiatives or launch strategies, and increased risk of inventory write-offs if the company over-forecasts demand for a product or changes its planned initiatives or launch strategies; regulatory risks associated with the company’s products, which could require the company to modify its claims or inhibit its ability to import or continue selling a product in a market if the product is determined to be a medical device or if the company is unable to register the product in a timely manner under applicable regulatory requirements; and the company’s future tax-planning initiatives, any prospective or retrospective increases in duties or tariffs on the company’s products imported into the company’s markets outside of the United States, and any adverse results of tax audits or unfavorable changes to tax laws in the company’s various markets.\n\nThe company’s financial performance and the forward-looking statements contained herein are further qualified by a detailed discussion of associated risks set forth in the documents filed by the company with the Securities and Exchange Commission. The forward-looking statements set forth the company’s beliefs as of the date that such information was first provided, and the company assumes no duty to update the forward-looking statements contained in this release to reflect any change except as required by law.\n\nNon-GAAP Financial Measures: Constant-currency revenue change is a non-GAAP financial measure that removes the impact of fluctuations in foreign-currency exchange rates, thereby facilitating period-to-period comparisons of the company’s performance. It is calculated by translating the current period’s revenue at the same average exchange rates in effect during the applicable prior-year period and then comparing that amount to the prior-year period’s revenue. The company believes that constant-currency revenue change is useful to investors, lenders and analysts because such information enables them to gauge the impact of foreign-currency fluctuations on the company’s revenue from period to period.\n\nEarnings per share, operating margin and income tax rate, each excluding inventory write-off charges, restructuring charges, and/or other charges, also are non-GAAP financial measures. Inventory write-off charges and restructuring charges are not part of the ongoing operations of our underlying business, and the legal accrual and non-recurring foreign tax charge that have been excluded in the non-GAAP financial measures are not typical for our ongoing operations. The company believes that these non-GAAP financial measures are useful to investors, lenders and analysts because removing the impact of these charges facilitates period-to-period comparisons of the company’s performance. Please see the reconciliations of these items to our earnings per share, operating margin and income tax rate calculated under GAAP, below.\n\nThe following table sets forth revenue for the three-month periods ended December 31, 2023, and 2022 for each of our reportable segments (U.S. dollars in thousands):\n\nThree Months Ended December 31, Constant-Currency 2023 2022 Change Change Nu Skin Americas $ 97,753 $ 128,921 (24)% (19)% Mainland China 71,516 73,935 (3)% (2)% Southeast Asia/Pacific 66,889 76,606 (13)% (12)% South Korea 48,380 60,029 (19)% (22)% Japan 50,966 53,877 (5)% (1)% Europe & Africa 47,892 55,337 (13)% (18)% Hong Kong/Taiwan 41,209 39,789 4% 5% Nu Skin other (1,066) 1,525 (170)% (170)% Total Nu Skin 423,539 490,019 (14)% (12)% Rhyz Manufacturing 50,363 29,560 70% 70% Rhyz other 14,738 2,761 434% 434% Total Rhyz 65,101 32,321 101% 101% Total $ 488,640 $ 522,340 (6)% (5)%\n\nThe following table sets forth revenue for the years ended December 31, 2023, and 2022 for each of our reportable segments (U.S. dollars in thousands):\n\nYear Ended December 31, Constant-Currency 2023 2022 Change Change Nu Skin Americas $ 398,222 $ 508,537 (22)% (18)% Mainland China 298,079 360,389 (17)% (13)% Southeast Asia/Pacific 267,206 344,411 (22)% (21)% South Korea 236,099 268,707 (12)% (11)% Japan 207,833 224,896 (8)% (1)% Europe & Africa 192,352 204,275 (6)% (8)% Hong Kong/Taiwan 153,589 157,197 (2)% 1% Nu Skin other -858 3,959 (122)% (122)% Total Nu Skin 1,752,522 2,072,371 (15)% (13)% Rhyz Manufacturing 181,395 149,458 21% 21% Rhyz other 35,214 3,830 819% 819% Total Rhyz 216,609 153,288 41% 41% Total $ 1,969,131 $ 2,225,659 (12)% (9)%\n\nThe following table provides information concerning the number of Customers, Paid Affiliates and Sales Leaders in our core Nu Skin business for the three-month periods ended December 31, 2023, and 2022:\n\nYear Ended December 31, 2023 2022 Change Customers Americas 231,183 299,287 (23)% Mainland China 207,276 202,933 2% Southeast Asia/Pacific 106,471 141,183 (25)% South Korea 103,151 123,749 (17)% Japan 113,670 119,152 (5)% Europe & Africa 163,178 197,917 (18)% Hong Kong/Taiwan 52,110 62,903 (17)% Total Customers 977,039 1,147,124 (15)%\n\nPaid Affiliates Americas 31,910 42,633 (25)% Mainland China 25,889 23,436 10% Southeast Asia/Pacific 34,404 38,653 (11)% South Korea(1) 22,166 45,058 (51)% Japan(1) 22,417 38,021 (41)% Europe & Africa(1) 18,888 31,869 (41)% Hong Kong/Taiwan(1) 11,212 17,286 (35)% Total Paid Affiliates 166,886 236,956 (30)%\n\nSales Leaders Americas 7,126 9,594 (26)% Mainland China 11,296 12,359 (9)% Southeast Asia/Pacific 6,418 6,999 (8)% South Korea 5,249 6,094 (14)% Japan 7,086 5,936 19% Europe & Africa 3,968 4,740 (16)% Hong Kong/Taiwan 2,916 3,015 (3)% Total Sales Leaders 44,059 48,737 (10)%\n\n(1) The December 31, 2023, number is affected by a change in eligibility requirements for receiving certain rewards within our compensation structure. We plan to implement these changes in additional segments over the next several quarters. We estimate the change in eligibility requirements resulted in a reduction of approximately 14 thousand, 15 thousand, 6 thousand and 3 thousand for South Korea, Japan, Europe & Africa and Hong Kong/Taiwan, respectively.\n\n\"Customers\" are persons who have purchased directly from the Company during the three months ended as of the date indicated. Our Customer numbers include members of our sales force who made such a purchase, including Paid Affiliates and those who qualify as Sales Leaders, but they do not include consumers who purchase directly from members of our sales force. \"Paid Affiliates\" are any Brand Affiliates, as well as members of our sales force in Mainland China, who earned sales compensation during the three-month period. In all of our markets besides Mainland China, we refer to members of our independent sales force as \"Brand Affiliates\" because their primary role is to promote our brand and products through their personal social networks. \"Sales Leaders\" are the three-month average of our monthly Brand Affiliates, as well as sales employees and independent marketers in Mainland China, who achieved certain qualification requirements as of the end of each month of the quarter.\n\nNU SKIN ENTERPRISES, INC.\n\nConsolidated Statements of Income (Unaudited)\n\n(U.S. dollars in thousands, except per share amounts) Three Months Ended\r\nDecember 31, Year Ended\r\nDecember 31, 2023 2022 2023 2022 Revenue $ 488,640 $ 522,340 $ 1,969,131 $ 2,225,659 Cost of sales 136,215 147,816 611,850 630,915 Gross profit 352,425 374,524 1,357,281 1,594,744 Operating expenses: Selling expenses 181,326 201,031 742,365 879,634 General and administrative expenses 145,033 127,664 546,858 555,769 Restructuring and impairment expenses 10,003 18,370 19,790 48,494 Total operating expenses 336,362 347,065 1,309,013 1,483,897 Operating income (loss) 16,063 27,459 48,268 110,847 Other income (expense), net (6,735 ) (3,104 ) (21,690 ) (21,877 ) Income (loss) before provision for income taxes 9,328 24,355 26,578 88,970 Provision (benefit) for income taxes 2,046 (32,860 ) 17,983 (15,808 ) Net income (loss) $ 7,282 $ 57,215 $ 8,595 $ 104,778 Net income (loss) per share: Basic $ 0.15 $ 1.16 $ 0.17 $ 2.10 Diluted $ 0.15 $ 1.15 $ 0.17 $ 2.07 Weighted-average common shares outstanding (000s): Basic 49,411 49,452 49,711 50,002 Diluted 49,479 49,783 49,860 50,525\n\nNU SKIN ENTERPRISES, INC.\n\nConsolidated Balance Sheets (Unaudited)\n\n(U.S. dollars in thousands) December 31, 2023 December 31, 2022 ASSETS Current assets: Cash and cash equivalents $ 256,057 $ 264,725 Current investments 11,759 13,784 Accounts receivable, net 72,879 47,360 Inventories, net 279,978 346,183 Prepaid expenses and other 81,198 87,816 Total current assets 701,871 759,868 Property and equipment, net 432,965 444,806 Operating lease right-of-use assets 90,107 98,734 Goodwill 230,768 206,432 Other intangible assets, net 105,309 66,701 Other assets 245,443 244,429 Total assets $ 1,806,463 $ 1,820,970 LIABILITIES AND STOCKHOLDERS’ EQUITY Current liabilities: Accounts payable $ 43,505 $ 53,963 Accrued expenses 260,366 280,280 Current portion of long-term debt 25,000 25,000 Total current liabilities 328,871 359,243 Operating lease liabilities 70,943 76,540 Long-term debt 478,040 377,466 Other liabilities 106,641 110,425 Total liabilities 984,495 923,674 Commitments and contingencies Stockholders’ equity: Class A common stock – 500 million shares authorized, $0.001 par value, 90.6 million shares issued 91 91 Additional paid-in capital 621,853 613,278 Treasury stock, at cost – 41.1 million and 41.1 million shares (1,570,440 ) (1,569,061 ) Accumulated other comprehensive loss (100,006 ) (86,509 ) Retained earnings 1,870,470 1,939,497 Total stockholders' equity 821,968 897,296 Total liabilities and stockholders’ equity $ 1,806,463 $ $ 1,820,970\n\nNU SKIN ENTERPRISES, INC.\r\nReconciliation of Operating Margin Excluding Impact of Certain Charges to GAAP Operating Margin (in thousands, except for per share amounts) Three months ended\r\nDecember 31, Year ended\r\nDecember 31, 2023 2022 2023 2022 Operating Income $ 16,063 $ 27,459 $ 48,268 $ 110,847 Impact of inventory write-off - - 65,728 26,905 Impact of restructuring and impairment 10,003 18,370 19,790 48,494 Impact of other charges(2) 5,260 - 5,260 - Adjusted operating income $ 31,326 $ 45,829 $ 139,046 $ 186,246 Operating margin 3.3 % 5.3 % 2.5 % 5.0 % Operating margin, excluding impact of certain charges 6.4 % 8.8 % 7.1 % 8.4 % Revenue $ 488,640 $ 522,340 $ 1,969,131 $ 2,225,659\n\nNU SKIN ENTERPRISES, INC.\r\nReconciliation of Effective Tax Rate Excluding Impact of Certain Charges to GAAP Effective Tax Rate (in thousands, except for per share amounts) Three months ended\r\nDecember 31, Year ended\r\nDecember 31, 2023 2022 2023 2022 Provision (benefit) for income taxes $ 2,046 $ (32,860 ) $ 17,983 $ (15,808 ) Impact of certain charges on provision for income taxes 4,081 31,284 7,324 42,838 Provision for income taxes, excluding impact of certain charges $ 6,127 $ (1,576 ) $ 25,307 $ 27,030 Income before provision for income taxes 9,328 24,355 26,578 88,970 Impact of inventory write-off - - 65,728 26,905 Impact of restructuring and impairment 10,003 18,370 19,790 48,494 Impact of other charges(2) 5,260 - 5,260 - Impact of charges associated with our exit from Grow Tech: Unrealized investment loss - - - 9,009 Income before provision for income taxes, excluding impact of certain charges $ 24,591 $ 42,725 $ 117,356 $ 173,378 Effective tax rate 21.9 % (134.9 )% 67.7 % (17.8 )% Effective tax rate, excluding impact of certain charges 24.9 % (3.7 )% 21.6 % 15.6 %\n\nNU SKIN ENTERPRISES, INC.\r\nReconciliation of Earnings Per Share Excluding Impact of Certain Charges to GAAP Earnings Per Share (in thousands, except for per share amounts) Three months ended\r\nDecember 31, Year ended\r\nDecember 31, 2023 2022 2023 2022 Net income $ 7,282 $ 57,215 $ 8,595 $ 104,778 Impact of restructuring and inventory write-off expense: Restructuring and impairment 10,003 18,370 19,790 48,494 Inventory write-off - - 65,728 26,905 Tax impact (3,088 ) 903 (6,331 ) (9,566 ) Impact of other charges: (2) Impact of other charges 5,260 5,260 Tax impact (993 ) - (993 ) - Impact of charges associated with our exit from Grow Tech: Unrealized loss on investment - - - 9,009 Tax impact - - - (1,085 ) Tax impact - (32,187 ) - (32,187 ) Adjusted net income $ 18,464 $ 44,301 $ 92,049 $ 146,348 Diluted earnings per share $ 0.15 $ 1.15 $ 0.17 $ 2.07 Diluted earnings per share, excluding impact of certain charges $ 0.37 $ 0.89 $ 1.85 $ 2.90 Weighted-average common shares outstanding (000) 49,479 49,783 49,860 50,525\n\n(2) Other charges consist of a legal contingency ($3.0 million) and a non-recurring foreign tax charge ($2.3 million) that were recorded in the fourth quarter of 2023.\n\nNU SKIN ENTERPRISES, INC.\r\nReconciliation of Earnings Per Share Excluding Impact of Restructuring to GAAP Earnings Per Share Three months ended\r\nMarch 31, Year ended\r\nDecember 31, 2024 - Low-end 2024 High-end 2024 - Low-end 2024 High-end Earnings Per Share $ (0.07 ) $ 0.03 $ 0.75 $ 1.15 Impact of restructuring expense: Restructuring 0.10 0.10 0.30 0.30 Tax impact (0.03 ) (0.03 ) (0.10 ) (0.10 ) Adjusted EPS $ - $ 0.10 $ 0.95 $ 1.35\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240214526617/en/\n\nContacts\n\nMedia: media@nuskin.com, (801) 345-6397\r\nInvestors: investorrelations@nuskin.com, (801) 345-3577",
        "link": "https://finance.yahoo.com/news/nu-skin-enterprises-reports-fourth-210500933.html",
        "symbols": [
            "NUS.BE",
            "NUS.MU",
            "NUS.STU",
            "NUS.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.059,
            "neu": 0.848,
            "pos": 0.093
        }
    },
    {
        "date": "2024-02-13T07:01:26+00:00",
        "title": "Nu Skin (NUS) Q4 Earnings Report Preview: What To Look For",
        "content": "Nu Skin (NUS) Q4 Earnings Report Preview: What To Look For\n\nPersonal care company Nu Skin (NYSE:NUS) will be announcing earnings results tomorrow after market close. Here's what investors should know.\n\nLast quarter Nu Skin reported revenues of $498.8 million, down 7.3% year on year, missing analyst expectations by 4.1%. It was a weak quarter for the company, with underwhelming earnings guidance for the next quarter.\n\nIs Nu Skin buy or sell heading into the earnings? Read our full analysis here, it's free.\n\nThis quarter analysts are expecting Nu Skin's revenue to decline 8.8% year on year to $476.4 million, improvement on the 22.4% year-over-year decrease in revenue the company had recorded in the same quarter last year. Adjusted earnings are expected to come in at $0.28 per share. Nu Skin Total Revenue\n\nMajority of analysts covering the company have reconfirmed their estimates over the last thirty days, suggesting they are expecting the business to stay the course heading into the earnings. The company missed Wall St's revenue estimates five times over the last two years.\n\nLooking at Nu Skin's peers in the personal care segment, some of them have already reported Q4 earnings results, giving us a hint of what we can expect. e.l.f. delivered top-line growth of 84.9% year on year, beating analyst estimates by 13.4% and Coty reported revenues up 13.4% year on year, exceeding estimates by 2.9%. e.l.f. traded up 1.7% on the results, and Coty was down 1.6%.\n\nRead our full analysis of e.l.f.'s results here and Coty's results here.\n\nInvestors in the personal care segment have had steady hands going into the earnings, with the stocks up on average 1.7% over the last month. Nu Skin is up 7.2% during the same time, and is heading into the earnings with analyst price target of $21, compared to share price of $18.9.\n\nOne way to find opportunities in the market is to watch for generational shifts in the economy. Almost every company is slowly finding itself becoming a technology company and facing cybersecurity risks and as a result, the demand for cloud-native cybersecurity is skyrocketing. This company is leading a massive technological shift in the industry  and with revenue growth of 70% year on year and best-in-class SaaS metrics it should definitely be on your radar.\n\nJoin Paid Stock Investor Research\n\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.",
        "link": "https://finance.yahoo.com/news/nu-skin-nus-q4-earnings-070126146.html",
        "symbols": [
            "NUS.BE",
            "NUS.MU",
            "NUS.STU",
            "NUS.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.987,
            "neg": 0.031,
            "neu": 0.856,
            "pos": 0.113
        }
    },
    {
        "date": "2024-02-09T13:55:41+00:00",
        "title": "Nu Skin Enterprises' (NYSE:NUS) Returns On Capital Tell Us There Is Reason To Feel Uneasy",
        "content": "If you're looking at a mature business that's past the growth phase, what are some of the underlying trends that pop up? A business that's potentially in decline often shows two trends, a return on capital employed (ROCE) that's declining, and a base of capital employed that's also declining. This indicates to us that the business is not only shrinking the size of its net assets, but its returns are falling as well. So after we looked into Nu Skin Enterprises (NYSE:NUS), the trends above didn't look too great.\n\nWhat Is Return On Capital Employed (ROCE)?\n\nFor those who don't know, ROCE is a measure of a company's yearly pre-tax profit (its return), relative to the capital employed in the business. Analysts use this formula to calculate it for Nu Skin Enterprises:\n\nReturn on Capital Employed = Earnings Before Interest and Tax (EBIT) ÷ (Total Assets - Current Liabilities)\n\n0.065 = US$88m ÷ (US$1.8b - US$434m) (Based on the trailing twelve months to September 2023).\n\nThus, Nu Skin Enterprises has an ROCE of 6.5%.  In absolute terms, that's a low return and it also under-performs the Personal Products industry average of 15%.\n\nCheck out our latest analysis for Nu Skin Enterprises  roce\n\nAbove you can see how the current ROCE for Nu Skin Enterprises compares to its prior returns on capital, but there's only so much you can tell from the past. If you're interested, you can view the analysts predictions in our freereport on analyst forecasts for the company.\n\nWhat The Trend Of ROCE Can Tell Us\n\nThere is reason to be cautious about Nu Skin Enterprises, given the returns are trending downwards. About five years ago, returns on capital were 24%, however they're now substantially lower than that as we saw above. Meanwhile, capital employed in the business has stayed roughly the flat over the period. Companies that exhibit these attributes tend to not be shrinking, but they can be mature and facing pressure on their margins from competition. So because these trends aren't typically conducive to creating a multi-bagger, we wouldn't hold our breath on Nu Skin Enterprises becoming one if things continue as they have.\n\nStory continues\n\nThe Bottom Line\n\nAll in all, the lower returns from the same amount of capital employed aren't exactly signs of a compounding machine. Long term shareholders who've owned the stock over the last five years have experienced a 66% depreciation in their investment, so it appears the market might not like these trends either. That being the case, unless the underlying trends revert to a more positive trajectory, we'd consider looking elsewhere.\n\nOn a final note, we found 2 warning signs for Nu Skin Enterprises (1 is a bit unpleasant)  you should be aware of.\n\nIf you want to search for solid companies with great earnings, check out this freelist of companies with good balance sheets and impressive returns on equity.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.",
        "link": "https://finance.yahoo.com/news/nu-skin-enterprises-nyse-nus-135541933.html",
        "symbols": [
            "NUS.BE",
            "NUS.MU",
            "NUS.STU",
            "NUS.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.986,
            "neg": 0.041,
            "neu": 0.872,
            "pos": 0.086
        }
    },
    {
        "date": "2024-02-06T14:21:46+00:00",
        "title": "11 Best Hair Care Stocks To Buy Now",
        "content": "In this article, we will take a look at the 11 best hair care stocks to buy now. If you want to skip our industry background and jump ahead to the top five stocks in this list, then take a look at the 5 Best Hair Care Stocks To Buy Now.\n\nWhile hair care products may appear to be a modern phenomenon, their origins trace back thousands of years. Throughout history, humans have utilized various products to enhance their appearance. From homemade remedies to the thriving industry it is today, hair care and cosmetics have evolved significantly over time, reflecting both cultural practices and technological advancements.\n\nThe global hair care and beauty industries have traditionally been considered recession-resistant, as they fall within the consumer staples category, alongside essential items like groceries and cleaning supplies. In addition, given that numerous hair care and beauty brands also qualify as luxury products, the sector operates as a hybrid, blending features of consumer staples and luxury goods to provide the advantages of both. However, the COVID-19 pandemic challenged this perception. Lockdowns and consumer concerns about infection prompted widespread closures of retail and salon stores, resulting in weakened sales across the beauty and personal care product market back in 2022. In response to these challenges, industry leaders were forced to devise strategies to attract more consumers.\n\nIn 2022, the average American consumer spent approximately $86 on hair care products. Among these, shampoo emerged as the most profitable, generating sales of approximately $3.6 billion, followed by hair conditioner and hair coloring, with unit sales reaching 172 million units in the women's hair coloring category. More prevalently, hair growth treatments have gained significant attention in the beauty industry. As more consumers express interest in products that combat hair loss and thinning, the hair growth category has seen a surge in both unit and dollar sales in the United States. In 2022, dollar sales of hair growth products amounted to about $121 million. This category encompasses various product types, including oils such as rosemary oil, as well as more conventional hair care items like shampoo and conditioner, formulated with ingredients aimed at promoting hair growth or preventing hair loss.\n\nStory continues\n\nThe evolving fashion trends and growing awareness of new, safer, and more effective hair care products have fueled a notable surge in their usage, consequently driving growth in the global hair care market. According to a market report by Fortune Business Insights, the global hair care market is forecasted to expand from $99.53 billion in 2023 to $147.49 billion by 2030, representing a compound annual growth rate (CAGR) of 5.8% during the forecast period.\n\nInvestors are increasingly turning to shares of hair care companies as a hedge against potential periods of inflation. Some of the top players in the hair care sector that serve as effective choices include The Procter & Gamble Company (NYSE:PG), The Estée Lauder Companies Inc. (NYSE:EL), and Ulta Beauty, Inc. (NASDAQ:ULTA), among others listed below. Best Hair Care Stocks To Buy\n\nPhoto by Adam Winger on Unsplash\n\nOur Methodology\n\nIn the process of compiling our selection of the best hair care stocks, we initially identified companies involved in hair care and the beauty industry. From this pool, we selected the stocks with the highest hedge fund investor participation in Q3 2023, designating them as the top hair care stocks to buy.\n\nHedge funds’ top 10 consensus stock picks outperformed the S&P 500 Index by more than 140 percentage points over the last 10 years (see the details here). That’s why we pay very close attention to this often-ignored indicator.\n\n11. L’Oréal S.A. (OTC:LRLCY)\n\nNumber of Hedge Fund Holders: 3\n\nL’Oréal S.A. (OTC:LRLCY) is a French personal care company headquartered in Clichy, Hauts-de-Seine, renowned as one of the world's largest cosmetics companies. Its extensive product line encompasses hair color, skin care, sun protection, makeup, perfume, and hair care products, catering to consumers worldwide.\n\nAs of the end of Q2 2022, three hedge funds held positions in L’Oréal S.A. (OTC:LRLCY), collectively valued at $893.01 million. The largest stake was held by billionaire Ken Fisher's Fisher Asset Management, which owned 10.72 million shares worth nearly $892.7 million.\n\nL’Oréal S.A. (OTC:LRLCY) joins The Procter & Gamble Company (NYSE:PG), The Estée Lauder Companies Inc. (NYSE:EL), and Ulta Beauty, Inc. (NASDAQ:ULTA) in the list of some of the best hair care stocks to buy now.\n\n10. Olaplex Holdings, Inc. (NASDAQ:OLPX)\n\nNumber of Hedge Fund Holders: 13\n\nOlaplex Holdings, Inc. (NASDAQ:OLPX) is a beauty company driven by science and technology. It operates through a global omni-channel platform, catering to professional, specialty retail, and direct-to-consumer (DTC) channels.\n\nOn November 8 2023, investment advisory firm Telsey Advisory reiterated a Market Perform rating on Olaplex Holdings, Inc. (NASDAQ:OLPX) stock while reducing the price target to $2 from $4.\n\nAs of the end of the third quarter of 2023, Insider Monkey's database showed that 13 hedge funds held stakes in Olaplex Holdings, Inc. (NASDAQ:OLPX), with a combined value of $30 million. This marked a decrease from the previous quarter, during which 18 hedge funds held stakes valued at $60 million.\n\n9. Helen of Troy Limited (NASDAQ:HELE)\n\nNumber of Hedge Fund Holders: 17\n\nHelen of Troy Limited (NASDAQ:HELE), headquartered in Texas, is a leading provider of consumer products across multiple regions, including the United States, Canada, Europe, the Middle East, Africa, the Asia Pacific, and Latin America. The company operates through three segments: Home & Outdoor, Health & Wellness, and Beauty. Its diverse product range includes decorative hair accessories, shampoos, liquid hair styling products, treatment and conditioning products, as well as hair appliances.\n\nHelen of Troy Limited (NASDAQ:HELE) demonstrated strong performance in the third quarter of fiscal 2024. Exceeding expectations, the company reported a revenue of $549.6 million and an adjusted EPS of $2.79 for Q3 fiscal 2024, surpassing the forecast of $541.87 million and $2.75 EPS.\n\nAt the end of the third quarter of 2023, 17 hedge funds in the database of Insider Monkey held stakes worth $203.5 million in Helen of Troy Limited (NASDAQ:HELE). Of these, Ken Fisher’s Fisher Asset Management was the largest stakeholder, with a stake worth approximately $57.35 million.\n\n8. Nu Skin Enterprises, Inc. (NYSE:NUS)\n\nNumber of Hedge Fund Holders: 19\n\nNu Skin Enterprises, Inc. (NYSE:NUS) is headquartered in Utah and specializes in personal care products. Their diverse product line includes skincare systems, facial cleansers, moisturizers, anti-aging solutions, and body care items. Currently, the company offers a quarterly dividend of $0.39 per share, boasting an impressive dividend yield of 8.59% as of February 2. With a dividend growth streak spanning over 22 years, NUS ranks among the best hair care stocks to buy.\n\nIn the third quarter of 2023, Nu Skin Enterprises, Inc. (NYSE:NUS) demonstrated a robust financial position, closing the quarter with over $233.3 million in cash and cash equivalents. Additionally, the company distributed approximately $19.5 million to shareholders through dividends.\n\nAccording to Insider Monkey's database for the third quarter of 2023, 19 hedge funds held stakes in Nu Skin Enterprises, Inc. (NYSE:NUS), up from 18 in the previous quarter. The collective value of these stakes exceeded $93.3 million.\n\n7. Unilever PLC (NYSE:UL)\n\nNumber Of Hedge Fund Holders: 21\n\nEstablished on September 2, 1929, Unilever PLC (NYSE:UL) is a British multinational fast-moving consumer goods company formed from the merger of British soap maker Lever Brothers and Dutch margarine producer Margarine Unie. The company is headquartered in London and boasts ownership of popular brands such as Comfort, Dove, Lifebuoy, Lux, Rexona, and Sunsilk.\n\nAs of the end of the third quarter of this year, 21 out of the 910 hedge funds in Insider Monkey's database had purchased and held shares of Unilever PLC (NYSE:UL). Among these, Ken Fisher’s Fisher Asset Management stands out as the largest hedge fund shareholder, with a $488 million investment in the company.\n\n6. Coty Inc. (NYSE:COTY)\n\nNumber Of Hedge Fund Holders: 24\n\nCoty Inc. (NYSE:COTY) is a French-American multinational beauty company specializing in the development, manufacturing, marketing, and distribution of professional and retail hair care products. Additionally, the company offers a range of fragrances, cosmetics, and skincare products to consumers worldwide.\n\nAccording to Coty Inc. (NYSE:COTY)'s results for the first quarter of fiscal year 2024, the company experienced robust Q1 sales growth of 18%, surpassing expectations. Additionally, Coty recently raised its guidance for the first half of FY24 to +10-12%.\n\nCoty Inc. (NYSE:COTY)'s Consumer Beauty segment reported a 10% increase in revenues for Q1, both as reported and on a like-for-like (LFL) basis, aligning with the growth of the global mass beauty market, which has shown resilience in demand. During the quarter, the company observed strong sales performance in color cosmetics, mass fragrances, and mass skin & body care products. Particularly noteworthy was the momentum in e-commerce, with over 25% like-for-like sales growth in the Consumer Beauty business.\n\nAfter sifting through 910 hedge funds for their September quarter of 2023 shareholdings, Insider Monkey discovered that 24 had bought a stake in Coty Inc. (NYSE:COTY). Out of these, the firm’s largest shareholder is Israel Englander's Millennium Management with an investment worth $41.1 million.\n\nThe Procter & Gamble Company (NYSE:PG), The Estée Lauder Companies Inc. (NYSE:EL), and Ulta Beauty, Inc. (NASDAQ:ULTA) are met by Coty Inc. (NYSE:COTY) in the list of the best hair care stocks to invest in.\n\nClick here to continue reading and check out 5 Best Hair Care Stocks To Buy Now.\n\nSuggested articles:\n\n13 Best Blue Chip Stocks Under $100 13 Cheap Blue Chip Stocks To Buy 11 Hot Oil Stocks To Buy Now\n\nDisclosure: None. 11 Best Hair Care Stocks To Buy Now is originally published on Insider Monkey.",
        "link": "https://finance.yahoo.com/news/11-best-hair-care-stocks-142146520.html",
        "symbols": [
            "0I4A.LSE",
            "0LIB.LSE",
            "0NOF.IL",
            "34U.BE",
            "34U.F",
            "34U.MU",
            "34U.STU",
            "CO3A.F",
            "CO3A.MU",
            "CO3A.STU",
            "COTY.US",
            "COTY34.SA",
            "EL.US",
            "HELE.US",
            "HT2.F",
            "HT2.MU",
            "LOR.BE",
            "LOR.DU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.015,
            "neu": 0.796,
            "pos": 0.189
        }
    }
]