[
    {
        "date": "2024-08-05T16:29:00+00:00",
        "title": "RBC Bearings (RBC) Q1 Earnings Surpass Estimates, Rise Y/Y",
        "content": "RBC Bearings Incorporated’s RBC first-quarter fiscal 2025 (ended June 2024) adjusted earnings of $2.54 per share beat the Zacks Consensus Estimate of $2.37. The figure increased 19.2% from year-ago adjusted earnings of $2.13 per share, supported by higher revenues.\n\nRevenue Details\n\nRBC Bearings’ revenues were $406.3 million, which increased 5% year over year. However, the figure missed the Zacks Consensus Estimate of $417 million.\r\n\r\nWhile exiting the reported quarter, RBC had a backlog of $825.8 million compared with $821.5 million reported at the end of the fourth quarter of fiscal 2024 (ended March 30, 2024).\n\nSegmental Details\n\nThe company currently has two reportable segments, namely Aerospace/Defense and Industrial. Its segmental performance for the fiscal first quarter is briefly discussed below:\r\n\r\nIndustrial revenues of $257.2 million (representing 63% of the quarter’s revenues) were down 3.5% year over year.\r\n\r\nAerospace/Defense revenues totaled $149.1 million (37%), up 23.7% year over year.\n\nRBC Bearings Incorporated Price, Consensus and EPS Surprise\n\nRBC Bearings Incorporated price-consensus-eps-surprise-chart | RBC Bearings Incorporated Quote\n\nMargin Profile\n\nThe company’s cost of sales rose 1.4% year over year to $222.3 million. Gross profit grew 9.6% to $184.0 million. The margin expanded 190 basis points (bps) to 45.3%.\r\n\r\nSelling, general and administrative expenses were $67.6 million, up 4.5% year over year. Adjusted EBITDA jumped 11.3% to $134.0 million. The adjusted EBITDA margin was 33%, up 190 bps year over year.\r\n\r\nAdjusted operating income increased 14.3% year over year to $97.5 million. The adjusted margin increased 200 bps to 24%. Net interest expenses were $17.2 million compared with $20.5 million in the year-ago quarter.\n\nBalance Sheet & Cash Flow\n\nAt the time of exiting the fiscal first quarter, RBC had cash and cash equivalents of $76.8 million compared with $63.5 million at the end of the year-ago fiscal quarter. Total debt was $1.13 billion, down from $1.19 billion at the end of the year-earlier fiscal quarter.\r\n\r\nIn the first three months of fiscal 2025, the company generated net cash of $97.4 million from operating activities, which increased 57.9% on a year-over-year basis. Capital expenditure of $9 million increased 34.3% year over year.\r\n\r\nIn the first three months of fiscal 2025, RBC Bearings repurchased shares worth $8 million, up 17.7% year over year.\n\nOutlook\n\nFor the fiscal second quarter, management anticipates net sales of $395.0-$405.0 million, indicating an increase of 2.4-5% from the prior-year reported figure of $385.6 million.\n\nStory continues\n\nZacks Rank\n\nThe company currently carries a Zacks Rank #4 (Sell). \r\n\r\nYou can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nPerformances of Other Industrial Companies\n\nPentair plc PNR reported second-quarter adjusted earnings per share of $1.22, which beat the Zacks Consensus Estimate of $1.15. The reported figure also improved 18% from the year-ago quarter.\r\n\r\nNet sales rose 1.6% year over year to $1.1 billion. PNR’s top line outpaced the Zacks Consensus Estimate of $1.09 billion. \r\n\r\nCrown Holdings, Inc. CCK reported second-quarter adjusted earnings per share of $1.81, which beat the Zacks Consensus Estimate of $1.59. The bottom line improved 8% year over year.\r\n\r\nNet sales totaled $3.04 billion, down 2.2% from the year-ago quarter. The top line missed the Zacks Consensus Estimate of $3.06 billion.\r\n\r\nA. O. Smith Corporation’s AOS second-quarter adjusted earnings of $1.06 per share missed the Zacks Consensus Estimate of $1.07. However, the bottom line increased 5% on a year-over-year basis.\r\n\r\nNet sales of $1.02 billion surpassed the consensus estimate of $992 million. The top line increased 7% year over year, driven by strong demand for residential and commercial water heaters in North America.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nA. O. Smith Corporation (AOS) : Free Stock Analysis Report\n\nRBC Bearings Incorporated (RBC) : Free Stock Analysis Report\n\nCrown Holdings, Inc. (CCK) : Free Stock Analysis Report\n\nPentair plc (PNR) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/rbc-bearings-rbc-q1-earnings-162900575.html",
        "symbols": [
            "B1X.F",
            "RB8.F",
            "RBC.US",
            "RRX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.995,
            "neg": 0.019,
            "neu": 0.87,
            "pos": 0.11
        }
    },
    {
        "date": "2024-08-03T09:26:01+00:00",
        "title": "Q1 2025 RBC Bearings Inc Earnings Call",
        "content": "Participants\n\nRob Moffatt; Director of Investor Relations; RBC Bearings\n\nMichael Hartnett; President And Chief Executive Officer of Rbc Bearings, Inc; RBC Bearings Inc\n\nRobert Sullivan; Vice President & Chief Financial Officer; RBC Bearings Inc\n\nKristine Liwag; Analyst; Morgan Stanley\n\nMichael Ciarmoli; Analyst; Truist Securities, Inc.\n\nPeter Skibitski; Analyst; Alembic Global Advisors\n\nJordan Lyonnais; Analyst; Bank of America Securities\n\nSteve Barger; Analyst; KeyBanc Capital Markets Inc\n\nVivek Srivastava; Analyst; Goldman Sachs Group, Inc.\n\nTimothy Thein; Analyst; Raymond James\n\nPresentation\n\nOperator\n\nGreetings. Welcome to RBC Bearings' Fiscal 2025 first-quarter earnings call. (Operator Instructions) As a reminder, this conference is being recorded.\r\n I would now like to turn the conference over to your host, Rob Moffat, Director, Investor Relations. Please go ahead.\n\nRob Moffatt\n\nMorning, and thank you for joining us for RBC Bearings' fiscal first-quarter 2025 earnings call. I'm now with Dr. Michael Hartnett, Chairman, President, and Chief Executive Officer; Daniel Bergeron, Director, Vice President, and Chief Operating Officer; and Rob Sullivan, Vice President and Chief Financial Officer.\r\n Before beginning today's call, let me remind you that some statements made today will be forward-looking and are made under the Private Securities Litigation Reform Act of 1995. Actual results may differ materially from those projected or implied due to a variety of factors. We refer you to RBC Bearings' recent filings with the SEC for more detailed discussion of the risks that could impact the company's future operating results and financial condition. These factors are also described in greater detail in the press release and on the company's website. In addition, reconciliation between GAAP and non-GAAP financial information is included as part of the release and is available on the company's website.\r\n With that, I'll now turn the call over to Dr. Hartnett.\n\nMichael Hartnett\n\nThank you, Rob, and good morning to everyone, and thanks for joining us. I'm going to start today's call with a quick review of our quarter and fiscal year and hand it over to Rob for some detailed color on the numbers. And then I'll finish with some high-level thoughts on the industry, RBC's positioning, and some -- in our fiscal '25 outlook. First-quarter sales came in at $46.3 million, a 5% increase over last year. Strong performance from our aerospace and defense sector, showed a 23.7% expansion where our industrial business contracted slightly at 3.5%.\r\n In aerospace and defense, sales expanded approximately $30 million quarter to quarter, year­ over year with $149.1 million quarterly result. The defense sector led with a 38.1% expansion rate. Unquestionably, we can expect continued strong showings from our A and D sector through the balance of the year.\r\n On the individual side, we held our own against our peers, showing a small contraction of 3.5% of sales. Sales were $257.2 million. Weakened sector performance was seen in oil and gas, semiconductor machinery, and some general industrial markets. We currently expect and plan for these markets to strengthen in the second half of the year.\r\n Adjusted gross margin for the quarter came in at $184 million, 45.3% of sales and almost 2 full percentage above last year. Clearly, our manufacturing plants are executing extremely well. We are operating well within our sweet spot in this regard, and many completed synergies and improvement projects contributed to this performance. Still many more productive concepts and plans are in the breach and/or active today. And these are very productive and promising areas for us to prospect.\r\n I'd like to acknowledge and thank our teams for this quarter's performance. Clearly, it is they who are the reason for RBC's continued successes. As a result, adjusted net income was $2.54 a share and adjusted EBITDA was 33% of revenues. Obviously, we're very pleased with this performance, and we really can't think of a better way to start our fiscal year. Net cash provided by the operating activities was $97.4 million versus $61.7 million last year, a 57.9% increase.\r\n This allowed us to reduce debt another $60 million during the period, bringing the EBITDA to net debt ratio to approximately 2.1 times, another sweet spot. Overall, we expect more of the same performance from the aerospace and defense group through the year end. Some ups and downs in this regard as a result of normal seasonal impacts of holidays, vacations, and supply chain.\r\n On the industrial side, we are planning to see strengthening in the second half of the year and are setting our plans today accordingly. RBC is well positioned to support additional demand from both industrial and aerospace defense customers as well as space customers. We have the production capacity, the trained and skilled work forces in place, and are in the process of augmenting plant capacities to accommodate additional business awards.\r\n I'll now turn the call over to Rob for more details on our financial performance.\n\nStory continues\n\nRobert Sullivan\n\nThank you, Mike. As Dr. Hartnett indicated, this is another strong quarter for RBC. Total sales growth of 5% in the quarter was surpassed by adjusted EBITDA growth of 11.3% and adjusted EPS growth of 19.2%. Along with that, we had free cash flow growth of 61% year over year. This was driven in large part by strong gross margin expansion, with first-quarter gross margin as a percentage of sales coming in at 45.3%, an expansion of roughly 190 basis points year­ over year. The two biggest drivers here continue to be the ongoing tailwinds from Dodge synergies and increased utilization of our aerospace manufacturing assets. We also saw tailwinds from strong plant efficiency expedites in a favorable mix.\r\n On the SG&A line, we continue to make investments in our future growth. This includes sales force additions to support the international expansion that we have highlighted as part of our Dodge strategy and the resources needed to support that growth, including IT infrastructure and back office support. With that said, the rate of growth on the SG&A line moderated versus the year-ago period, and we were able to extract a modest amount of leverage this quarter.\r\n Going forward, we expect SG&A as a percentage of sales to increase in Q2 and Q3 before normalizing in Q4. This led to adjusted EBITDA of $134 million this quarter, up 11.3% year over­ year and adjusted EBITDA margin of 33%, which is up almost 190 basis points versus last year's 31.1%. The EBITDA margin is a new record for RBC, eclipsing our recent peak of 31.7% in the second quarter of fiscal '24.\r\n The achievement of this milestone was a multifaceted effort with credit being deserved across multiple layers of the company including the Dodge team for their efforts in extracting synergies and our operations and plant management teams for running at very high levels of plant efficiency during the quarter.\r\n Interest expense in the quarter was $17.2 million. This is down 16% year over year, reflecting the ongoing repayment of our term loan. The tax rate in our adjusted EPS calculation was 22.4%, a moderate year-over-year headwind versus last year's 22%. All together, this led to adjusted diluted EPS of $2.54, representing 19.2% of year-over-year growth, an impressive result on revenue growth of 5%.\r\n In terms of cash, free cash flow of $88.4 million ran at 144% conversion rate and grew 61% on a year-over-year basis. This was fueled by strong net income growth and improved working capital performance. As usual, we used a meaningful portion of the cash generated to continue to pay down our term loan. We repaid $60 million of the loan this quarter and continue to expect to repay $275 million to $300 million total for the year. The balance on the term loan at the end of the quarter was $615 million, leaving net debt at $1.05 billion and trailing net leverage of 2.1 times. We continue to expect trailing net leverage to be well below the 2 times mark exiting the fiscal year, leaving ample room for a return to M&A should the right deal come across our path.\r\n As a reminder, our Series A mandatory convertible preferred stock is expected to automatically convert on October 15, 2024. Using Q1 results as an approximation, the net impact of this conversion is expected to be slightly accretive to earnings per share, assuming conversion at the current share price. It will be more meaningfully accretive, however, to free cash flow as the conversion will remove the cash dividend payment, reducing our future total cash outlays by approximately $23 million on an annualized basis. This is roughly 9.5% of fiscal '24's total free cash flow.\r\n In closing, this was another strong quarter for RBC. We remain focused on leveraging our core strengths in engineering, manufacturing, and product development to drive organic and inorganic growth, continued margin excellence, and high levels of free cash flow conversion.\r\n With that, operator, please open the call for Q&A.\n\nQuestion and Answer Session\n\nOperator\n\n(Operator Instructions)\r\n Kristine Liwag, Morgan Stanley.\n\nKristine Liwag\n\nWith industrial end market kind of starting to decline here, can you provide more content and detail about what you're seeing in the different end markets and exactly how far away we are from a trough and what we'd have to see to see improvement? Because it seems like the issue in the quarter is just a little bit of weakness in the top line. But that said, I mean, with a 45% gross margin for the business, that's still pretty incredible performance.\n\nMichael Hartnett\n\nYeah. Well, when we're looking at the industrial markets, Kristine, there's a few things where we saw a substantial amount of softness, and we've seen that continued for almost 12 months now. And that's in semicon and oil and gas. And on the semicon (technical difficulty)\n\nKristine Liwag\n\nHello, I think the line dropped.\n\nOperator\n\nLadies and gentlemen, this is the operator, please stand by. We're experiencing technical difficulties. We will resume momentarily.\r\n Ladies and gentlemen, thank you for standing by. Gentlemen, you may continue.\r\n Kristine, please continue your question.\n\nMichael Hartnett\n\nWhere did I leave you, Kristine?\n\nKristine Liwag\n\nGreat. Mike, you were talking about semiconductors is where you've seen the weakness in oil and gas, and that's where that line dropped off.\n\nMichael Hartnett\n\nYeah. Okay. So those are the two majors. The oil and gas is sort of -- we have a major customer, we had a planning problem and got too much a year ago and now is sort of liquidating that position. We expect him to get better as the year progresses. And the rest of the business, there's a slight downward bias on the rest of the market. Some positive, some negative, but overall bias down.\n\nKristine Liwag\n\nGreat. And just to follow up in terms of where we're seeing the weakness. Are these mostly on new builds? Or was the slowdown in buying also in the aftermarket if there was a little bit of an [overreach] in buying before?\n\nMichael Hartnett\n\nYeah. I think it's -- by and large, it's a slowdown in the aftermarket in the various industrial sectors that support the aftermarket.\n\nKristine Liwag\n\nI see. And then as you look at the recovery for each of these end markets, which quarter do you think industrial revenue could potentially trough? And do you have any visibility into that?\n\nMichael Hartnett\n\nIf I had the visibility, I would probably know what stocks to buy and which stocks to sell, right? I don't have that kind of visibility. What we do have is economic models that sort of give us a general overall direction. And those economic models are saying -- have been telling us that it's flat through our third quarter and very strong in our last quarter. And that's sort of how we're piloting the ship today.\n\nOperator\n\nMichael Ciarmoli, Truist Securities.\n\nMichael Ciarmoli\n\nMaybe just to stay on industrial. I guess the quarterly results on revenue came up short of your guidance. Was that -- was the industrial weakness, the biggest driver of that delta? Or did anything else kind of materialize?\n\nMichael Hartnett\n\nNo. That was the biggest driver. It's just -- it's all about consumption rates, industrial consumption rates. Our estimates for those rates at the beginning of the quarter and the actual consumption that we see during the quarter creates the variance.\n\nMichael Ciarmoli\n\nGot it. Got it. Do you have that -- I guess ever since the acquisition of Dodge and the amount of industrial revenues that go through aftermarket distribution now is pretty sizable at the company level. I mean, do you have the level of visibility into the distributors to know if there's really going to be a more pronounced destock in any of these industrial sectors? Or do you even have some sort of min-max thresholds? Do you have a certain base level of demand that you're shipping to in the industrial channels?\n\nMichael Hartnett\n\nWell, we have probably the same information that you have. I mean, some of these are public companies and they published quite detailed information on what their situation is. And basically, I don't think there's any much destocking going on. I think part of the year-to­ year comp delta there was that a year ago, we were still benefiting from a recovering supply thing and cleaning up backlog. Those are products that have been on the order book for an extended period of time.\r\n But as a result of supply chain difficulties, we couldn't complete those orders. And so last year, we probably benefited from some number that it might be as high as $10 million of that backlog reduction. And this year, we -- supply chain is normal. And so we're just living on the economic consumption rate as is our distributors. I mean, I don't think there's any serious [beatbacking] going on anywhere.\n\nMichael Ciarmoli\n\nOkay, okay. Do you think as you look out for the remainder of '25, I mean, you had a tough comp year over­ year in the first quarter for industrial, but they certainly get easier. Do you think industrial grows for fiscal '25? Or do you think it's going to be sort of low single-digit kind of pressure all year?\n\nMichael Hartnett\n\nOur plan today, asset growing. And that's -- we're expecting, as I said, some recovery in semicon. We're expecting a milder recovery in oil and gas. And then the rest of it is about industrial economic consumption rate.\n\nMichael Ciarmoli\n\nAny more detail on the year-over-year growth rates by channel and aerospace, OEM aftermarket distribution, I think you called out defense already?\n\nMichael Hartnett\n\nYeah. I think Rob can give you those. He's looking at it now. So I'll turn the call over to Rob.\n\nRobert Sullivan\n\nYeah. They were very consistent. Like they were both right around at 23.7% for OEM, 23.9% for distribution. So very consistent.\n\nOperator\n\nPete Skibitski, Alembic Global.\n\nPeter Skibitski\n\nNice performance. Hey, Mike, just on the torrid growth in defense, I think you said 38%. Was there a few programs that are helping just so much above the market, above all the OEMs. So I'm just wondering if you can give us more color on what's driving that.\r\n It's like the fourth quarter in a row that type of really strong growth. And I don't know if you can talk about pricing at all. In terms of pricing maybe finally catching up with past inflation because I know you're on a lot of LTAs as well. So just if you could comment there.\n\nMichael Hartnett\n\nYes. Just to get the pricing thing out of the way, I don't think we're seeing any benefit from that right now. A lot of our contracts roll over in '25 and '26. So we're really still living with prices that were probably set in '21, maybe '20, maybe '19. So that's basically -- that's headwind for us.\r\n But there are several major programs that are going to continue to drive that kind of expansion. And it's a -- I think the year-to-year comps will become more difficult because this started about a year ago. But when you talk about the need to build submarines, that's not going away for 5 or 10 years, probably 10 years. That's going to be very demanding that we're involved with right now. Missile, demanding; joint strike fighter, demanding; long-range bomber, demanding.\r\n So there's just a lot of really big programs that we're working on. And also, the cancellation of the viral program for the scout helicopter that impacted the core (inaudible) and Lockheed as a result, benefited the other ship that we're on tremendously because the other ship, we're sort of in, to some extent, a hiatus like CH-47 and the Apache, the Black Hawk, those are major important platforms for us. And the rest of the world doesn't know whether they could buy those platforms are not based upon where the DoD money was heading. And that environment has cleared, and there's a lot of interest for an interest in those platforms. So we're -- it's kind of a perfect one for us on the defense side.\n\nPeter Skibitski\n\nYes. Okay. That makes sense. Just one follow-up for me, maybe on the commercial side. It sounds like Boeing is at about, on the max there, at at about 25 per month now in June and July. Can you guys just remind us where you were over the past couple of quarters? I think they've been maintaining you like in the 30s or so. Does that sound about right?\n\nMichael Hartnett\n\nYes, that sounds about right. I think the -- I think our planning now is probably at a 33 rig. Although they've indicated, they'll be at 38 by the end of the year. And the new CEO has agreed with that. I hope when he goes up at his office, he agrees with it even further.\r\n So yeah, I think we have a very modest expectation built into our planning with regard to Boeing demand. And that seems to be the way playing out.\n\nPeter Skibitski\n\nYeah. And if they make that 38 rate by the end of the year, I imagine your -- potentially you could accelerate, I guess, into fiscal '26, it sounds like.\n\nMichael Hartnett\n\nYes. Well, I think they've got to get the [FAA] to approve a step-up behind 38, assuming they can get to 38%. And so obviously, our parts for the most part. have to be available six months ahead of -- that's our planning cycle ahead of the aircraft assembly rates. So that's kind of moved -­ that moved April into October on the 38. So we should be really, really conservative using a [32, 20 win].\n\nOperator\n\nJordan Lyonnais, Bank of America.\n\nJordan Lyonnais\n\nOn M&A, could you guys give any color on deals in the pipe you're seeing any changes in size or scope? And two, if you're looking at anything to get more capacity if the A&D side keeps growing at this rate?\n\nMichael Hartnett\n\nWell, I think we're seeing A&D-like companies coming to market, and we're investigating it with RBC. We have really nothing to report at this point. Obviously, if one of those companies does come to market. they'll likely come to market with their own capacity. So they probably won't tax ours.\r\n But there's just a lot going on in the A&D world, and we can either -- and we're very pleased with our growth in that sector and the outlook in that sector for the next several years. So we're being cautious and conservative about what we take on.\n\nOperator\n\nSteve Barger, KeyBanc Capital Markets.\n\nSteve Barger\n\nHey, Mike, seeing gross margin above 45% with industrial down 3.5% is great performance.\n\nMichael Hartnett\n\nThank you.\n\nSteve Barger\n\nSure. You earned it. Was that all mix in aerospace? Or was there something unusual in there?\n\nMichael Hartnett\n\nNo, aerospace contributed, Its margin is improving. I think it's -- as I said, we have a lot of contracts that were in our way through that were inked in '19, '20, and '21 that are a little bit of a headwind. We're becoming more efficient in the execution of those contracts just because there's more volume and more absorption as a result of that.\r\n We have also better methods and a little better capitalization here and there to execute some of those designs. So I would say it was very solid performance on the industrial side that really carried the day.\n\nSteve Barger\n\nSo industrial margins were up even against negative 3.5% organic?\n\nMichael Hartnett\n\nYes. That's right.\n\nSteve Barger\n\nAnd what in industrial drove that? Because that's a pretty big absorption headwind to overcome, isn't it? Like what was it mix that made that so rich?\n\nMichael Hartnett\n\nWell, we've been talking about synergies for a long time, and we're starting to see it. They did have a favorable mix this quarter. I can't say that we're going to see margins like that forever, but we saw in the first quarter.\r\n I think the neighborhood that we'll probably end up living in is more like 44% when the year is all done, but we'll see. That's hard to predict. So there's a lot of synergies that went on. Mix was favorable. Plant efficiencies were absolutely better.\r\n There's no question about that. I mean, they're operating in their sweet spot, and we've had methods improvements. And we've had improvements in supply chain cost structure. So everybody has a role when they come to work in the morning and a little piece of each one of these issues. And they [indiscernible] it makes a difference.\n\nSteve Barger\n\nSo I guess you're guiding fiscal 2Q gross margin down 100 or 200 basis points against what is obviously a tough comp. But is there any specific thing causing that sequential decrease?\n\nRobert Sullivan\n\nI think we have fewer production days in Q2 and Q3. That has been pretty consistent over time. So you have a little bit of a headwind there. And then you couple that with the favorable mix we had in the first quarter, you just added up to this is where we're seeing things in Q2.\r\n And the right way to look at it, it's probably more on a year-over-year basis, right, and you don't know the range is calculated from expansion on a year.\n\nSteve Barger\n\nUnderstood. And then on the revenue side, Aerospace is up 24% against a 21% comp. You talked about all the things that are going right there. Do you expect 20%-plus growth again in 2Q?\n\nMichael Hartnett\n\nWe're not planning for it, but I can't say that it won't happen.\n\nSteve Barger\n\nWell, I guess the question then is, you expect industrial to recover in the back half. Do you think that's up sequentially from a revenue standpoint? Or is that more likely down given some of the softness that you're seeing right now?\n\nMichael Hartnett\n\nYes, that's more likely down.\n\nOperator\n\nJoe Ritchie, Goldman Sachs.\n\nVivek Srivastava\n\nThis is Vivek Srivastava on for Joe. I just want to start with a more long-term question. Your EBIT margin this quarter, 32.9%, the highest we've seen -- you've previously talked about mid-30s long-term EBITDA margin, which is not far away from where you are today. So just wondering what kind of updated long-term margins you have your eyes set on and just how to think about the margin improvement part from here once the industrial businesses do start inflecting positively?\n\nRobert Sullivan\n\nWe're thrilled with the 33% that we achieved this year. We're far ahead coming out of the gate of what we talked about Q1. We talked about where we're seeing gross margins into Q2. Our mission is to continue to squeeze the lemon to expand margin every quarter and invest for our ability. So we're not looking to put out long-term guidance, but we are telling you that we're continuing to thrive, eke out that EBITDA margin. And I think we have opportunities in different pockets.\n\nVivek Srivastava\n\nThat's helpful. And maybe just a follow-up on that. As your margin continues to improve, industrial growth, your long-term target, probably close to 2x GDP. Is reinvesting within the industrial business, something that could potentially accelerate a bit more from here to return to that 2x GDP growth target?\n\nRobert Sullivan\n\nCan you clarify? I'm sorry.\n\nVivek Srivastava\n\nYes. Just given you're getting such strong margins right now, will reinvesting back in the business for growth be something that could potentially accelerate from here on?\n\nMichael Hartnett\n\nWell, I think those are two different things. We're reinvesting in the industrial business for cost reasons. In other words, we're trying to reduce our cost of sales by putting in capital equipment that will make our plants more efficient and incorporate manufacturing processes that we don't have in-house today and are very expensive to buy in the outhouse. So that's ongoing, and we're making not in substantial investments in those kinds of machinery.\r\n And so that's why we're reasonably confident that that will accrue to gross margin over time. In terms of growth, the industrial business on an annual rate now is probably running over $1 billion. So in order to really impact that kind of number, to get the internal growth mechanism performing at a measurable level requires some pretty big projects. And ultimately -- and so we have our eye on some pretty big projects. But ultimately, those bigger projects take time to implement. And so we've just got to work through that.\r\n And that's sort of ongoing right now.\n\nVivek Srivastava\n\nThat's very helpful color. Maybe one last question from me. Just on the backlog, I noticed that in the press release, you provided backlog beyond 12 months, but we didn't see backlog due within 12 months. Just wanted to understand the rationale behind that? And just any color on the backlog due within 12 months.\n\nRobert Sullivan\n\nYes. We made a strategic decision and communicated last quarter that from here on out. we were just going to be presenting the full on backlog because that such a significant part of our business, especially on the defense side, at this point. we think that's the more appropriate way to look at our overall backlog position.\n\nOperator\n\nTim Thein, Raymond James.\n\nTimothy Thein\n\nJust -- I guess one for me on the gross margins and a lot obviously discussed here in terms of the outlook for the second quarter. But thinking in terms of, I believe, the expectation coming into the year was that you may see more of a lift in the back half of the year as you better absorb some of that aerospace fixed capacity and the Dodge synergies kick in even more. But a, the industrial economy obviously being weaker, does that -- does that change the outlook in terms of -- on the Dodge side?\r\n And then I guess, related to that. was there some maybe pull ahead that maybe some of those benefits that you're expecting more in the later part of the year, maybe they came earlier as a contributor in the first quarter. So I guess, simply stated, do you still -- is the expectation still that there's room for more -- even more kind of a second half lift from some of these drivers?\n\nMichael Hartnett\n\nRight now, we continue to expect the second half lift. One of the things that attracted us to do that when we bought that is when you look at the revenue performance at Dodge over a series of years, through various economic cycles. It's a very low beta company. It's so integrated into the US infrastructure that when you're pouring your cereal in the morning, we actually had something to do with that.\r\n When you're driving your car over a street or a bridge, to get to work. We actually had something to do with that road. So we're -- and whatever we supplied only lasted a few years before nature had its way with it. and we had to replace it. So Dodge has a very strong recurring revenue driven by human consumption in North America.\r\n And so whether the economy is expanding or it's contracting slightly Dodge's business is probably going to performed well through the cycle. In terms of what we expect for the rest of the year, we expect the semicon to pick up, and we expect oil and gas to recover. And if there's more tension in the Middle East that interferes with the production of oil, we will definitely feel the acceleration in our business. So that's sort of where the thing sits right now.\n\nOperator\n\nThank you. Ladies and gentlemen, there are no further questions at this time. I would like to turn the call over to Dr. Hartnett for any closing remarks.\n\nMichael Hartnett\n\nOkay. Well, I'd like to thank everyone for participating today, and we look forward to speaking again to you in the fall. So a good day.\n\nOperator\n\nThis will conclude today's conference. Thank you for your participation. You may now disconnect your lines at this time.\n\nView comments",
        "link": "https://finance.yahoo.com/news/q1-2025-rbc-bearings-inc-092601750.html",
        "symbols": [
            "B1X.F",
            "RB8.F",
            "RBC.US",
            "RRX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.032,
            "neu": 0.854,
            "pos": 0.114
        }
    },
    {
        "date": "2024-08-02T13:20:00+00:00",
        "title": "CORRECTING and REPLACING RBC Bearings Incorporated Announces Fiscal First Quarter 2025 Results",
        "content": "OXFORD, Conn., August 02, 2024--(BUSINESS WIRE)--In the table FY2025 Q2 Outlook - Modeling Items, the row Gross margin (as a percentage of net sales) should read 43.00% - 44.00% (instead of 43.00% - 4.00%).\n\nThe updated release reads:\n\nRBC BEARINGS INCORPORATED ANNOUNCES FISCAL FIRST QUARTER 2025 RESULTS\n\nRBC Bearings Incorporated (NYSE: RBC, RBCP), a leading international manufacturer of highly engineered precision bearings, components and essential systems for the industrial, defense and aerospace industries, today reported results for the first quarter fiscal 2025.\n\nFirst Quarter Financial Highlights\n\nFirst quarter net sales of $406.3 million increased 5.0% over last year, Aerospace/Defense up 23.7% and Industrial down 3.5%.\n\nGross margin of 45.3% for the first quarter of fiscal 2025 compared to 43.4% last year.\n\nFirst quarter net income attributable to common stockholders as a percentage of net sales of 13.7% vs 11.4% last year.\n\nAdjusted EBITDA as a percentage of net sales of 33.0% vs 31.1% last year.\n\nFirst quarter free cash flow conversion of 144.0% vs 110.0% last year.\n\nThree Month Financial Highlights\n\n($ in millions) Fiscal 2025 Fiscal 2024 Change GAAP Adjusted (1) GAAP Adjusted (1) GAAP Adjusted (1) Net sales $406.3 $387.1 5.0% Gross margin $184.0 $167.9 9.6% Gross margin % 45.3% 43.4% Operating income $97.5 $97.5 $85.0 $85.3 14.7% 14.3% Operating income % 24.0% 24.0% 22.0% 22.0% Net income $61.4 $80.2 $50.0 $67.7 22.8% 18.5% Net income attributable to\r\ncommon stockholders $55.7 $74.5 $44.3 $62.0 25.7% 20.2% Diluted EPS $1.90 $2.54 $1.52 $2.13 25.0% 19.2% (1) Results exclude items in\r\nreconciliation below.\n\n\"RBC continued to deliver strong operational performance in the first quarter with 5.0% sales growth, 11.3% adjusted EBITDA growth and 19.2% adjusted diluted earnings per share growth,\" said Dr. Michael J. Hartnett, Chairman and Chief Executive Officer. \"Customer demand for our capacity in the Aerospace and Defense end market remains robust, as evidenced by our 23.7% revenue growth, and our Industrial business continued to execute well and remains well poised for any acceleration in industrial end markets as we progress through the remainder of the year. Profit performance in the quarter was notable and continues to be driven by ongoing absorption of our aerospace and defense capacity and continued Dodge synergies, which are tailwinds that we believe will continue to benefit us through the remainder of the fiscal year.\"\n\nFirst Quarter Results\n\nNet sales for the first quarter of fiscal 2025 were $406.3 million, an increase of 5.0% from $387.1 million in the first quarter of fiscal 2024. Net sales for the Industrial segment decreased 3.5%, while net sales for the Aerospace/Defense segment increased 23.7%. Gross margin for the first quarter of fiscal 2025 was $184.0 million compared to $167.9 million for the same period last year.\n\nStory continues\n\nSG&A for the first quarter of fiscal 2025 was $67.6 million, an increase of $2.9 million from $64.7 million for the same period last year. As a percentage of net sales, SG&A was 16.6% for the first quarter of fiscal 2025 compared to 16.7% for the same period last year.\n\nOther operating expenses for the first quarter of fiscal 2025 totaled $18.9 million compared to $18.2 million for the same period last year. For the first quarter of fiscal 2025, other operating expenses included $17.8 million of amortization of intangible assets and $1.1 million of other items. For the first quarter of fiscal 2024, other operating expenses included $17.5 million of amortization of intangible assets and $0.7 million of other items.\n\nOperating income for the first quarter of fiscal 2025 was $97.5 million compared to $85.0 million for the same period last year. On an adjusted basis, operating income was $97.5 million for the first quarter of fiscal 2025 compared to $85.3 million for the same period last year. Refer to the tables below for details on the adjustments made to operating income to arrive at adjusted operating income.\n\nInterest expense, net, was $17.2 million for the first quarter of fiscal 2025 compared to $20.5 million for the same period last year.\n\nIncome tax expense for the first quarter of fiscal 2025 was $18.5 million compared to $14.0 million for the same period last year. The effective income tax rate for the first quarter of fiscal 2025 was 23.1% compared to 21.9% for the same period last year.\n\nNet income for the first quarter of fiscal 2025 was $61.4 million compared to $50.0 million for the same period last year. On an adjusted basis, net income was $80.2 million for the first quarter of fiscal 2025 compared to $67.7 million for the same period last year. Refer to the tables below for details on the adjustments made to net income to arrive at adjusted net income. Net income attributable to common stockholders for the first quarter of fiscal 2025 was $55.7 million compared to $44.3 million for the same period last year. On an adjusted basis, net income attributable to common stockholders for the first quarter of fiscal 2025 was $74.5 million compared to $62.0 million for the same period last year.\n\nDiluted EPS attributable to common stockholders for the first quarter of fiscal 2025 was $1.90 compared to $1.52 for the same period last year. On an adjusted basis, diluted EPS attributable to common stockholders was $2.54 for the first quarter of fiscal 2025 compared to $2.13 for the same period last year.\n\nBacklog as of June 29, 2024, was $825.8 million compared to $821.5 million as of March 30, 2024 and $765.2 million as of July 1, 2023.\n\nPreferred Stock Conversion in Fiscal 2025\n\nThe Company’s Series A mandatory convertible preferred stock is set to automatically convert to common stock on October 15, 2024, at which point the Company will no longer be required to pay a 5.0% dividend ($5.7 million per quarter), which reduces net income attributable to common stockholders. This will lead to $23.0 million of annual cash savings in future periods. Fiscal 2025 will include the final three quarterly dividend payments, the first of which was made in the first quarter.\n\nIf the preferred stock conversion were to have taken place during the first quarter of fiscal 2025, it would have resulted in an additional 2,029,980 shares of outstanding common stock. If these 2,029,980 shares were added to the total diluted shares outstanding in lieu of the preferred stock quarterly dividend of $5.7 million, diluted EPS for this quarter would have been $1.96 rather than the reported $1.90, and adjusted diluted EPS would have been $2.56 rather than the reported $2.54.\n\nOutlook for the Second Quarter Fiscal 2025\n\nThe Company expects net sales to be approximately $395.0 million to $405.0 million in the second quarter of fiscal 2025, compared to $385.6 million last year, a growth rate of 2.4% to 5.0%.\n\nLive Webcast\n\nRBC Bearings Incorporated will host a webcast on Friday, August 2nd, 2024, at 11:00 a.m. ET to discuss the quarterly results. To access the webcast, go to the investor relations portion of the Company’s website, www.rbcbearings.com, and click on the webcast icon. If you do not have access to the Internet and wish to listen to the call, dial 877-407-4019 (international callers dial +1 201-689-8337) and provide conference ID # 13747958. Investors are advised to dial into the call at least ten minutes prior to the call to register. An audio replay of the call will be available from 2:00 p.m. ET August 2nd, 2024, until 2:00 p.m. ET August 16th, 2024. The replay can be accessed by dialing 877-660-6853 (international callers dial +1 201-612-7415) and providing conference ID # 13747958.\n\nNon-GAAP Financial Measures\n\nIn addition to disclosing results of operations that are determined in accordance with U.S. generally accepted accounting principles (GAAP), this press release also discloses non-GAAP results of operations that exclude certain items. These non-GAAP measures adjust for items that management believes are unusual, as well as other non-cash items including but not limited to depreciation, amortization, and equity-based incentive compensation. Management believes that the presentation of these non-GAAP measures provides useful information to investors regarding the Company’s results of operations as these non-GAAP measures allow investors to better evaluate ongoing business performance. Investors should consider non-GAAP measures in addition to, not as a substitute for, financial measures prepared in accordance with GAAP. A reconciliation of the non-GAAP measures disclosed in this press release with the most comparable GAAP measures are included in the financial table attached to this press release.\n\nFree Cash Flow Conversion Free cash flow conversion measures our ability to convert operating profits into free cash flow and is calculated as free cash flow (cash provided by operating activities less capital expenditures) divided by net income.\n\nAdjusted Gross Margin and Adjusted Operating Income Adjusted gross margin excludes the impact of restructuring costs associated with the closing of a plant. Adjusted operating income excludes acquisition expenses (including the impact of acquisition-related fair value adjustments in connection with purchase), restructuring and other similar charges, and other non-operational, non-cash or non-recurring losses. We believe that adjusted operating income is useful in assessing our financial performance by excluding items that are not indicative of our core operating performance or that may obscure trends useful in evaluating our continuing results of operations.\n\nAdjusted Net Income Attributable to Common Stockholders and Adjusted Earnings Per Share Attributable to Common Stockholders Adjusted net income attributable to common stockholders and adjusted earnings per share attributable to common stockholders (calculated on a diluted basis) exclude non-cash expenses for amortization related to acquired intangible assets, stock-based compensation, amortization of deferred finance fees, acquisition expenses (including the impact of acquisition-related fair value adjustments in connection with purchase), restructuring and other similar charges, gains or losses on divestitures, discontinued operations, gains or losses on extinguishment of debt, and other non-operational, non-cash or non-recurring losses, net of their income tax impact. We believe that adjusted net income and adjusted earnings per share are useful in assessing our financial performance by excluding items that are not indicative of our core operating performance or that may obscure trends useful in evaluating our continuing results of operations.\n\nAdjusted EBITDA We use the term \"Adjusted EBITDA\" to describe net income adjusted for the items summarized in the \"Reconciliation of GAAP to Non-GAAP Financial Measures\" table below. Adjusted EBITDA is intended to show our unleveraged, pre-tax operating results and therefore reflects our financial performance based on operational factors, excluding non-operational, non-cash or non-recurring losses or gains. In view of our debt level, Adjusted EBITDA aids our investors in understanding our compliance with our debt covenants. Management and various investors use the ratio of total debt less cash to Adjusted EBITDA, or \"net debt leverage,\" as a measure of our financial strength and ability to incur incremental indebtedness when making investment decisions and evaluating us against peers. Lastly, management and various investors use the ratio of the change in Adjusted EBITDA divided by the change in net sales (referred to as \"incremental margin\" in the case of an increase in net sales or \"decremental margin\" in the case of a decrease in net sales) as an additional measure of our financial performance and some investors utilize it when making investment decisions and evaluating us against peers.\n\nAdjusted EBITDA is not a presentation made in accordance with GAAP, and our definition of Adjusted EBITDA may vary from the definition used by others in our industry. Adjusted EBITDA should not be considered as an alternative to net income, income from operations, or any other performance measures derived in accordance with GAAP. Adjusted EBITDA has important limitations as an analytical tool, and you should not consider it in isolation, or as a substitute for analysis of our results as reported under GAAP. For example, Adjusted EBITDA does not reflect (a) our capital expenditures, future requirements for capital expenditures or contractual commitments; (b) changes in, or cash requirements for, our working capital needs; (c) the significant interest expenses, or the cash requirements necessary to service interest or principal payments, on our debt; (d) tax payments that represent a reduction in cash available to us; (e) any cash requirements for the assets being depreciated and amortized that may have to be replaced in the future; or (f) the impact of earnings or charges resulting from matters that we and the lenders under our credit agreement may not consider indicative of our ongoing operations. In particular, our definition of Adjusted EBITDA adds back certain non-cash, non-operating or non-recurring charges that are deducted in calculating net income, even though these are expenses that may recur or vary greatly, are difficult to predict, and can represent the effect of long-term strategies as opposed to short-term results. In addition, certain of these expenses can represent the reduction of cash that could be used for other corporate purposes. Further, although not included in the calculation of Adjusted EBITDA below, the measure may at times (i) include estimated cost savings and operating synergies related to operational changes ranging from acquisitions to dispositions to restructurings and/or (ii) exclude one-time transition expenditures that we anticipate we will need to incur to realize cost savings before such savings have occurred.\n\nAbout RBC Bearings\n\nRBC Bearings Incorporated is an international manufacturer and marketer of highly engineered precision bearings, components and essential systems. Founded in 1919, the Company is primarily focused on producing highly technical or regulated bearing products and components requiring sophisticated design, testing, and manufacturing capabilities for the diversified industrial, aerospace and defense markets. The Company is headquartered in Oxford, Connecticut.\n\nSafe Harbor for Forward Looking Statements\n\nCertain statements in this press release contain \"forward-looking statements.\" All statements other than statements of historical fact are \"forward-looking statements\" for purposes of federal and state securities laws, including the following: the section of this press release entitled \"Outlook\"; any projections of earnings, revenue or other financial items relating to the Company, any statement of the plans, strategies and objectives of management for future operations; any statements concerning proposed future growth rates in the markets we serve; any statements of belief; any characterization of and the Company’s ability to control contingent liabilities; anticipated trends in the Company’s businesses; and any statements of assumptions underlying any of the foregoing. Forward-looking statements may include the words \"may,\" \"would,\" \"estimate,\" \"intend,\" \"continue,\" \"believe,\" \"expect,\" \"anticipate,\" and other similar words. Although the Company believes that the expectations reflected in any forward-looking statements are reasonable, actual results could differ materially from those projected or assumed in any of our forward-looking statements. Our future financial condition and results of operations, as well as any forward-looking statements, are subject to change and to inherent risks and uncertainties beyond the control of the Company. These risks and uncertainties include, but are not limited to, risks and uncertainties relating to general economic conditions, geopolitical factors, future levels of aerospace/defense and industrial market activity, future financial performance, our use of information technology systems, our disclosure controls and procedures and internal control over financial reporting, our debt level, our level of goodwill, market acceptance of new or enhanced versions of the Company’s products, the pricing of raw materials, changes in the competitive environments in which the Company’s businesses operate, increases in interest rates, the Company’s ability to acquire and integrate complementary businesses, and risks and uncertainties listed or disclosed in our reports filed with the Securities and Exchange Commission, including, without limitation, the risks identified under the heading \"Risk Factors\" set forth in the Company’s most recent Annual Report on Form 10-K filed with the SEC. The Company does not intend, and undertakes no obligation, to update or alter any forward-looking statements.\n\nRBC Bearings Incorporated\n\nConsolidated Statements of Operations (dollars in millions, except per share data) Three Months Ended (Unaudited) June 29, July 1, 2024 2023 Net sales $ 406.3 $ 387.1 Cost of sales 222.3 219.2 Gross margin 184.0 167.9 Operating expenses: Selling, general and administrative 67.6 64.7 Other, net 18.9 18.2 Total operating expenses 86.5 82.9 Operating income 97.5 85.0 Interest expense, net 17.2 20.5 Other non-operating expense 0.4 0.5 Income before income taxes 79.9 64.0 Provision for income taxes 18.5 14.0 Net income 61.4 50.0 Preferred stock dividends 5.7 5.7 Net income attributable to common stockholders $ 55.7 $ 44.3 Net income per common share attributable to common stockholders: Basic $ 1.92 $ 1.53 Diluted $ 1.90 $ 1.52 Weighted average common shares: Basic 29,054,820 28,846,874 Diluted 29,294,998 29,114,819 Segment Data: Three Months Ended June 29, July 1, Net External Sales: 2024 2023 Aerospace and defense segment $ 149.1 $ 120.5 Industrial segment 257.2 266.6 Total net external sales $ 406.3 $ 387.1 Three Months Ended Reconciliation of Reported Operating Income to June 29, July 1, Adjusted Operating Income: 2024 2023 Reported operating income $ 97.5 $ 85.0 Restructuring and consolidation - 0.3 Adjusted operating income $ 97.5 $ 85.3 Three Months Ended Reconciliation of Reported Net Income to Adjusted Net June 29, July 1, Income Attributable to Common Stockholders: 2024 2023 Reported net income $ 61.4 $ 50.0 Restructuring and consolidation - 0.3 M&A related amortization 16.4 16.3 Stock compensation expense 6.5 5.4 Amortization of deferred finance fees 0.6 0.9 Tax impact of adjustments and other tax matters (4.7) (5.2) Adjusted net income $ 80.2 $ 67.7 Preferred stock dividends 5.7 5.7 Adjusted net income attributable to common stockholders $ 74.5 $ 62.0 Adjusted net income per common share attributable to common stockholders: Basic $ 2.56 $ 2.15 Diluted $ 2.54 $ 2.13 Weighted average common shares: Basic 29,054,820 28,846,874 Diluted 29,294,998 29,114,819 Three Months Ended Reconciliation of Reported Net Income to June 29, July 1, Adjusted EBITDA: 2024 2023 Reported net income $ 61.4 $ 50.0 Interest expense, net 17.2 20.5 Provision for income taxes 18.5 14.0 Stock compensation expense 6.5 5.4 Depreciation and amortization 30.0 29.7 Other non-operating expense 0.4 0.5 Restructuring and consolidation - 0.3 Adjusted EBITDA $ 134.0 $ 120.4 Consolidated Balance Sheets (dollars in millions, except per share data) June 29, March 30, 2024 2024 Assets Cash and cash equivalents $ 76.8 $ 63.5 Accounts receivable, net of allowance for doubtful accounts 254.7 255.2 Inventory 635.0 622.8 Prepaid expenses and other current assets 27.7 24.0 Total current assets 994.2 965.5 Property, plant and equipment, net 356.8 361.0 Operating lease assets, net 50.9 41.4 Goodwill 1,874.2 1,874.9 Intangible assets, net 1,375.9 1,391.9 Other noncurrent assets 44.5 43.9 Total assets $ 4,696.5 $ 4,678.6 Liabilities and Stockholders' Equity Liabilities Accounts payable $ 127.5 $ 116.2 Accrued expenses and other current liabilities 190.5 167.3 Current operating lease liabilities 8.5 7.0 Current portion of long-term debt 3.8 3.8 Total current liabilities 330.3 294.3 Long-term debt, less current portion 1,127.6 1,188.1 Non-current operating lease liabilities 42.9 35.3 Deferred income taxes 280.2 284.2 Other noncurrent liabilities 111.6 124.8 Total liabilities 1,892.6 1,926.7 Stockholders' equity Preferred stock, $.01 par value 0.0 0.0 Common stock, $.01 par value 0.3 0.3 Additional paid‑in capital 1,630.6 1,625.2 Accumulated other comprehensive income/(loss) (0.4) 0.7 Retained earnings 1,272.5 1,216.8 Treasury stock, at cost (99.1) (91.1) Total stockholders' equity 2,803.9 2,751.9 Total liabilities and stockholders' equity $ 4,696.5 $ 4,678.6 Consolidated Statements of Cash Flows (dollars in millions) (Unaudited) June 29, July 1, 2024 2023 Cash flows from operating activities: Net income $ 61.4 $ 50.0 Adjustments to reconcile net income to net cash provided by operating activities: Depreciation and amortization 30.0 29.7 Deferred income taxes (4.1) (2.6) Amortization of deferred financing costs 0.6 0.9 Stock-based compensation 6.5 5.4 Noncash operating lease expense 1.7 1.7 Loss on disposition of assets - 0.2 Consolidation, restructuring, and other noncash charges - 0.3 Changes in operating assets and liabilities, net of acquisitions: Accounts receivable 0.5 (12.0) Inventory (12.1) (15.6) Prepaid expenses and other current assets (3.8) (2.1) Other noncurrent assets (0.6) (2.6) Accounts payable 11.3 (6.8) Accrued expenses and other current liabilities 23.9 13.0 Other noncurrent liabilities (17.9) 2.2 Net cash provided by operating activities 97.4 61.7 Cash flows from investing activities: Capital expenditures (9.0) (6.7) Proceeds from sale of assets - 0.2 Net cash used in investing activities (9.0) (6.5) Cash flows from financing activities: Repayments of term loans (60.0) (50.0) Repayments of notes payable (1.1) (1.1) Principal payments on finance lease obligations (1.1) (1.0) Preferred stock dividends paid (5.7) (5.7) Exercise of stock options 1.2 1.0 Repurchase of common stock (8.0) (6.8) Net cash used in financing activities (74.7) (63.6) Effect of exchange rate changes on cash (0.4) (0.3) Cash and cash equivalents: Increase / (decrease) during the period 13.3 (8.7) Cash and cash equivalents, at beginning of period 63.5 65.4 Cash and cash equivalents, at end of period $ 76.8 $ 56.7 Supplemental disclosures of cash flow information: Cash paid for: Income taxes $ 12.5 $ 1.1 Interest 22.0 25.1 FY2025 Q2 Outlook - Modeling Items: Net sales $395.0 - $405.0 Gross margin (as a percentage of net sales) 43.00% - 44.00% SG&A (as a percentage of net sales) 17.25% -17.75%\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240802051463/en/\n\nContacts\n\nRob Moffatt\r\nDirector of Investor Relations\r\ninvestors@rbcbearings.com\n\nView comments",
        "link": "https://finance.yahoo.com/news/rbc-bearings-incorporated-announces-fiscal-120000894.html",
        "symbols": [
            "B1X.F",
            "RBC.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.046,
            "neu": 0.863,
            "pos": 0.091
        }
    },
    {
        "date": "2024-08-02T13:10:05+00:00",
        "title": "RBC Bearings (RBC) Tops Q1 Earnings Estimates",
        "content": "RBC Bearings (RBC) came out with quarterly earnings of $2.54 per share, beating the Zacks Consensus Estimate of $2.37 per share. This compares to earnings of $2.13 per share a year ago. These figures are adjusted for non-recurring items.\n\nThis quarterly report represents an earnings surprise of 7.17%. A quarter ago, it was expected that this maker of bearings and components would post earnings of $2.32 per share when it actually produced earnings of $2.47, delivering a surprise of 6.47%.\n\nOver the last four quarters, the company has surpassed consensus EPS estimates three times.\n\nRBC Bearings , which belongs to the Zacks Manufacturing - General Industrial industry, posted revenues of $406.3 million for the quarter ended June 2024, missing the Zacks Consensus Estimate by 2.58%. This compares to year-ago revenues of $387.12 million. The company has topped consensus revenue estimates just once over the last four quarters.\n\nThe sustainability of the stock's immediate price movement based on the recently-released numbers and future earnings expectations will mostly depend on management's commentary on the earnings call.\n\nRBC Bearings shares have added about 1.1% since the beginning of the year versus the S&P 500's gain of 14.2%.\n\nWhat's Next for RBC Bearings?\n\nWhile RBC Bearings has underperformed the market so far this year, the question that comes to investors' minds is: what's next for the stock?\n\nThere are no easy answers to this key question, but one reliable measure that can help investors address this is the company's earnings outlook. Not only does this include current consensus earnings expectations for the coming quarter(s), but also how these expectations have changed lately.\n\nEmpirical research shows a strong correlation between near-term stock movements and trends in earnings estimate revisions. Investors can track such revisions by themselves or rely on a tried-and-tested rating tool like the Zacks Rank, which has an impressive track record of harnessing the power of earnings estimate revisions.\n\nAhead of this earnings release, the estimate revisions trend for RBC Bearings: unfavorable. While the magnitude and direction of estimate revisions could change following the company's just-released earnings report, the current status translates into a Zacks Rank #4 (Sell) for the stock. So, the shares are expected to underperform the market in the near future. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here.\n\nIt will be interesting to see how estimates for the coming quarters and current fiscal year change in the days ahead. The current consensus EPS estimate is $2.28 on $402.28 million in revenues for the coming quarter and $9.48 on $1.65 billion in revenues for the current fiscal year.\n\nStory continues\n\nInvestors should be mindful of the fact that the outlook for the industry can have a material impact on the performance of the stock as well. In terms of the Zacks Industry Rank, Manufacturing - General Industrial is currently in the bottom 40% of the 250 plus Zacks industries. Our research shows that the top 50% of the Zacks-ranked industries outperform the bottom 50% by a factor of more than 2 to 1.\n\nAnother stock from the same industry, Nordson (NDSN), has yet to report results for the quarter ended July 2024. The results are expected to be released on August 21.\n\nThis maker of adhesives and industrial coatings is expected to post quarterly earnings of $2.33 per share in its upcoming report, which represents a year-over-year change of -0.9%. The consensus EPS estimate for the quarter has remained unchanged over the last 30 days.\n\nNordson's revenues are expected to be $655.23 million, up 1% from the year-ago quarter.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nRBC Bearings Incorporated (RBC) : Free Stock Analysis Report\n\nNordson Corporation (NDSN) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/rbc-bearings-rbc-tops-q1-131005957.html",
        "symbols": [
            "B1X.F",
            "RB8.F",
            "RBC.US",
            "RRX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.995,
            "neg": 0.008,
            "neu": 0.901,
            "pos": 0.091
        }
    },
    {
        "date": "2024-08-02T12:14:36+00:00",
        "title": "RBC Bearings (NYSE:RBC) Misses Q2 Revenue Estimates",
        "content": "RBC Bearings (NYSE:RBC) Misses Q2 Revenue Estimates\n\nBearings manufacturer RBC Bearings (NYSE:RBC) fell short of analysts' expectations in Q2 CY2024, with revenue up 5% year on year to $406.3 million. Next quarter's revenue guidance of $400 million also underwhelmed, coming in 1.7% below analysts' estimates. It made a non-GAAP profit of $2.54 per share, improving from its profit of $1.89 per share in the same quarter last year.\n\nIs now the time to buy RBC Bearings? Find out in our full research report.\n\nRBC Bearings (RBC) Q2 CY2024 Highlights:\n\nRevenue: $406.3 million vs analyst estimates of $416.9 million (2.5% miss) EPS (non-GAAP): $2.54 vs analyst estimates of $2.42 (4.8% beat) Revenue Guidance for Q3 CY2024 is $400 million at the midpoint, below analyst estimates of $407.1 million Gross Margin (GAAP): 45.3%, up from 43.4% in the same quarter last year Free Cash Flow of $18.4 million, down 73.7% from the previous quarter Market Capitalization: $8.33 billion\n\n“RBC continued to deliver strong operational performance in the first quarter with 5.0% sales growth, 11.3% adjusted EBITDA growth and 19.2% adjusted diluted earnings per share growth,” said Dr. Michael J. Hartnett, Chairman and Chief Executive Officer.\n\nWith a Guinness World Record for engineering the largest spherical plain bearing, RBC Bearings (NYSE:RBC) is a manufacturer of bearings and related components for the aerospace & defense, industrial, and transportation industries.\n\nEngineered Components and Systems\n\nEngineered components and systems companies possess technical know-how in sometimes narrow areas such as metal forming or intelligent robotics. Lately, automation and connected equipment collecting analyzable data have been trending, creating new demand. On the other hand, like the broader industrials sector, engineered components and systems companies are at the whim of economic cycles. Consumer spending and interest rates, for example, can greatly impact the industrial production that drives demand for these companies’ offerings.\n\nSales Growth\n\nA company’s long-term performance can indicate its business quality. Any business can put up a good quarter or two, but many enduring ones tend to grow for years. Luckily, RBC Bearings's sales grew at an incredible 17.4% compounded annual growth rate over the last five years. This is a great starting point for our analysis because it shows RBC Bearings's offerings resonate with customers. RBC Bearings Total Revenue\n\nWe at StockStory place the most emphasis on long-term growth, but within industrials, a half-decade historical view may miss cycles, industry trends, or a company capitalizing on catalysts such as a new contract win or a successful product line. RBC Bearings's annualized revenue growth of 17.7% over the last two years aligns with its five-year trend, suggesting its demand was predictably strong.\n\nWe can dig further into the company's revenue dynamics by analyzing its most important segments, Diversified Industrials and Aerospace and Defense, which are 63.3% and 36.7% of revenue. Over the last two years, RBC Bearings's Diversified Industrials revenue (general industrial equipment) averaged 42.1% year-on-year growth while its Aerospace and Defense revenue (aircraft equipment, radar, missiles) averaged 18.5% growth.\n\nThis quarter, RBC Bearings's revenue grew 5% year on year to $406.3 million, falling short of Wall Street's estimates. The company is guiding for revenue to rise 3.7% year on year to $400 million next quarter, slowing from the 4.4% year-on-year increase it recorded in the same quarter last year. We also like to judge companies based on their projected revenue growth, but not enough Wall Street analysts cover the company for it to have reliable consensus estimates. This signals RBC Bearings could be a hidden gem because it doesn't get attention from professional brokers.\n\nUnless you’ve been living under a rock, it should be obvious by now that generative AI is going to have a huge impact on how large corporations do business. While Nvidia and AMD are trading close to all-time highs, we prefer a lesser-known (but still profitable) semiconductor stock benefitting from the rise of AI. Click here to access our free report on our favorite semiconductor growth story.\n\nOperating Margin\n\nRBC Bearings has been a well-oiled machine over the last five years. It demonstrated elite profitability for an industrials business, boasting an average operating margin of 19.6%. This result isn't surprising as its high gross margin gives it a favorable starting point.\n\nAnalyzing the trend in its profitability, RBC Bearings's annual operating margin rose by 1.5 percentage points over the last five years, as its sales growth gave it operating leverage. RBC Bearings Operating Margin (GAAP)\n\nIn Q2, RBC Bearings generated an operating profit margin of 24%, up 2 percentage points year on year. This increase was encouraging, and since the company's operating margin rose more than its gross margin, we can infer it was recently more efficient with expenses such as sales, marketing, R&D, and administrative overhead.\n\nEPS\n\nAnalyzing long-term revenue trends tells us about a company's historical growth, but the long-term change in its earnings per share (EPS) points to the profitability of that growth–for example, a company could inflate its sales through excessive spending on advertising and promotions.\n\nRBC Bearings's EPS grew at a solid 11.4% compounded annual growth rate over the last five years. Despite its operating margin expansion during that time, this performance was lower than its 17.4% annualized revenue growth. This tells us non-fundamental factors affected its ultimate earnings. RBC Bearings EPS (Adjusted)\n\nWe can take a deeper look into RBC Bearings's earnings quality to better understand the drivers of its performance. A five-year view shows RBC Bearings has diluted its shareholders, growing its share count by 18.1%. This dilution overshadowed its increased operating efficiency and has led to lower per share earnings. Taxes and interest expenses can also affect EPS but don't tell us as much about a company's fundamentals. RBC Bearings Diluted Shares Outstanding\n\nLike with revenue, we also analyze EPS over a shorter period to see if we are missing a change in the business. For RBC Bearings, its two-year annual EPS growth of 44.4% was higher than its five-year trend. We love it when earnings growth accelerates, especially when it accelerates off an already high base.\n\nIn Q2, RBC Bearings reported EPS at $2.54, up from $1.89 in the same quarter last year. This print beat analysts' estimates by 4.8%. We also like to analyze expected EPS growth based on Wall Street analysts' consensus projections, but there is insufficient data. This signals RBC Bearings could be a hidden gem because it doesn't have much coverage among professional brokers.\n\nKey Takeaways from RBC Bearings's Q2 Results\n\nIt was good to see RBC Bearings beat analysts' EPS expectations this quarter. On the other hand, its revenue unfortunately missed and its revenue guidance for next quarter came in slightly below Wall Street's estimates. Overall, this was a mediocre quarter for RBC Bearings. The stock remained flat at $288.03 immediately following the results.\n\nRBC Bearings may have had a tough quarter, but does that actually create an opportunity to invest right now? When making that decision, it's important to consider its valuation, business qualities, as well as what has happened in the latest quarter. We cover that in our actionable full research report which you can read here, it's free.\n\nView comments",
        "link": "https://finance.yahoo.com/news/rbc-bearings-nyse-rbc-misses-121436195.html",
        "symbols": [
            "B1X.F",
            "RB8.F",
            "RBC.US",
            "RRX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.03,
            "neu": 0.795,
            "pos": 0.175
        }
    },
    {
        "date": "2024-08-02T12:07:56+00:00",
        "title": "RBC Bearings: Fiscal Q1 Earnings Snapshot",
        "content": "OXFORD, Conn. (AP) — OXFORD, Conn. (AP) — RBC Bearings Inc. (RBC) on Friday reported fiscal first-quarter earnings of $61.4 million.\n\nThe Oxford, Connecticut-based company said it had net income of $1.90 per share. Earnings, adjusted for amortization costs and stock option expense, came to $2.54 per share.\n\nThe results beat Wall Street expectations. The average estimate of four analysts surveyed by Zacks Investment Research was for earnings of $2.37 per share.\n\nThe maker of bearings and components posted revenue of $406.3 million in the period, which fell short of Street forecasts. Four analysts surveyed by Zacks expected $417.1 million.\n\nFor the current quarter ending in September, RBC Bearings said it expects revenue in the range of $395 million to $405 million.\n\n_____\n\nThis story was generated by Automated Insights (http://automatedinsights.com/ap) using data from Zacks Investment Research. Access a Zacks stock report on RBC at https://www.zacks.com/ap/RBC\n\nView comments",
        "link": "https://finance.yahoo.com/news/rbc-bearings-fiscal-q1-earnings-120756753.html",
        "symbols": [
            "B1X.F",
            "RB8.F",
            "RBC.US",
            "RRX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.735,
            "neg": 0,
            "neu": 0.946,
            "pos": 0.054
        }
    },
    {
        "date": "2024-08-02T00:00:00+00:00",
        "title": "RBC Stock Earnings: RBC Bearings Beats EPS, Misses Revenue for Q1 2025",
        "content": "RBC stock results show that RBC Bearings beat analyst estimates for earnings per share but missed on revenue for the first quarter of 2025.",
        "link": "https://investorplace.com/earning-results/2024/08/rbc-stock-earnings-rbc-bearings-for-q1-of-2025/",
        "symbols": [
            "RBC.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": -0.296,
            "neg": 0.106,
            "neu": 0.833,
            "pos": 0.061
        }
    },
    {
        "date": "2024-08-01T07:02:10+00:00",
        "title": "RBC Bearings Earnings: What To Look For From RBC",
        "content": "RBC Bearings Earnings: What To Look For From RBC\n\nBearings manufacturer RBC Bearings (NYSE:RBC) will be reporting results tomorrow before market open. Here's what you need to know.\n\nRBC Bearings met analysts' revenue expectations last quarter, reporting revenues of $413.7 million, up 4.9% year on year. It was a weaker quarter for the company, with a miss of analysts' earnings estimates.\n\nIs RBC Bearings a buy or sell going into earnings? Read our full analysis here, it's free.\n\nThis quarter, analysts are expecting RBC Bearings's revenue to grow 7.7% year on year to $416.9 million, slowing from the 9.3% increase it recorded in the same quarter last year. Adjusted earnings are expected to come in at $2.42 per share. RBC Bearings Total Revenue\n\nThe majority of analysts covering the company have reconfirmed their estimates over the last 30 days, suggesting they anticipate the business to stay the course heading into earnings. RBC Bearings has missed Wall Street's revenue estimates six times over the last two years.\n\nLooking at RBC Bearings's peers in the engineered components and systems segment, some have already reported their Q2 results, giving us a hint as to what we can expect. Regal Rexnord's revenues decreased 12.5% year on year, beating analysts' expectations by 2.7%, and Gates Industrial Corporation reported a revenue decline of 5.4%, in line with consensus estimates.\n\nRead our full analysis of Regal Rexnord's results here and Gates Industrial Corporation's results here.\n\nThere has been positive sentiment among investors in the engineered components and systems segment, with share prices up 10% on average over the last month. RBC Bearings is up 6.2% during the same time and is heading into earnings with an average analyst price target of $303.2 (compared to the current share price of $290.84).\n\nHere at StockStory, we certainly understand the potential of thematic investing. Diverse winners from Microsoft (MSFT) to Alphabet (GOOG), Coca-Cola (KO) to Monster Beverage (MNST) could all have been identified as promising growth stories with a megatrend driving the growth. So, in that spirit, we’ve identified a relatively under-the-radar profitable growth stock benefitting from the rise of AI, available to you FREE via this link.\n\nView comments",
        "link": "https://finance.yahoo.com/news/rbc-bearings-earnings-look-rbc-070210191.html",
        "symbols": [
            "B1X.F",
            "RB8.F",
            "RBC.US",
            "RRX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.987,
            "neg": 0.025,
            "neu": 0.856,
            "pos": 0.119
        }
    },
    {
        "date": "2024-07-29T22:00:04+00:00",
        "title": "Crane (CR) Q2 Earnings and Revenues Top Estimates",
        "content": "Crane (CR) came out with quarterly earnings of $1.30 per share, beating the Zacks Consensus Estimate of $1.24 per share. This compares to earnings of $1.10 per share a year ago. These figures are adjusted for non-recurring items.\n\nThis quarterly report represents an earnings surprise of 4.84%. A quarter ago, it was expected that this maker of aerospace, electronics and engineered industrial products would post earnings of $1.12 per share when it actually produced earnings of $1.22, delivering a surprise of 8.93%.\n\nOver the last four quarters, the company has surpassed consensus EPS estimates four times.\n\nCrane , which belongs to the Zacks Manufacturing - General Industrial industry, posted revenues of $581.2 million for the quarter ended June 2024, surpassing the Zacks Consensus Estimate by 1.47%. This compares to year-ago revenues of $509.6 million. The company has topped consensus revenue estimates four times over the last four quarters.\n\nThe sustainability of the stock's immediate price movement based on the recently-released numbers and future earnings expectations will mostly depend on management's commentary on the earnings call.\n\nCrane shares have added about 34.5% since the beginning of the year versus the S&P 500's gain of 14.5%.\n\nWhat's Next for Crane?\n\nWhile Crane has outperformed the market so far this year, the question that comes to investors' minds is: what's next for the stock?\n\nThere are no easy answers to this key question, but one reliable measure that can help investors address this is the company's earnings outlook. Not only does this include current consensus earnings expectations for the coming quarter(s), but also how these expectations have changed lately.\n\nEmpirical research shows a strong correlation between near-term stock movements and trends in earnings estimate revisions. Investors can track such revisions by themselves or rely on a tried-and-tested rating tool like the Zacks Rank, which has an impressive track record of harnessing the power of earnings estimate revisions.\n\nAhead of this earnings release, the estimate revisions trend for Crane: favorable. While the magnitude and direction of estimate revisions could change following the company's just-released earnings report, the current status translates into a Zacks Rank #2 (Buy) for the stock. So, the shares are expected to outperform the market in the near future. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here.\n\nIt will be interesting to see how estimates for the coming quarters and current fiscal year change in the days ahead. The current consensus EPS estimate is $1.25 on $580.6 million in revenues for the coming quarter and $4.99 on $2.3 billion in revenues for the current fiscal year.\n\nStory continues\n\nInvestors should be mindful of the fact that the outlook for the industry can have a material impact on the performance of the stock as well. In terms of the Zacks Industry Rank, Manufacturing - General Industrial is currently in the top 36% of the 250 plus Zacks industries. Our research shows that the top 50% of the Zacks-ranked industries outperform the bottom 50% by a factor of more than 2 to 1.\n\nAnother stock from the same industry, RBC Bearings (RBC), has yet to report results for the quarter ended June 2024. The results are expected to be released on August 2.\n\nThis maker of bearings and components is expected to post quarterly earnings of $2.37 per share in its upcoming report, which represents a year-over-year change of +11.3%. The consensus EPS estimate for the quarter has remained unchanged over the last 30 days.\n\nRBC Bearings' revenues are expected to be $417.06 million, up 7.7% from the year-ago quarter.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nCrane Company (CR) : Free Stock Analysis Report\n\nRBC Bearings Incorporated (RBC) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/crane-cr-q2-earnings-revenues-220004436.html",
        "symbols": [
            "B1X.F",
            "RB8.F",
            "RBC.US",
            "RRX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.996,
            "neg": 0.005,
            "neu": 0.894,
            "pos": 0.101
        }
    },
    {
        "date": "2024-07-26T14:00:27+00:00",
        "title": "RBC Bearings (RBC) Earnings Expected to Grow: What to Know Ahead of Next Week's Release",
        "content": "The market expects RBC Bearings (RBC) to deliver a year-over-year increase in earnings on higher revenues when it reports results for the quarter ended June 2024. This widely-known consensus outlook is important in assessing the company's earnings picture, but a powerful factor that might influence its near-term stock price is how the actual results compare to these estimates.\n\nThe stock might move higher if these key numbers top expectations in the upcoming earnings report, which is expected to be released on August 2. On the other hand, if they miss, the stock may move lower.\n\nWhile the sustainability of the immediate price change and future earnings expectations will mostly depend on management's discussion of business conditions on the earnings call, it's worth handicapping the probability of a positive EPS surprise.\n\nZacks Consensus Estimate\n\nThis maker of bearings and components is expected to post quarterly earnings of $2.37 per share in its upcoming report, which represents a year-over-year change of +11.3%.\n\nRevenues are expected to be $417.06 million, up 7.7% from the year-ago quarter.\n\nEstimate Revisions Trend\n\nThe consensus EPS estimate for the quarter has remained unchanged over the last 30 days. This is essentially a reflection of how the covering analysts have collectively reassessed their initial estimates over this period.\n\nInvestors should keep in mind that an aggregate change may not always reflect the direction of estimate revisions by each of the covering analysts.\n\nEarnings Whisper\n\nEstimate revisions ahead of a company's earnings release offer clues to the business conditions for the period whose results are coming out. Our proprietary surprise prediction model -- the Zacks Earnings ESP (Expected Surprise Prediction) -- has this insight at its core.\n\nThe Zacks Earnings ESP compares the Most Accurate Estimate to the Zacks Consensus Estimate for the quarter; the Most Accurate Estimate is a more recent version of the Zacks Consensus EPS estimate. The idea here is that analysts revising their estimates right before an earnings release have the latest information, which could potentially be more accurate than what they and others contributing to the consensus had predicted earlier.\n\nThus, a positive or negative Earnings ESP reading theoretically indicates the likely deviation of the actual earnings from the consensus estimate. However, the model's predictive power is significant for positive ESP readings only.\n\nA positive Earnings ESP is a strong predictor of an earnings beat, particularly when combined with a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold). Our research shows that stocks with this combination produce a positive surprise nearly 70% of the time, and a solid Zacks Rank actually increases the predictive power of Earnings ESP.\n\nStory continues\n\nPlease note that a negative Earnings ESP reading is not indicative of an earnings miss. Our research shows that it is difficult to predict an earnings beat with any degree of confidence for stocks with negative Earnings ESP readings and/or Zacks Rank of 4 (Sell) or 5 (Strong Sell).\n\nHow Have the Numbers Shaped Up for RBC Bearings?\n\nFor RBC Bearings, the Most Accurate Estimate is higher than the Zacks Consensus Estimate, suggesting that analysts have recently become bullish on the company's earnings prospects. This has resulted in an Earnings ESP of +2.42%.\n\nOn the other hand, the stock currently carries a Zacks Rank of #3.\n\nSo, this combination indicates that RBC Bearings will most likely beat the consensus EPS estimate.\n\nDoes Earnings Surprise History Hold Any Clue?\n\nWhile calculating estimates for a company's future earnings, analysts often consider to what extent it has been able to match past consensus estimates. So, it's worth taking a look at the surprise history for gauging its influence on the upcoming number.\n\nFor the last reported quarter, it was expected that RBC Bearings would post earnings of $2.32 per share when it actually produced earnings of $2.47, delivering a surprise of +6.47%.\n\nOver the last four quarters, the company has beaten consensus EPS estimates three times.\n\nBottom Line\n\nAn earnings beat or miss may not be the sole basis for a stock moving higher or lower. Many stocks end up losing ground despite an earnings beat due to other factors that disappoint investors. Similarly, unforeseen catalysts help a number of stocks gain despite an earnings miss.\n\nThat said, betting on stocks that are expected to beat earnings expectations does increase the odds of success. This is why it's worth checking a company's Earnings ESP and Zacks Rank ahead of its quarterly release. Make sure to utilize our Earnings ESP Filter to uncover the best stocks to buy or sell before they've reported.\n\nRBC Bearings appears a compelling earnings-beat candidate. However, investors should pay attention to other factors too for betting on this stock or staying away from it ahead of its earnings release.\n\nExpected Results of an Industry Player\n\nMiddleby (MIDD), another stock in the Zacks Manufacturing - General Industrial industry, is expected to report earnings per share of $2.27 for the quarter ended June 2024. This estimate points to a year-over-year change of -8.1%. Revenues for the quarter are expected to be $988.88 million, down 4.9% from the year-ago quarter.\n\nOver the last 30 days, the consensus EPS estimate for Middleby has been revised 1.1% down to the current level. Nevertheless, the company now has an Earnings ESP of 0.44%, reflecting a higher Most Accurate Estimate.\n\nWhen combined with a Zacks Rank of #3 (Hold), this Earnings ESP indicates that Middleby will most likely beat the consensus EPS estimate. Over the last four quarters, the company surpassed consensus EPS estimates three times.\n\nStay on top of upcoming earnings announcements with the Zacks Earnings Calendar.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nRBC Bearings Incorporated (RBC) : Free Stock Analysis Report\n\nThe Middleby Corporation (MIDD) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/rbc-bearings-rbc-earnings-expected-140027410.html",
        "symbols": [
            "0K1G.LSE",
            "B1X.F",
            "MBY.F",
            "MBY.STU",
            "MIDD.US",
            "RB8.F",
            "RBC.US",
            "RRX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.039,
            "neu": 0.827,
            "pos": 0.134
        }
    },
    {
        "date": "2024-07-25T07:40:09+00:00",
        "title": "Q1 Earnings Highs And Lows: RBC Bearings (NYSE:RBC) Vs The Rest Of The Engineered Components and Systems Stocks",
        "content": "Q1 Earnings Highs And Lows: RBC Bearings (NYSE:RBC) Vs The Rest Of The Engineered Components and Systems Stocks\n\nThe end of the earnings season is always a good time to take a step back and see who shined (and who not so much). Let’s take a look at how engineered components and systems stocks fared in Q1, starting with RBC Bearings (NYSE:RBC).\n\nEngineered components and systems companies possess technical know-how in sometimes narrow areas such as metal forming or intelligent robotics. Lately, automation and connected equipment collecting analyzable data have been trending, creating new demand. On the other hand, like the broader industrials sector, engineered components and systems companies are at the whim of economic cycles. Consumer spending and interest rates, for example, can greatly impact the industrial production that drives demand for these companies’ offerings.\n\nThe 11 engineered components and systems stocks we track reported a slower Q1; on average, revenues were in line with analyst consensus estimates. Inflation progressed towards the Fed's 2% goal at the end of 2023, leading to strong stock market performance. The start of 2024 has been a bumpier ride, as the market switches between optimism and pessimism around rate cuts due to mixed inflation data, but engineered components and systems stocks have shown resilience, with share prices up 5.7% on average since the previous earnings results.\n\nRBC Bearings (NYSE:RBC)\n\nWith a Guinness World Record for engineering the largest spherical plain bearing, RBC Bearings (NYSE:RBC) is a manufacturer of bearings and related components for the aerospace & defense, industrial, and transportation industries.\n\nRBC Bearings reported revenues of $413.7 million, up 4.9% year on year, in line with analysts' expectations. Overall, it was a weaker quarter for the company with a miss of analysts' earnings estimates and a miss of analysts' Diversified Industrials revenue estimates.\n\n“Fiscal 2024 marked another record year for RBC and we expect to carry that momentum into fiscal 2025,” said Dr. Michael J. Hartnett, Chairman and Chief Executive Officer. RBC Bearings Total Revenue\n\nThe stock is up 6.1% since reporting and currently trades at $284.12.\n\nIs now the time to buy RBC Bearings? Access our full analysis of the earnings results here, it's free.\n\nBest Q1: Graham Corporation (NYSE:GHM)\n\nFounded when its founder patented a unique design for a vacuum system used in the sugar refining process, Graham (NYSE:GHM) provides vacuum and heat transfer equipment for the energy, petrochemical, refining, and chemical sectors.\n\nGraham Corporation reported revenues of $49.07 million, up 14% year on year, outperforming analysts' expectations by 10.3%. It was an incredible quarter for the company with an impressive beat of analysts' earnings estimates.\n\nStory continues Graham Corporation Total Revenue\n\nGraham Corporation pulled off the biggest analyst estimates beat among its peers. The market seems happy with the results as the stock is up 21.3% since reporting. It currently trades at $31.56.\n\nIs now the time to buy Graham Corporation? Access our full analysis of the earnings results here, it's free.\n\nWeakest Q1: Enpro (NYSE:NPO)\n\nHolding a Guinness World Record for creating the world's largest gasket, Enpro (NYSE:NPO) designs, manufactures, and sells products used for machinery in various industries.\n\nEnpro reported revenues of $257.5 million, down 8.9% year on year, falling short of analysts' expectations by 4.2%. It was a weak quarter for the company with a miss of analysts' earnings estimates.\n\nInterestingly, the stock is up 6.6% since the results and currently trades at $163.72.\n\nRead our full analysis of Enpro's results here.\n\nNN (NASDAQ:NNBR)\n\nFormerly known as Nuturn, NN (NASDAQGS:NNBR) provides metal components, bearings, and plastic and rubber components to the automotive, aerospace, medical, and industrial sectors.\n\nNN reported revenues of $121.2 million, down 4.6% year on year, in line with analysts' expectations. Overall, it was a weak quarter for the company with a miss of analysts' earnings estimates.\n\nThe stock is down 2.4% since reporting and currently trades at $3.71.\n\nRead our full, actionable report on NN here, it's free.\n\nArrow Electronics (NYSE:ARW)\n\nFounded as a single retail store, Arrow Electronics (NYSE:ARW) provides electronic components and enterprise computing solutions to businesses globally.\n\nArrow Electronics reported revenues of $6.92 billion, down 20.7% year on year, falling short of analysts' expectations by 1.7%. Taking a step back, it was a weak quarter for the company with a miss of analysts' Components revenue estimates.\n\nArrow Electronics had the slowest revenue growth among its peers. The stock is down 3.6% since reporting and currently trades at $120.47.\n\nRead our full, actionable report on Arrow Electronics here, it's free.\n\nJoin Paid Stock Investor Research\n\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.\n\nView comments",
        "link": "https://finance.yahoo.com/news/q1-earnings-highs-lows-rbc-074009880.html",
        "symbols": [
            "0HI1.LSE",
            "ARW.DU",
            "ARW.F",
            "ARW.MU",
            "ARW.STU",
            "ARW.US",
            "B1X.F",
            "GHC.US",
            "GHM.US",
            "NNBR.US",
            "NPO.US",
            "RB8.F",
            "RBC.US",
            "RRX.US",
            "WPOB.BE",
            "WPOB.DU",
            "WPOB.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.995,
            "neg": 0.048,
            "neu": 0.845,
            "pos": 0.107
        }
    },
    {
        "date": "2024-07-22T13:00:00+00:00",
        "title": "RBC Bearings to Webcast First Quarter Fiscal Year 2025 Earnings Conference Call August 2nd",
        "content": "Webcast is Live at 11:00 a.m. (ET)\n\nOXFORD, Conn., July 22, 2024--(BUSINESS WIRE)--RBC Bearings Incorporated (NYSE: RBC, RBCP), a leading international manufacturer of highly engineered precision bearings, components and essential systems for the industrial, defense and aerospace industries, today announced that it will release its first quarter fiscal 2025 financial results before the market opens on Friday, August 2nd. RBC Bearings will host a conference call to discuss the results on Friday, August 2nd at 11:00 a.m. ET.\n\nDr. Michael J. Hartnett, Chairman, President and Chief Executive Officer; Daniel A. Bergeron, Vice President and Chief Operating Officer; and Robert M. Sullivan, Vice President and Chief Financial Officer will recap the quarter’s results and accomplishments. To access the webcast, go to the investor relations portion of the Company’s website, www.rbcbearings.com, on the day of the conference call and click on the webcast link.\n\nIf you do not have access to the Internet and wish to listen to the call, dial 877-407-4019 (international callers dial +1 201-689-8337) and provide conference ID # 13747958. Investors are advised to dial into the call at least ten minutes prior to the call to register. An audio replay of the call will be available from 2:00 p.m. ET August 2nd, 2024, until 2:00 p.m. ET August 16th, 2024. The replay can be accessed by dialing 877-660-6853 (international callers dial +1 201-612-7415) and providing conference ID # 13747958.\n\nAbout RBC Bearings\n\nRBC Bearings Incorporated is an international manufacturer and marketer of highly engineered precision bearings, components and essential systems. Founded in 1919, the Company is primarily focused on producing highly technical or regulated bearing products and components requiring sophisticated design, testing, and manufacturing capabilities for the diversified industrial, aerospace and defense markets. The Company is headquartered in Oxford, Connecticut.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240722402048/en/\n\nContacts\n\nRob Moffatt\r\nDirector of Investor Relations\r\ninvestors@rbcbearings.com",
        "link": "https://finance.yahoo.com/news/rbc-bearings-webcast-first-quarter-130000767.html",
        "symbols": [
            "B1X.F",
            "RBC.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.743,
            "neg": 0.012,
            "neu": 0.95,
            "pos": 0.038
        }
    },
    {
        "date": "2024-07-19T07:51:46+00:00",
        "title": "Q1 Earnings Highlights: ESCO (NYSE:ESE) Vs The Rest Of The Engineered Components and Systems Stocks",
        "content": "Q1 Earnings Highlights: ESCO (NYSE:ESE) Vs The Rest Of The Engineered Components and Systems Stocks\n\nThe end of the earnings season is always a good time to take a step back and see who shined (and who not so much). Let’s take a look at how engineered components and systems stocks fared in Q1, starting with ESCO (NYSE:ESE).\n\nEngineered components and systems companies possess technical know-how in sometimes narrow areas such as metal forming or intelligent robotics. Lately, automation and connected equipment collecting analyzable data have been trending, creating new demand. On the other hand, like the broader industrials sector, engineered components and systems companies are at the whim of economic cycles. Consumer spending and interest rates, for example, can greatly impact the industrial production that drives demand for these companies’ offerings.\n\nThe 11 engineered components and systems stocks we track reported a slower Q1; on average, revenues were in line with analyst consensus estimates. Stocks, especially growth stocks where cash flows further in the future are more important to the story, had a good end of 2023. But the beginning of 2024 has seen more volatile stock performance due to mixed inflation data, but engineered components and systems stocks have shown resilience, with share prices up 5.9% on average since the previous earnings results.\n\nESCO (NYSE:ESE)\n\nA developer of the communication systems used in the Batmobile of “The Dark Knight,” ESCO (NYSE:ESE) is a provider of engineered components for the aerospace, defense, and utility sectors.\n\nESCO reported revenues of $249.1 million, up 8.7% year on year, in line with analysts' expectations. Overall, it was an ok quarter for the company with a decent beat of analysts' earnings estimates.\n\nBryan Sayler, Chief Executive Officer and President, commented, “Q2 was a solid quarter highlighted by both top and bottom-line growth. Revenue grew 9 percent as we continue to see favorable dynamics in our key aerospace, Navy and utility end markets. The sales performance translated to the bottom line very well as Adjusted EPS increased 24 percent compared to the prior year quarter.” ESCO Total Revenue\n\nThe stock is up 6.4% since reporting and currently trades at $118.58.\n\nIs now the time to buy ESCO? Access our full analysis of the earnings results here, it's free.\n\nBest Q1: Graham Corporation (NYSE:GHM)\n\nFounded when its founder patented a unique design for a vacuum system used in the sugar refining process, Graham (NYSE:GHM) provides vacuum and heat transfer equipment for the energy, petrochemical, refining, and chemical sectors.\n\nGraham Corporation reported revenues of $49.07 million, up 14% year on year, outperforming analysts' expectations by 10.3%. It was an incredible quarter for the company with an impressive beat of analysts' earnings estimates.\n\nStory continues Graham Corporation Total Revenue\n\nGraham Corporation delivered the biggest analyst estimates beat among its peers. The market seems happy with the results as the stock is up 14.7% since reporting. It currently trades at $29.85.\n\nIs now the time to buy Graham Corporation? Access our full analysis of the earnings results here, it's free.\n\nWeakest Q1: Enpro (NYSE:NPO)\n\nHolding a Guinness World Record for creating the world's largest gasket, Enpro (NYSE:NPO) designs, manufactures, and sells products used for machinery in various industries.\n\nEnpro reported revenues of $257.5 million, down 8.9% year on year, falling short of analysts' expectations by 4.2%. It was a weak quarter for the company with a miss of analysts' earnings estimates.\n\nInterestingly, the stock is up 5.5% since the results and currently trades at $161.99.\n\nRead our full analysis of Enpro's results here.\n\nApplied Industrial (NYSE:AIT)\n\nFormerly called The Ohio Ball Bearing Company, Applied Industrial Technologies (NYSE:AIT) distributes industrial products–everything from power tools to industrial valves–and services to a wide variety of industries.\n\nApplied Industrial reported revenues of $1.15 billion, up 1.3% year on year, surpassing analysts' expectations by 1.3%. Zooming out, it was an ok quarter for the company with a narrow beat of analysts' organic revenue estimates but a miss of analysts' earnings estimates.\n\nThe stock is up 11.6% since reporting and currently trades at $207.55.\n\nRead our full, actionable report on Applied Industrial here, it's free.\n\nRBC Bearings (NYSE:RBC)\n\nWith a Guinness World Record for engineering the largest spherical plain bearing, RBC Bearings (NYSE:RBC) is a manufacturer of bearings and related components for the aerospace & defense, industrial, and transportation industries.\n\nRBC Bearings reported revenues of $413.7 million, up 4.9% year on year, in line with analysts' expectations. Overall, it was a weaker quarter for the company with a miss of analysts' earnings estimates.\n\nThe stock is up 9.2% since reporting and currently trades at $292.21.\n\nRead our full, actionable report on RBC Bearings here, it's free.\n\nJoin Paid Stock Investor Research\n\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.",
        "link": "https://finance.yahoo.com/news/q1-earnings-highlights-esco-nyse-075146293.html",
        "symbols": [
            "AIT.US",
            "ESE.US",
            "GHC.US",
            "GHM.US",
            "NPO.US",
            "RBC.US",
            "WPOB.BE",
            "WPOB.DU",
            "WPOB.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.026,
            "neu": 0.844,
            "pos": 0.13
        }
    },
    {
        "date": "2024-07-11T13:00:09+00:00",
        "title": "How to Find Strong Industrial Products Stocks Slated for Positive Earnings Surprises",
        "content": "Quarterly financial reports play a vital role on Wall Street, as they help investors see how a company has performed and what might be coming down the road in the near-term. And out of all of the metrics and results to consider, earnings is one of the most important.\n\nWe know earnings results are vital, but how a company performs compared to bottom line expectations can be even more important when it comes to stock prices, especially in the near-term. This means that investors might want to take advantage of these earnings surprises.\n\n2 Stocks to Add to Your Watchlist\n\nThe Zacks Earnings ESP, or Expected Surprise Prediction, aims to find earnings surprises by focusing on the most recent analyst revisions. The basic premise is that if an analyst reevaluates their earnings estimate ahead of an earnings release, it means they likely have new information that could possibly be more accurate. The core of the ESP model is comparing the Most Accurate Estimate to the Zacks Consensus Estimate, where the resulting percentage difference between the two equals the Expected Surprise Prediction.\n\nThe final step today is to look at a stock that meets our ESP qualifications. RBC Bearings (RBC) earns a Zacks Rank #3 22 days from its next quarterly earnings release on August 2, 2024, and its Most Accurate Estimate comes in at $2.43 a share.\n\nBy taking the percentage difference between the $2.43 Most Accurate Estimate and the $2.37 Zacks Consensus Estimate, RBC Bearings has an Earnings ESP of 2.42%.\n\nRBC is part of a big group of Industrial Products stocks that boast a positive ESP, and investors may want to take a look at Atmus Filtration Technologies (ATMU) as well.\n\nAtmus Filtration Technologies, which is readying to report earnings on August 14, 2024, sits at a Zacks Rank #3 (Hold) right now. It's Most Accurate Estimate is currently $0.61 a share, and ATMU is 34 days out from its next earnings report.\n\nFor Atmus Filtration Technologies, the percentage difference between its Most Accurate Estimate and its Zacks Consensus Estimate of $0.58 is 5.63%.\n\nRBC and ATMU's positive ESP figures tell us that both stocks have a good chance at beating analyst expectations in their next earnings report.\n\nFind Stocks to Buy or Sell Before They're Reported\n\nUse the Zacks Earnings ESP Filter to turn up stocks with the highest probability of positively, or negatively, surprising to buy or sell before they're reported for profitable earnings season trading. Check it out here >>\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nStory continues\n\nRBC Bearings Incorporated (RBC) : Free Stock Analysis Report\n\nAtmus Filtration Technologies Inc. (ATMU) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/strong-industrial-products-stocks-slated-130009740.html",
        "symbols": [
            "B1X.F",
            "RB8.F",
            "RBC.US",
            "RRX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.008,
            "neu": 0.84,
            "pos": 0.152
        }
    },
    {
        "date": "2024-07-09T14:17:00+00:00",
        "title": "Reasons to Hold RBC Bearings (RBC) in Your Portfolio Now",
        "content": "RBC Bearings Incorporated RBC has been witnessing solid momentum in its Aerospace & Defense segment. Revenues from the segment increased 16.8% year over year in the fourth quarter of fiscal 2024 (ended March 2024). Strength in the commercial aerospace market, driven by the recovery in build rates from large OEMs (original equipment manufacturers), and stability in the aftermarket are driving the segment’s performance.\r\n\r\nStrong U.S. & international defense budgets and robust demand for commercial air travel will augur well for the Aerospace & Defense segment in the quarters ahead. For the first quarter of fiscal 2025 (ended June 2024, results awaited), RBC anticipates overall net sales in the band of $415-$420 million, suggesting year-over-year growth of 7.2-8.5%.\r\n\r\nThe company believes in adding complementary businesses to its portfolio via acquisitions. For instance, in August 2023, it acquired Carson City, NV-based precision bearings manufacturer Specline. The unique bearing and manufacturing processes of Specline expanded RBC’s aerospace product offerings and boosted the company’s production capacity.\r\n\r\nRBC Bearings focuses on rewarding its shareholders handsomely through dividend payouts and share buybacks. In fiscal 2024, it paid dividends worth $22.9 million, flat compared with the previous fiscal year. Also, it repurchased shares for $11 million, reflecting an increase of 41.4% year over year. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nIn the past year, shares of this Zacks Rank #3 (Hold) company have risen 27.5% compared with the industry’s 12.8% growth.\r\n\r\nHowever, RBC Bearings has been dealing with the rising cost of sales for some time now. In the fourth quarter of fiscal 2024, the company’s cost of sales rose 3.2% year over year due to an increase in raw material costs. Also, selling, general and administrative expenses escalated 8.1% year over year in the same period due to higher personnel, freight and IT-related costs and other professional fees.\n\nStocks to Consider\n\nSome better-ranked companies from the same space are discussed below:\r\n\r\nApplied Industrial Technologies, Inc. AIT presently sports a Zacks Rank #1 (Strong Buy). It has a trailing four-quarter average earnings surprise of 8.2%. You can see the complete list of today’s Zacks #1 Rank stocks here.\r\n\r\nThe Zacks Consensus Estimate for AIT’s fiscal 2024 earnings has improved 0.9% in the past 60 days. The stock has risen 28.9% in the past year.\r\n\r\nFlowserve Corporation FLS presently sports a Zacks Rank #1 and has a trailing four-quarter earnings surprise of 21.7%, on average.\r\n\r\nThe consensus estimate for FLS’ 2024 earnings has increased 0.8% in the past 60 days. Shares of Flowserve have rallied 23.7% in the past year.\r\n\r\nIngersoll Rand Inc. IR presently carries a Zacks Rank of 2 (Buy). IR delivered a trailing four-quarter earnings surprise of 12.9%, on average.\r\n\r\nThe Zacks Consensus Estimate for Ingersoll Rand’s 2024 earnings has increased 2.2% in the past 60 days. Its shares have risen 39.9% in the past year.\n\nStory continues\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nRBC Bearings Incorporated (RBC) : Free Stock Analysis Report\n\nFlowserve Corporation (FLS) : Free Stock Analysis Report\n\nApplied Industrial Technologies, Inc. (AIT) : Free Stock Analysis Report\n\nIngersoll Rand Inc. (IR) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/reasons-hold-rbc-bearings-rbc-141700710.html",
        "symbols": [
            "0IQE.LSE",
            "2IS.BE",
            "2IS.F",
            "2IS.MU",
            "5GD.F",
            "B1X.F",
            "FLS.US",
            "FWV.F",
            "FWV.MU",
            "FWV.STU",
            "IR.US",
            "RB8.F",
            "RBC.US",
            "RRX.US",
            "TT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.003,
            "neu": 0.855,
            "pos": 0.142
        }
    },
    {
        "date": "2024-07-07T14:27:58+00:00",
        "title": "Should Weakness in RBC Bearings Incorporated's (NYSE:RBC) Stock Be Seen As A Sign That Market Will Correct The Share Price Given Decent Financials?",
        "content": "It is hard to get excited after looking at RBC Bearings' (NYSE:RBC) recent performance, when its stock has declined 2.4% over the past month. However, stock prices are usually driven by a company’s financials over the long term, which in this case look pretty respectable. In this article, we decided to focus on RBC Bearings'  ROE.\n\nReturn on equity or ROE is an important factor to be considered by a shareholder because it tells them how effectively their capital is being reinvested. In short, ROE shows the profit each dollar generates with respect to its shareholder investments.\n\nView our latest analysis for RBC Bearings\n\nHow To Calculate Return On Equity?\n\nThe formula for ROE is:\n\nReturn on Equity = Net Profit (from continuing operations) ÷ Shareholders' Equity\n\nSo, based on the above formula, the ROE for RBC Bearings is:\n\n7.6% = US$210m ÷ US$2.8b (Based on the trailing twelve months to March 2024).\n\nThe 'return' is the income the business earned over the last year. That means that for every $1 worth of shareholders' equity, the company generated $0.08 in profit.\n\nWhat Is The Relationship Between ROE And Earnings Growth?\n\nSo far, we've learned that ROE is a measure of a company's profitability. Based on how much of its profits the company chooses to reinvest or \"retain\", we are then able to evaluate a company's future ability to generate profits. Assuming all else is equal, companies that have both a higher return on equity and higher profit retention are usually the ones that have a higher growth rate when compared to companies that don't have the same features.\n\nRBC Bearings' Earnings Growth And 7.6% ROE\n\nWhen you first look at it, RBC Bearings' ROE doesn't look that attractive. A quick further study shows that the company's ROE doesn't compare favorably to the industry average of 14% either. RBC Bearings was still able to see a decent net income growth of 8.9% over the past five years. So, there might be other aspects that are positively influencing the company's earnings growth. For example, it is possible that the company's management has made some good strategic decisions, or that the company has a low payout ratio.\n\nNext, on comparing RBC Bearings' net income growth with the industry, we found that the company's reported growth is similar to the industry average growth rate of 8.9% over the last few years. past-earnings-growth\n\nThe basis for attaching value to a company is, to a great extent, tied to its earnings growth. It’s important for an investor to know whether the market has priced in the company's expected earnings growth (or decline). By doing so, they will have an idea if the stock is headed into clear blue waters or if swampy waters await. If you're wondering about RBC Bearings''s valuation, check out this gauge of its price-to-earnings ratio, as compared to its industry.\n\nStory continues\n\nIs RBC Bearings Making Efficient Use Of Its Profits?\n\nRBC Bearings doesn't pay any regular dividends currently which essentially means that it has been reinvesting all of its profits into the business. This definitely contributes to the decent earnings growth number that we discussed above.\n\nConclusion\n\nIn total, it does look like RBC Bearings has some positive aspects to its business. Despite its low rate of return, the fact that the company reinvests a very high portion of its profits into its business, no doubt contributed to its high earnings growth. With that said, the latest industry analyst forecasts reveal that the company's earnings are expected to accelerate. To know more about the company's future earnings growth forecasts take a look at this freereport on analyst forecasts for the company to find out more.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nView comments",
        "link": "https://finance.yahoo.com/news/weakness-rbc-bearings-incorporateds-nyse-142758089.html",
        "symbols": [
            "B1X.F",
            "RBC.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.018,
            "neu": 0.835,
            "pos": 0.148
        }
    },
    {
        "date": "2024-07-05T10:29:09+00:00",
        "title": "Engineered Components and Systems Stocks Q1 Recap: Benchmarking Regal Rexnord (NYSE:RRX)",
        "content": "Engineered Components and Systems Stocks Q1 Recap: Benchmarking Regal Rexnord (NYSE:RRX)\n\nAs the Q1 earnings season wraps, let's dig into this quarter's best and worst performers in the engineered components and systems industry, including Regal Rexnord (NYSE:RRX) and its peers.\n\nEngineered components and systems companies possess technical know-how in sometimes narrow areas such as metal forming or intelligent robotics. Lately, automation and connected equipment collecting analyzable data have been trending, creating new demand. On the other hand, like the broader industrials sector, engineered components and systems companies are at the whim of economic cycles. Consumer spending and interest rates, for example, can greatly impact the industrial production that drives demand for these companies’ offerings.\n\nThe 8 engineered components and systems stocks we track reported a mixed Q1; on average, revenues were in line with analyst consensus estimates. Inflation progressed towards the Fed's 2% goal at the end of 2023, leading to strong stock market performance. The start of 2024 has been a bumpier ride, as the market switches between optimism and pessimism around rate cuts due to mixed inflation data, and while some of the engineered components and systems stocks have fared somewhat better than others, they collectively declined, with share prices falling 0.7% on average since the previous earnings results.\n\nRegal Rexnord (NYSE:RRX)\n\nBearing a century of engineering and optimization experience, Regal Rexnord (NYSE:RRX) provides power transmission and industrial automation solutions.\n\nRegal Rexnord reported revenues of $1.55 billion, up 26.4% year on year, falling short of analysts' expectations by 1.4%. It was a weaker quarter for the company, with a miss of analysts' organic revenue estimates. Regal Rexnord Total Revenue\n\nRegal Rexnord pulled off the fastest revenue growth of the whole group. The stock is down 19.6% since the results and currently trades at $135.65.\n\nRead our full report on Regal Rexnord here, it's free.\n\nBest Q1: Graham Corporation (NYSE:GHM)\n\nFounded when its founder patented a unique design for a vacuum system used in the sugar refining process, Graham (NYSE:GHM) provides vacuum and heat transfer equipment for the energy, petrochemical, refining, and chemical sectors.\n\nGraham Corporation reported revenues of $49.07 million, up 14% year on year, outperforming analysts' expectations by 10.3%. It was an incredible quarter for the company, with revenue and EPS exceeding analysts' estimates. Graham Corporation Total Revenue\n\nGraham Corporation delivered the biggest analyst estimates beat among its peers. The stock is up 10.1% since the results and currently trades at $28.64.\n\nStory continues\n\nIs now the time to buy Graham Corporation? Access our full analysis of the earnings results here, it's free.\n\nWeakest Q1: Arrow Electronics (NYSE:ARW)\n\nFounded as a single retail store, Arrow Electronics (NYSE:ARW) provides electronic components and enterprise computing solutions to businesses globally.\n\nArrow Electronics reported revenues of $6.92 billion, down 20.7% year on year, falling short of analysts' expectations by 1.7%. It was a weak quarter for the company, with a miss of analysts' Components revenue estimates.\n\nArrow Electronics had the slowest revenue growth in the group. The stock is down 4.3% since the results and currently trades at $119.58.\n\nRead our full analysis of Arrow Electronics's results here.\n\nMayville Engineering (NYSE:MEC)\n\nOriginally founded solely on tool and die manufacturing, Mayville Engineering Company (NYSE:MEC) specializes in metal fabrication, tube bending, and welding to be used in various industries.\n\nMayville Engineering reported revenues of $161.3 million, up 13.1% year on year, in line with analysts' expectations. It was a decent quarter for the company, with an impressive beat of analysts' earnings estimates but underwhelming EBITDA guidance for the full year.\n\nThe stock is up 19.8% since the results and currently trades at $16.39.\n\nRead our full, actionable report on Mayville Engineering here, it's free.\n\nRBC Bearings (NYSE:RBC)\n\nWith a Guinness World Record for engineering the largest spherical plain bearing, RBC Bearings (NYSE:RBC) is a manufacturer of bearings and related components for the aerospace & defense, industrial, and transportation industries.\n\nRBC Bearings reported revenues of $413.7 million, up 4.9% year on year, falling short of analysts' expectations by 0.1%. It was a mixed quarter for the company, with a miss of analysts' earnings estimates and in line with analysts' Diversified Industrials revenue estimates.\n\nThe stock is up 2.3% since the results and currently trades at $273.95.\n\nRead our full, actionable report on RBC Bearings here, it's free.\n\nJoin Paid Stock Investor Research\n\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.\n\nView comments",
        "link": "https://finance.yahoo.com/news/engineered-components-systems-stocks-q1-102909267.html",
        "symbols": [
            "0HI1.LSE",
            "ARW.DU",
            "ARW.F",
            "ARW.MU",
            "ARW.STU",
            "ARW.US",
            "GHC.US",
            "GHM.US",
            "MEC.US",
            "RBC.US",
            "RRX.US",
            "WPOB.BE",
            "WPOB.DU",
            "WPOB.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.991,
            "neg": 0.035,
            "neu": 0.877,
            "pos": 0.088
        }
    },
    {
        "date": "2024-07-03T08:55:46+00:00",
        "title": "Q1 Earnings Outperformers: Applied Industrial (NYSE:AIT) And The Rest Of The Engineered Components and Systems Stocks",
        "content": "Q1 Earnings Outperformers: Applied Industrial (NYSE:AIT) And The Rest Of The Engineered Components and Systems Stocks\n\nAs the Q1 earnings season wraps, let's dig into this quarter's best and worst performers in the engineered components and systems industry, including Applied Industrial (NYSE:AIT) and its peers.\n\nEngineered components and systems companies possess technical know-how in sometimes narrow areas such as metal forming or intelligent robotics. Lately, automation and connected equipment collecting analyzable data have been trending, creating new demand. On the other hand, like the broader industrials sector, engineered components and systems companies are at the whim of economic cycles. Consumer spending and interest rates, for example, can greatly impact the industrial production that drives demand for these companies’ offerings.\n\nThe 8 engineered components and systems stocks we track reported a slower Q1; on average, revenues were in line with analyst consensus estimates. Stocks, especially growth stocks where cash flows further in the future are more important to the story, had a good end of 2023. But the beginning of 2024 has seen more volatile stock performance due to mixed inflation data, and while some of the engineered components and systems stocks have fared somewhat better than others, they collectively declined, with share prices falling 1.2% on average since the previous earnings results.\n\nApplied Industrial (NYSE:AIT)\n\nFormerly called The Ohio Ball Bearing Company, Applied Industrial Technologies (NYSE:AIT) distributes industrial products–everything from power tools to industrial valves–and services to a wide variety of industries.\n\nApplied Industrial reported revenues of $1.15 billion, up 1.3% year on year, topping analysts' expectations by 1.3%. It was a slower quarter for the company, with a miss of analysts' earnings estimates.\n\nNeil A. Schrimsher, Applied’s President & Chief Executive Officer, commented, “Third quarter sales exceeded our expectations with the year-over-year trend gradually improving as the quarter progressed...” Applied Industrial Total Revenue\n\nThe stock is up 3.2% since the results and currently trades at $191.93.\n\nIs now the time to buy Applied Industrial? Access our full analysis of the earnings results here, it's free.\n\nBest Q1: Graham Corporation (NYSE:GHM)\n\nFounded when its founder patented a unique design for a vacuum system used in the sugar refining process, Graham (NYSE:GHM) provides vacuum and heat transfer equipment for the energy, petrochemical, refining, and chemical sectors.\n\nGraham Corporation reported revenues of $49.07 million, up 14% year on year, outperforming analysts' expectations by 10.3%. It was an incredible quarter for the company, with an impressive beat of analysts' earnings estimates.\n\nStory continues Graham Corporation Total Revenue\n\nGraham Corporation pulled off the biggest analyst estimates beat among its peers. The stock is up 9.2% since the results and currently trades at $28.42.\n\nIs now the time to buy Graham Corporation? Access our full analysis of the earnings results here, it's free.\n\nWeakest Q1: Arrow Electronics (NYSE:ARW)\n\nFounded as a single retail store, Arrow Electronics (NYSE:ARW) provides electronic components and enterprise computing solutions to businesses globally.\n\nArrow Electronics reported revenues of $6.92 billion, down 20.7% year on year, falling short of analysts' expectations by 1.7%. It was a weak quarter for the company, with a miss of analysts' revenue estimates.\n\nArrow Electronics had the slowest revenue growth in the group. The stock is down 4.4% since the results and currently trades at $119.39.\n\nRead our full analysis of Arrow Electronics's results here.\n\nMayville Engineering (NYSE:MEC)\n\nOriginally founded solely on tool and die manufacturing, Mayville Engineering Company (NYSE:MEC) specializes in metal fabrication, tube bending, and welding to be used in various industries.\n\nMayville Engineering reported revenues of $161.3 million, up 13.1% year on year, in line with analysts' expectations. It was a solid quarter for the company, with an impressive beat of analysts' earnings estimates.\n\nThe stock is up 18.1% since the results and currently trades at $16.16.\n\nRead our full, actionable report on Mayville Engineering here, it's free.\n\nRBC Bearings (NYSE:RBC)\n\nWith a Guinness World Record for engineering the largest spherical plain bearing, RBC Bearings (NYSE:RBC) is a manufacturer of bearings and related components for the aerospace & defense, industrial, and transportation industries.\n\nRBC Bearings reported revenues of $413.7 million, up 4.9% year on year, falling short of analysts' expectations by 0.1%. It was a mixed quarter for the company, with a miss of analysts' earnings estimates.\n\nThe stock is up 1.1% since the results and currently trades at $270.75.\n\nRead our full, actionable report on RBC Bearings here, it's free.\n\nJoin Paid Stock Investor Research\n\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.\n\nView comments",
        "link": "https://finance.yahoo.com/news/q1-earnings-outperformers-applied-industrial-085546746.html",
        "symbols": [
            "0HI1.LSE",
            "AIT.US",
            "ARW.DU",
            "ARW.F",
            "ARW.MU",
            "ARW.STU",
            "ARW.US",
            "AT4.BE",
            "AT4.F",
            "GHC.US",
            "GHM.US",
            "MEC.US",
            "RBC.US",
            "WPOB.BE",
            "WPOB.DU",
            "WPOB.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.994,
            "neg": 0.033,
            "neu": 0.867,
            "pos": 0.099
        }
    },
    {
        "date": "2024-06-20T15:11:53+00:00",
        "title": "Here's Why RBC Bearings (NYSE:RBC) Has Caught The Eye Of Investors",
        "content": "For beginners, it can seem like a good idea (and an exciting prospect) to buy a company that tells a good story to investors, even if it currently lacks a track record of revenue and profit. But the reality is that when a company loses money each year, for long enough, its investors will usually take their share of those losses. Loss-making companies are always racing against time to reach financial sustainability, so investors in these companies may be taking on more risk than they should.\n\nDespite being in the age of tech-stock blue-sky investing, many investors still adopt a more traditional strategy; buying shares in profitable companies like RBC Bearings (NYSE:RBC). Now this is not to say that the company presents the best investment opportunity around, but profitability is a key component to success in business.\n\nSee our latest analysis for RBC Bearings\n\nHow Quickly Is RBC Bearings Increasing Earnings Per Share?\n\nThe market is a voting machine in the short term, but a weighing machine in the long term, so you'd expect share price to follow earnings per share (EPS) outcomes eventually. That makes EPS growth an attractive quality for any company. Shareholders will be happy to know that RBC Bearings' EPS has grown 21% each year, compound, over three years. If the company can sustain that sort of growth, we'd expect shareholders to come away satisfied.\n\nTop-line growth is a great indicator that growth is sustainable, and combined with a high earnings before interest and taxation (EBIT) margin, it's a great way for a company to maintain a competitive advantage in the market. While we note RBC Bearings achieved similar EBIT margins to last year, revenue grew by a solid 6.2% to US$1.6b. That's encouraging news for the company!\n\nThe chart below shows how the company's bottom and top lines have progressed over time. To see the actual numbers, click on the chart. earnings-and-revenue-history\n\nIn investing, as in life, the future matters more than the past. So why not check out this freeinteractive visualization of RBC Bearings' forecast profits?\n\nAre RBC Bearings Insiders Aligned With All Shareholders?\n\nOwing to the size of RBC Bearings, we wouldn't expect insiders to hold a significant proportion of the company. But thanks to their investment in the company, it's pleasing to see that there are still incentives to align their actions with the shareholders. Notably, they have an enviable stake in the company, worth US$143m. Holders should find this level of insider commitment quite encouraging, since it would ensure that the leaders of the company would also experience their success, or failure, with the stock.\n\nStory continues\n\nShould You Add RBC Bearings To Your Watchlist?\n\nFor growth investors, RBC Bearings' raw rate of earnings growth is a beacon in the night. With EPS growth rates like that, it's hardly surprising to see company higher-ups place confidence in the company through continuing to hold a significant investment. On the balance of its merits, solid EPS growth and company insiders who are aligned with the shareholders would indicate a business that is worthy of further research. Don't forget that there may still be risks. For instance, we've identified  2 warning signs for RBC Bearings that you should be aware of.\n\nWhile opting for stocks without growing earnings and absent insider buying can yield results, for investors valuing these key metrics, here is a carefully selected list of companies in the US with promising growth potential and insider confidence.\n\nPlease note the insider transactions discussed in this article refer to reportable transactions in the relevant jurisdiction.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nView comments",
        "link": "https://finance.yahoo.com/news/heres-why-rbc-bearings-nyse-151153852.html",
        "symbols": [
            "B1X.F",
            "RBC.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.024,
            "neu": 0.75,
            "pos": 0.226
        }
    },
    {
        "date": "2024-06-10T15:41:00+00:00",
        "title": "Here's Why Hold Strategy is Apt for RBC Bearings (RBC) Stock",
        "content": "RBC Bearings Incorporated RBC is poised to gain from strength in the Aerospace/Defense segment and accretive acquisitions despite softness in the Industrial Segment and the rising cost of sales.\n\nWhat’s Aiding RBC?\n\nBusiness Strength: RBC Bearings is benefiting from the strong performance of the Aerospace/Defense segment. Strength in commercial aerospace, driven by the recovery in build rates from large OEMs (original equipment manufacturer), and stability in the aftermarket are driving the segment. Rising U.S. & international defense budgets and robust demand for commercial air travel will augur well for the segment in the quarters ahead. For the first quarter of fiscal 2025 (ending June 2024), RBC Bearings anticipates net sales in the range of $415-$420 million, indicating a year-over-year increase of 7.2-8.5%.\r\n\r\nExpansion Efforts: RBC has expanded its reach with the acquisition of Carson City, NV-based precision bearings manufacturer Specline, Inc. in August 2023. Specline’s unique bearing and manufacturing processes expanded RBC Bearings’ aerospace product offerings and boosted the production capacity.\r\n\r\nRewards to Shareholders: RBC Bearings remains committed to rewarding its shareholders handsomely through share buyback programs. In fiscal 2024 (ended March 2024), the company paid dividends of $22.9 million, almost flat year over year, and repurchased shares for $11 million, which increased 41.4% year over year.\r\n\r\nIn light of the above-mentioned positives, we believe investors should retain RBC stock for now, as suggested by its Zacks Rank #3 (Hold). In the past year, shares of the company have gained 32.8% compared with the industry’s 17.5% growth. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nStocks to Consider\n\nSome better-ranked companies from the Industrial Products sector are discussed below.\r\n\r\nBelden Inc. BDC presently sports a Zacks Rank #1 (Strong Buy) and has a trailing four-quarter earnings surprise of 14.7%, on average. You can see the complete list of today’s Zacks #1 Rank stocks here.\r\n\r\nThe consensus estimate for BDC’s 2024 earnings has increased 8.3% in the past 60 days. Shares of Belden have gained 0.3% in the past year.\r\n\r\nApplied Industrial Technologies, Inc. AIT presently carries a Zacks Rank #2 (Buy). It has a trailing four-quarter average earnings surprise of 8.2%.\r\n\r\nThe consensus estimate for AIT’s fiscal 2024 earnings has improved 1.4% in the past 60 days. The stock has gained 37.8% in the past year.\r\n\r\nCrane Company CR presently carries a Zacks Rank of 2. CR delivered a trailing four-quarter earnings surprise of 15.2%, on average.\r\n\r\nThe Zacks Consensus Estimate for CR’s 2024 earnings has increased 4% in the past 60 days. Its shares have gained 79.2% in the past year.\n\nStory continues\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nRBC Bearings Incorporated (RBC) : Free Stock Analysis Report\n\nApplied Industrial Technologies, Inc. (AIT) : Free Stock Analysis Report\n\nBelden Inc (BDC) : Free Stock Analysis Report\n\nCrane Company (CR) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/heres-why-hold-strategy-apt-154100801.html",
        "symbols": [
            "B1X.F",
            "BDC.US",
            "QCTA.F",
            "RB8.F",
            "RBC.US",
            "RRX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.003,
            "neu": 0.808,
            "pos": 0.189
        }
    },
    {
        "date": "2024-05-20T13:41:00+00:00",
        "title": "Company News for May 20, 2024",
        "content": "Shares of RBC Bearings Incorporated (RBC) jumped 8.1% after the company reported fourth-quarter fiscal 2024 earnings of $2.47 per share, beating the Zacks Consensus Estimate of $2.32 per share. Flowers Foods, Inc.’s (FLO) shares declined 4.1% after the company reported first-quarter fiscal 2024 earnings of $0.38 per share, missing the Zacks Consensus Estimate of $0.40 per share. Shares of Doximity, Inc. (DOCS) soared 18.1% after the company reported fourth-quarter fiscal 2024 earnings of $0.25 per share, surpassing the Zacks Consensus Estimate of $0.20 per share. GameStop Corp.’s (GME) shares plunged 19.7% after the company announced that it plans to sell 45 million common stocks in shares.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nRBC Bearings Incorporated (RBC) : Free Stock Analysis Report\n\nGameStop Corp. (GME) : Free Stock Analysis Report\n\nFlowers Foods, Inc. (FLO) : Free Stock Analysis Report\n\nDoximity, Inc. (DOCS) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/company-news-may-20-2024-134100083.html",
        "symbols": [
            "B1X.F",
            "DOCS.US",
            "GME.US",
            "GS2C.F",
            "GS2C.STU",
            "RB8.F",
            "RBC.US",
            "RRX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.986,
            "neg": 0.026,
            "neu": 0.763,
            "pos": 0.211
        }
    },
    {
        "date": "2024-05-17T12:00:00+00:00",
        "title": "RBC Bearings Incorporated Announces Fiscal Fourth Quarter and Full Year 2024 Results",
        "content": "OXFORD, Conn., May 17, 2024--(BUSINESS WIRE)--RBC Bearings Incorporated (NYSE: RBC, RBCP), a leading international manufacturer of highly engineered precision bearings, components and essential systems for the industrial, defense and aerospace industries, today reported results for the fourth quarter and full year fiscal 2024.\n\nFourth Quarter Financial Highlights\n\nFourth quarter net sales of $413.7 million increased 4.9% over last year, Aerospace/Defense up 16.8% and Industrial down 0.4%.\n\nGross margin of 43.1% for the fourth quarter of fiscal 2024 compared to 42.2% last year.\n\nFourth quarter net income attributable to common stockholders as a percentage of net sales of 13.5% vs 11.0% last year; Adjusted EBITDA as a percentage of net sales of 31.4% vs 30.7% last year.\n\nFourth quarter free cash flow conversion of 113.3% vs 120.0% last year.\n\nThree Month Financial Highlights\n\n($ in millions) Fiscal 2024 Fiscal 2023 Change GAAP Adjusted (1) GAAP Adjusted (1) GAAP Adjusted (1) Net sales $413.7 $394.4 4.9% Gross margin $178.3 $178.3 $166.5 $166.6 7.1% 7.0% Gross margin % 43.1% 43.1% 42.2% 42.2% Operating income $94.2 $96.3 $86.1 $88.6 9.3% 8.6% Operating income % 22.8% 23.3% 21.8% 22.5% Net income $61.6 $78.0 $49.2 $67.7 25.5% 15.3% Net income attributable to common stockholders $55.9 $72.4 $43.4 $61.9 29.0% 16.8% Diluted EPS $1.91 $2.47 $1.49 $2.13 28.2% 16.0% (1) Results exclude items in reconciliation below.\n\nFiscal 2024 Financial Highlights\n\nFiscal 2024 net sales of $1,560.3 million increased 6.2% over last year, Aerospace/Defense up 20.7% and Industrial up 0.2%.\n\nGross margin of 43.0% for fiscal 2024 compared to 41.2% last year.\n\nFiscal 2024 net income attributable to common stockholders as a percentage of net sales of 12.0% vs 9.8% last year; Adjusted EBITDA as a percentage of net sales of 30.9% vs 29.5% last year.\n\nFree cash flow conversion of 115.0% in fiscal 2024 vs 107.2% in fiscal 2023.\n\nTwelve Month Financial Highlights\n\n($ in millions) Fiscal 2024 Fiscal 2023 Change GAAP Adjusted (1) GAAP Adjusted (1) GAAP Adjusted (1) Net sales $1,560.3 $1,469.3 6.2% Gross margin $670.5 $670.8 $604.8 $604.9 10.9% 10.9% Gross margin % 43.0% 43.0% 41.2% 41.2% Operating income $342.2 $345.5 $293.0 $304.6 16.8% 13.4% Operating income % 21.9% 22.1% 19.9% 20.7% Net income $209.9 $274.6 $166.7 $240.5 25.9% 14.2% Net income attributable to common stockholders $186.9 $251.7 $143.8 $217.6 30.1% 15.7% Diluted EPS $6.41 $8.62 $4.94 $7.48 29.8% 15.2% (1) Results exclude items in reconciliation below.\n\n\"Fiscal 2024 marked another record year for RBC and we expect to carry that momentum into fiscal 2025,\" said Dr. Michael J. Hartnett, Chairman and Chief Executive Officer. \"Our Aerospace and Defense segment continued its strong secular growth with revenues expanding 20.7% in the year, and our Industrial segment continued to outpace broader industry trends with notable outgrowth relative to peers. We also delivered healthy margin expansion fueled by operating efficiencies and ongoing Dodge synergies coupled with record levels of free cash flow generation, which was used to further reduce debt to a post-Dodge low. We look to another year of strong free cash flow generation and debt reduction, with the Company poised to finish Fiscal 2025 with net leverage nicely below 2.0x.\"\n\nStory continues\n\nFourth Quarter Results\n\nNet sales for the fourth quarter of fiscal 2024 were $413.7 million, an increase of 4.9% from $394.4 million in the fourth quarter of fiscal 2023. Net sales for the Industrial segment decreased 0.4%, while net sales for the Aerospace/Defense segment increased 16.8%. Gross margin for the fourth quarter of fiscal 2024 was $178.3 million compared to $166.5 million for the same period last year.\n\nSG&A for the fourth quarter of fiscal 2024 was $64.4 million, an increase of $4.8 million from $59.6 million for the same period last year. As a percentage of net sales, SG&A was 15.6% for the fourth quarter of fiscal 2024 compared to 15.1% for the same period last year.\n\nOther operating expenses for the fourth quarter of fiscal 2024 totaled $19.7 million compared to $20.7 million for the same period last year. For the fourth quarter of fiscal 2024, other operating expenses included $17.7 million of amortization of intangible assets, $2.0 million of restructuring costs and $0.1 million of acquisition costs offset by $0.1 million of other income items. For the fourth quarter of fiscal 2023, other operating expenses included $17.7 million of amortization of intangible assets, $2.5 million of restructuring costs, and $0.5 million of other items.\n\nOperating income for the fourth quarter of fiscal 2024 was $94.2 million compared to $86.1 million for the same period last year. On an adjusted basis, operating income was $96.3 million for the fourth quarter of fiscal 2024 compared to $88.6 million for the same period last year. Refer to the tables below for details on the adjustments made to operating income to arrive at adjusted operating income.\n\nInterest expense, net, was $18.8 million for the fourth quarter of fiscal 2024 compared to $21.7 million for the same period last year.\n\nIncome tax expense for the fourth quarter of fiscal 2024 was $12.5 million compared to $11.2 million for the same period last year. The effective income tax rate for the fourth quarter of fiscal 2024 was 16.8% compared to 18.5% for the same period last year. The effective income tax rate for the three-month period ended March 30, 2024 of 16.8% included $5.9 million of discrete tax benefits associated with stock-based compensation windfalls, a reduction in unrecognized tax benefits due to the expiration of the statute of limitations, and the accrual of deferred tax assets related to state tax modifications; the effective income tax rate without these net benefits would have been 24.7%. The effective income tax rate for the three-month period ended April 1, 2023 of 18.5% included $1.9 million of discrete tax benefits associated with stock-based compensation and other items; the effective income tax rate without these benefits would have been 21.7%.\n\nNet income for the fourth quarter of fiscal 2024 was $61.6 million compared to $49.2 million for the same period last year. On an adjusted basis, net income was $78.0 million for the fourth quarter of fiscal 2024 compared to $67.7 million for the same period last year. Refer to the tables below for details on the adjustments made to net income to arrive at adjusted net income. Net income attributable to common stockholders for the fourth quarter of fiscal 2024 was $55.9 million compared to $43.4 million for the same period last year. On an adjusted basis, net income attributable to common stockholders for the fourth quarter of fiscal 2024 was $72.4 million compared to $61.9 million for the same period last year.\n\nDiluted EPS attributable to common stockholders for the fourth quarter of fiscal 2024 was $1.91 compared to $1.49 for the same period last year. On an adjusted basis, diluted EPS attributable to common stockholders was $2.47 for the fourth quarter of fiscal 2024 compared to $2.13 for the same period last year.\n\nBacklog as of March 30, 2024, was $726.1 million compared to $652.1 million as of December 30, 2023 and $663.8 million as of April 1, 2023. The $726.1 million backlog amount excluded $95.4 million of orders that we expected to fulfill beyond 12 months from March 30, 2024; the $652.1 million backlog amount excluded $118.6 million of orders that we expected to fulfill beyond 12 months from December 30, 2023; the $663.8 million backlog amount excluded $95.6 million of orders that we expected to fulfill beyond 12 months from April 1, 2023. Beginning in fiscal year 2025, we will disclose our full backlog for periods presented.\n\nPreferred Stock Conversion in Fiscal 2025\n\nThe Company’s Series A mandatory convertible preferred stock is set to automatically convert on October 15, 2024, at which point the Company will no longer be required to pay a 5.0% dividend ($5.7 million per quarter), which reduces net income attributable to common stockholders. This will lead to $23.0 million of annual cash savings in future periods. Fiscal 2025 will include the final three quarterly dividend payments.\n\nIf the preferred stock conversion were to have taken place during the fourth quarter of fiscal 2024, it would have resulted in an additional 2,029,980 shares of outstanding common stock. If these 2,029,980 shares were added to the total diluted shares outstanding in lieu of the preferred stock quarterly dividend of $5.7 million, diluted EPS for this quarter would have been $1.97 rather than the reported $1.91, and adjusted diluted EPS would have been $2.49 rather than the reported $2.47.\n\nOutlook for the First Quarter Fiscal 2025\n\nThe Company expects net sales to be approximately $415.0 million to $420.0 million in the first quarter of fiscal 2025, compared to $387.1 million this year, a growth rate of 7.2% to 8.5%.\n\nLive Webcast\n\nRBC Bearings Incorporated will host a webcast on Friday, May 17th, 2024, at 11:00 a.m. ET to discuss the quarterly results. To access the webcast, go to the investor relations portion of the Company’s website, www.rbcbearings.com, and click on the webcast icon. If you do not have access to the Internet and wish to listen to the call, dial 877-407-4019 (international callers dial +1 201-689-8337) and provide conference ID # 13746497. An audio replay of the call will be available from 2:00 p.m. ET May 17th, 2024, until 2:00 p.m. ET May 31st, 2024. The replay can be accessed by dialing 877-660-6853 (international callers dial +1 201-612-7415) and providing conference ID # 13746497. Investors are advised to dial into the call at least ten minutes prior to the call to register.\n\nNon-GAAP Financial Measures\n\nIn addition to disclosing results of operations that are determined in accordance with U.S. generally accepted accounting principles (GAAP), this press release also discloses non-GAAP results of operations that exclude certain items. These non-GAAP measures adjust for items that management believes are unusual, as well as other non-cash items including but not limited to depreciation, amortization, and equity-based incentive compensation. Management believes that the presentation of these non-GAAP measures provides useful information to investors regarding the Company’s results of operations as these non-GAAP measures allow investors to better evaluate ongoing business performance. Investors should consider non-GAAP measures in addition to, not as a substitute for, financial measures prepared in accordance with GAAP. A reconciliation of the non-GAAP measures disclosed in this press release with the most comparable GAAP measures are included in the financial table attached to this press release.\n\nFree Cash Flow Conversion Free cash flow conversion measures our ability to convert operating profits into free cash flow and is calculated as free cash flow (cash provided by operating activities less capital expenditures) divided by net income.\n\nAdjusted Gross Margin and Adjusted Operating Income Adjusted gross margin excludes the impact of restructuring costs associated with the closing of a plant. Adjusted operating income excludes acquisition expenses (including the impact of acquisition-related fair value adjustments in connection with purchase), restructuring and other similar charges, and other non-operational, non-cash or non-recurring losses. We believe that adjusted operating income is useful in assessing our financial performance by excluding items that are not indicative of our core operating performance or that may obscure trends useful in evaluating our continuing results of operations.\n\nAdjusted Net Income Attributable to Common Stockholders and Adjusted Earnings Per Share Attributable to Common Stockholders Adjusted net income attributable to common stockholders and adjusted earnings per share attributable to common stockholders (calculated on a diluted basis) exclude non-cash expenses for amortization related to acquired intangible assets, stock-based compensation, amortization of deferred finance fees, acquisition expenses (including the impact of acquisition-related fair value adjustments in connection with purchase), restructuring and other similar charges, gains or losses on divestitures, discontinued operations, gains or losses on extinguishment of debt, and other non-operational, non-cash or non-recurring losses, net of their income tax impact. We believe that adjusted net income and adjusted earnings per share are useful in assessing our financial performance by excluding items that are not indicative of our core operating performance or that may obscure trends useful in evaluating our continuing results of operations.\n\nAdjusted EBITDA We use the term \"Adjusted EBITDA\" to describe net income adjusted for the items summarized in the \"Reconciliation of GAAP to Non-GAAP Financial Measures\" table below. Adjusted EBITDA is intended to show our unleveraged, pre-tax operating results and therefore reflects our financial performance based on operational factors, excluding non-operational, non-cash or non-recurring losses or gains. In view of our debt level, Adjusted EBITDA aids our investors in understanding our compliance with our debt covenants. Management and various investors use the ratio of total debt less cash to Adjusted EBITDA, or \"net debt leverage,\" as a measure of our financial strength and ability to incur incremental indebtedness when making investment decisions and evaluating us against peers. Lastly, management and various investors use the ratio of the change in Adjusted EBITDA divided by the change in net sales (referred to as \"incremental margin\" in the case of an increase in net sales or \"decremental margin\" in the case of a decrease in net sales) as an additional measure of our financial performance and some investors utilize it when making investment decisions and evaluating us against peers.\n\nAdjusted EBITDA is not a presentation made in accordance with GAAP, and our definition of Adjusted EBITDA may vary from the definition used by others in our industry. Adjusted EBITDA should not be considered as an alternative to net income, income from operations, or any other performance measures derived in accordance with GAAP. Adjusted EBITDA has important limitations as an analytical tool, and you should not consider it in isolation, or as a substitute for analysis of our results as reported under GAAP. For example, Adjusted EBITDA does not reflect (a) our capital expenditures, future requirements for capital expenditures or contractual commitments; (b) changes in, or cash requirements for, our working capital needs; (c) the significant interest expenses, or the cash requirements necessary to service interest or principal payments, on our debt; (d) tax payments that represent a reduction in cash available to us; (e) any cash requirements for the assets being depreciated and amortized that may have to be replaced in the future; or (f) the impact of earnings or charges resulting from matters that we and the lenders under our credit agreement may not consider indicative of our ongoing operations. In particular, our definition of Adjusted EBITDA adds back certain non-cash, non-operating or non-recurring charges that are deducted in calculating net income, even though these are expenses that may recur or vary greatly, are difficult to predict, and can represent the effect of long-term strategies as opposed to short-term results. In addition, certain of these expenses can represent the reduction of cash that could be used for other corporate purposes. Further, although not included in the calculation of Adjusted EBITDA below, the measure may at times (i) include estimated cost savings and operating synergies related to operational changes ranging from acquisitions to dispositions to restructurings and/or (ii) exclude one-time transition expenditures that we anticipate we will need to incur to realize cost savings before such savings have occurred.\n\nAbout RBC Bearings\n\nRBC Bearings Incorporated is an international manufacturer and marketer of highly engineered precision bearings, components and essential systems. Founded in 1919, the Company is primarily focused on producing highly technical or regulated bearing products and components requiring sophisticated design, testing, and manufacturing capabilities for the diversified industrial, aerospace and defense markets. The Company is headquartered in Oxford, Connecticut.\n\nSafe Harbor for Forward Looking Statements\n\nCertain statements in this press release contain \"forward-looking statements.\" All statements other than statements of historical fact are \"forward-looking statements\" for purposes of federal and state securities laws, including the following: the section of this press release entitled \"Outlook\"; any projections of earnings, revenue or other financial items relating to the Company, any statement of the plans, strategies and objectives of management for future operations; any statements concerning proposed future growth rates in the markets we serve; any statements of belief; any characterization of and the Company’s ability to control contingent liabilities; anticipated trends in the Company’s businesses; and any statements of assumptions underlying any of the foregoing. Forward-looking statements may include the words \"may,\" \"would,\" \"estimate,\" \"intend,\" \"continue,\" \"believe,\" \"expect,\" \"anticipate,\" and other similar words. Although the Company believes that the expectations reflected in any forward-looking statements are reasonable, actual results could differ materially from those projected or assumed in any of our forward-looking statements. Our future financial condition and results of operations, as well as any forward-looking statements, are subject to change and to inherent risks and uncertainties beyond the control of the Company. These risks and uncertainties include, but are not limited to, risks and uncertainties relating to general economic conditions, geopolitical factors, future levels of aerospace/defense and industrial market activity, future financial performance, our debt level, our level of goodwill, market acceptance of new or enhanced versions of the Company’s products, the pricing of raw materials, changes in the competitive environments in which the Company’s businesses operate, the outcome of pending or future litigation and governmental proceedings and approvals, estimated legal costs, increases in interest rates, tax legislation and changes, the Company’s ability to acquire and integrate complementary businesses, and risks and uncertainties listed or disclosed in our reports filed with the Securities and Exchange Commission, including, without limitation, the risks identified under the heading \"Risk Factors\" set forth in the Company’s most recent Annual Report on Form 10-K filed with the SEC. The Company does not intend, and undertakes no obligation, to update or alter any forward-looking statements.\n\nRBC Bearings Incorporated Consolidated Statements of Operations (dollars in thousands, except share and per share data) (Unaudited) Three Months Ended Twelve Months Ended March 30, April 1, March 30, April 1, 2024 2023 2024 2023 Net sales $ 413,680 $ 394,422 $ 1,560,280 $ 1,469,294 Cost of sales 235,399 228,010 889,778 864,543 Gross margin 178,281 166,412 670,502 604,751 Operating expenses: Selling, general and administrative 64,409 59,561 253,537 229,690 Other, net 19,720 20,747 74,775 82,078 Total operating expenses 84,129 80,308 328,312 311,768 Operating income 94,152 86,104 342,190 292,983 Interest expense, net 18,768 21,663 78,679 76,695 Other non-operating expense 1,295 4,120 1,718 6,610 Income before income taxes 74,089 60,321 261,793 209,678 Provision for income taxes 12,419 11,166 51,889 43,019 Net income 61,670 49,155 209,904 166,659 Preferred stock dividends 5,686 5,750 22,936 22,936 Net income attributable to common stockholders $ 55,984 $ 43,405 $ 186,968 $ 143,723 Net income per common share attributable to common stockholders: Basic $ 1.93 $ 1.51 $ 6.47 $ 5.00 Diluted $ 1.91 $ 1.49 $ 6.41 $ 4.94 Weighted average common shares: Basic 29,011,673 28,822,172 28,917,008 28,764,092 Diluted 29,285,853 29,132,950 29,189,056 29,072,429 Three Months Ended Twelve Months Ended Reconciliation of Reported Gross Margin to March 30, April 1, March 30, April 1, Adjusted Gross Margin: 2024 2023 2024 2023 Reported gross margin $ 178,281 $ 166,412 $ 670,502 $ 604,751 Restructuring and consolidation - 190 289 190 Adjusted gross margin $ 178,281 $ 166,602 $ 670,791 $ 604,941 Three Months Ended Twelve Months Ended Reconciliation of Reported Operating Income to March 30, April 1, March 30, April 1, Adjusted Operating Income: 2024 2023 2024 2023 Reported operating income $ 94,152 $ 86,104 $ 342,190 $ 292,983 Transaction and related costs 145 6 283 79 Transition services - (114 ) - 8,831 Restructuring and consolidation 1,998 2,643 2,984 2,660 Adjusted operating income $ 96,295 $ 88,639 $ 345,457 $ 304,553 Three Months Ended Twelve Months Ended Reconciliation of Reported Net Income to Adjusted Net March 30, April 1, March 30, April 1, Income Attributable to Common Stockholders: 2024 2023 2024 2023 Reported net income $ 61,670 $ 49,155 $ 209,904 $ 166,659 Transaction and related costs 145 6 283 79 Transition services - (114 ) - 8,831 Restructuring and consolidation 1,998 2,643 2,984 2,660 Foreign exchange translation loss/(gain) - - - (417 ) M&A related amortization 16,409 16,278 65,477 65,110 Stock compensation expense 4,114 2,965 17,428 14,012 Amortization of deferred finance fees 748 1,044 3,044 7,208 Pension settlement 455 4,317 - 4,317 Insurance proceeds paid/(received) 1,113 - (519 ) - Tax impact of adjustments and other tax matters (8,606 ) (8,600 ) (24,000 ) (27,962 ) Adjusted net income $ 78,046 $ 67,694 $ 274,601 $ 240,497 Preferred stock dividends 5,686 5,750 22,936 22,936 Adjusted net income attributable to common stockholders $ 72,360 $ 61,944 $ 251,665 $ 217,561 Adjusted net income per common share attributable to common stockholders: Basic $ 2.49 $ 2.15 $ 8.70 $ 7.56 Diluted $ 2.47 $ 2.13 $ 8.62 $ 7.48 Weighted average common shares: Basic 29,011,673 28,822,172 28,917,008 28,764,092 Diluted 29,285,853 29,132,950 29,189,056 29,072,429 Three Months Ended Twelve Months Ended Reconciliation of Reported Net Income to March 30, April 1, March 30, April 1, Adjusted EBITDA: 2024 2023 2024 2023 Reported net income $ 61,670 $ 49,155 $ 209,904 $ 166,659 Interest expense, net 18,768 21,663 78,679 76,695 Provision for income taxes 12,419 11,166 51,889 43,019 Stock compensation expense 4,114 2,965 17,428 14,012 Depreciation and amortization 29,690 29,544 119,256 115,355 Other non-operating (income)/expense (273 ) (197 ) 2,237 2,293 Transaction and related costs 145 6 283 79 Transition services - (114 ) - 8,831 Restructuring and consolidation 1,998 2,643 2,984 2,660 Pension settlement 455 4,317 - 4,317 Insurance proceeds paid/(received) 1,113 - (519 ) - Adjusted EBITDA $ 130,099 $ 121,148 $ 482,141 $ 433,920 Three Months Ended Twelve Months Ended March 30, April 1, March 30, April 1, Selected Financial Data: 2024 2023 2024 2023 Cash provided by operating activities $ 79,360 $ 71,428 $ 274,683 $ 220,686 Capital expenditures $ 9,506 $ 12,423 $ 33,222 $ 42,000 Total debt $ 1,191,868 $ 1,395,043 Cash and cash equivalents $ 63,536 $ 65,379 Total debt minus cash and cash equivalents $ 1,128,332 $ 1,329,664 Repurchase of common stock $ 10,977 $ 7,763 Backlog $ 726,100 $ 663,830 Segment Data: Three Months Ended Twelve Months Ended March 30, April 1, March 30, April 1, Net External Sales: 2024 2023 2024 2023 Aerospace and defense segment $ 142,313 $ 121,828 $ 519,349 $ 430,307 Industrial segment 271,367 272,594 1,040,931 1,038,987 Total net external sales $ 413,680 $ 394,422 $ 1,560,280 $ 1,469,294\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240517055432/en/\n\nContacts\n\nRob Moffatt\r\nDirector of Investor Relations\r\ninvestors@rbcbearings.com\n\nView comments",
        "link": "https://finance.yahoo.com/news/rbc-bearings-incorporated-announces-fiscal-120000068.html",
        "symbols": [
            "B1X.F",
            "RBC.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.044,
            "neu": 0.876,
            "pos": 0.08
        }
    },
    {
        "date": "2024-05-17T00:00:00+00:00",
        "title": "RBC Stock Earnings: RBC Bearings Beats EPS, Beats Revenue for Q4 2024",
        "content": "RBC stock results show that RBC Bearings beat analyst estimates for earnings per share and beat on revenue for the fourth quarter of 2024.",
        "link": "https://investorplace.com/earning-results/2024/05/rbc-stock-earnings-rbc-bearings-for-q4-of-2024/",
        "symbols": [
            "RBC.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.296,
            "neg": 0,
            "neu": 0.913,
            "pos": 0.087
        }
    },
    {
        "date": "2024-05-12T12:21:07+00:00",
        "title": "RBC Bearings (NYSE:RBC) stock performs better than its underlying earnings growth over last five years",
        "content": "Generally speaking the aim of active stock picking is to find companies that provide returns that are superior to the market average. And in our experience, buying the right stocks can give your wealth a significant boost. For example, long term RBC Bearings Incorporated (NYSE:RBC) shareholders have enjoyed a 100% share price rise over the last half decade, well in excess of the market return of around 76% (not including dividends). However, more recent returns haven't been as impressive as that, with the stock returning just 25% in the last year.\n\nSince it's been a strong week for RBC Bearings shareholders, let's have a look at trend of the longer term fundamentals.\n\nSee our latest analysis for RBC Bearings\n\nTo paraphrase Benjamin Graham: Over the short term the market is a voting machine, but over the long term it's a weighing machine. By comparing earnings per share (EPS) and share price changes over time, we can get a feel for how investor attitudes to a company have morphed over time.\n\nOver half a decade, RBC Bearings managed to grow its earnings per share at 7.7% a year. This EPS growth is lower than the 15% average annual increase in the share price. So it's fair to assume the market has a higher opinion of the business than it did five years ago. And that's hardly shocking given the track record of growth. This optimism is visible in its fairly high P/E ratio of 45.14.\n\nYou can see how EPS has changed over time in the image below (click on the chart to see the exact values). earnings-per-share-growth\n\nWe know that RBC Bearings has improved its bottom line lately, but is it going to grow revenue? Check if analysts think RBC Bearings will grow revenue in the future.\n\nA Different Perspective\n\nRBC Bearings provided a TSR of 25% over the last twelve months. But that was short of the market average. On the bright side, that's still a gain, and it's actually better than the average return of 15% over half a decade It is possible that returns will improve along with the business fundamentals. While it is well worth considering the different impacts that market conditions can have on the share price, there are other factors that are even more important. For example, we've discovered 1 warning sign for RBC Bearings that you should be aware of before investing here.\n\nOf course, you might find a fantastic investment by looking elsewhere. So take a peek at this freelist of companies we expect will grow earnings.\n\nPlease note, the market returns quoted in this article reflect the market weighted average returns of stocks that currently trade on American exchanges.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nView comments",
        "link": "https://finance.yahoo.com/news/rbc-bearings-nyse-rbc-stock-122107211.html",
        "symbols": [
            "B1X.F",
            "RBC.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.023,
            "neu": 0.833,
            "pos": 0.144
        }
    },
    {
        "date": "2024-05-08T04:30:43+00:00",
        "title": "Q1 2024 Regal Rexnord Corp Earnings Call",
        "content": "Participants\n\nLouis Vernon Pinkham; CEO & Director; Regal Rexnord Corporation\n\nRobert Douglas Barry; VP of IR; Regal Rexnord Corporation\n\nRobert J. Rehard; Executive VP & CFO; Regal Rexnord Corporation\n\nJeffrey David Hammond; MD & Equity Research Analyst; KeyBanc Capital Markets Inc., Research Division\n\nJoseph Alfred Ritchie; VP & Lead Multi-Industry Analyst; Goldman Sachs Group, Inc., Research Division\n\nJulian C.H. Mitchell; Research Analyst; Barclays Bank PLC, Research Division\n\nMichael Patrick Halloran; Associate Director of Research & Senior Research Analyst; Robert W. Baird & Co. Incorporated, Research Division\n\nNigel Edward Coe; MD & Senior Research Analyst; Wolfe Research, LLC\n\nWalter Scott Liptak; MD & Senior Industrials Analyst; Seaport Research Partners\n\nPresentation\n\nOperator\n\nGood day, and welcome to the Regal Rexnord First Quarter 2024 Earnings Conference Call. (Operator Instructions). Please note, this event is being recorded. I would now like to turn the conference over to Rob Barry, Vice President, Investor Relations. Please go ahead.\n\nRobert Douglas Barry\n\nGreat. Thank you, operator. Good morning, and welcome to Regal Rexnord's First Quarter 2024 Earnings Conference Call. Joining me today are Louis Pinkham, our Chief Executive Officer; and Rob Rehard, our Chief Financial Officer. \r\nI'd like to remind you that during today's call, you may hear forward-looking statements related to our future financial results, plans and business operations. Our actual results may differ materially from those projected or implied due to a variety of factors, which we describe in greater detail in today's press release and in our reports filed with the SEC, which are available on the regalrexnord.com website. \r\nOn Slide 3, we state that we are presenting certain non-GAAP financial measures that we believe are useful to our investors and we have included reconciliations between the non-GAAP financial information and the GAAP equivalent in the press release and in these presentation materials. \r\nTurning to Slide 4. Let me briefly review the agenda for today's call. Louis will lead off with his opening comments and an overview of our 1Q performance. Rob Rehard will then provide our first quarter financial results in more detail and review our latest 2024 guidance. We'll then move to Q&A, after which, Louis will have some closing remarks. \r\nAnd with that, I'd now like to turn the call over to Louis.\n\nLouis Vernon Pinkham\n\nGreat. Thanks, Rob, and good morning, everyone. Thanks for joining us to discuss our first quarter results to give an update on our business and for your continued interest in Regal Rexnord. \r\nBefore discussing our first quarter performance, I'd like to acknowledge an important milestone on our Regal Rexnord transformation journey, which is the April 30 close on selling our Industrial Systems business. Completing that transaction is notable for a number of reasons. It allows us to focus on more durable, higher growth and higher-margin opportunities in our remaining segments. And it is generating attractive sale proceeds that allow us to accelerate paying down our debt. \r\nBut it also marks the conclusion of our inorganic portfolio transformation. The evolution of the company's portfolio through merger, acquisition and divestment transactions has been highly intentional and a critical driver of our strategy to become a faster growing, higher margin and more cash generative enterprise. \r\nIt began with the 2021 merger with Rexnord's approximately $1.2 billion process in motion control business and was followed by the 2023 acquisition of Altra with its approximately $1.9 billion in sales split between industrial power transmission and automation and motion control. Having closed on the Industrial Systems business, we now have our go-forward portfolio. It is a portfolio characterized by 50% of sales into markets with secular demand tailwinds, a product offering with mid-teens vitality higher than at any other point in our history and targeted to reach 25% in the next 2 years. \r\nOur offering today has more differentiated product with wider competitive moats and is nearly 75% weighted to automation and motion control and industrial power transmission. While our Legacy Regal Motors business, which 5 years ago was roughly 3/4 of our portfolio is now both more focused, more profitable and steadily evolving into a motorized air moving subsystems business. \r\nAll these characteristics are evident in our gross margins which reached 37.4% in the first quarter on an adjusted basis, excluding Industrial Systems. This is more than 1,000 basis points of improvement versus 2019 levels. And while a few hundred basis points can be attributed to M&A mix, about 7 points of the (inaudible) expansion is organic. A testament to the power of 80-20 to our sizable M&A synergies, to the Regal Rexnord business system, and to our heightened pricing discipline among other factors. \r\nMore important, however, is what we can achieve with this new portfolio going forward, a clear path to 40% adjusted gross margins and to $1 billion of adjusted free cash flow on an annual run rate basis exiting 2025 or at least $1 billion in 2026. Plus, steadily improving revenue outgrowth versus what is now a richer mix of secular markets. \r\nIn short, tremendous value creation opportunities for our shareholders, our customers and our associates. Executing all of this portfolio change while continuing to improve our core operations has not been easy. So I want to pause and thank our 30,000 Regal Rexnord associates for their hard work and disciplined execution delivering step change improvements in our operations over a multiyear period. We really do have an excellent team. \r\nNow consistent with our evolved portfolio, we've recently decided to update our business purpose. Our purpose is our North Star, the why, our 30,000 associates around the world by meaning coming to work every day. It now reads, we create a better tomorrow with sustainable solutions that power, transmit and control motion. Helping our customers, our communities and our planet with the most sustainable solution remains core to how and why we operate. It is integrated into our strategy and embedded in our purpose. \r\nIn some recent news on this front, we were very pleased to see our progress and contributions around sustainability recognized by Barings achieving a rank of 14 on its list of the 100 most sustainable U.S. companies. But the unifying characteristics of our Go-Forward portfolio is now all about motion. Our high-efficiency electric motors provide the power to create motion, a portfolio of highly engineered power transmission components and subsystems efficiently transmit motion to power industrial applications, while our automation offering controls motion in a wide variety of applications that range from factory automation to precision control in surgical tools. We expect to share a lot more about how we plan to harness the power of our evolved Regal Rexnord portfolio to accelerate profitable growth. And in the Investor Day, we are hosting on September 17 in New York City. \r\nNow turning to our first quarter results. Our team delivered a strong first quarter despite some persistent end market headwinds. I would summarize first quarter as demonstrating strength and outperformance in IPS. On the top line and with margins, net of continued end market headwinds in PES with AMC tracking largely in line allowing us to hold our full year adjusted EPS guidance aside from impacts related to selling industrial systems. \r\nSales in the quarter were up 26.4% overall but down 7.5% on a pro forma organic basis or down 7.1% excluding industrial as we continue to see weak end market demand in residential HVAC and factory automation. Pro forma orders in the quarter were down 4.3% on a daily basis, excluding industrial and up 6% sequentially. \r\nWhile first quarter began with roughly flat orders in January, trends weakened during the quarter, entirely attributable to PES. Notably, book bill was approximately 1.1 in the quarter, the first time in 4 quarters that we had a book bill rate above 1. In April, our pro forma orders were down approximately 2%, trending better than the first quarter exit rate. Order growth rates in IPS and PES actually improved sequentially in April, but AMC saw some incremental pressure that we would attribute to order timing. Rob will share more detail in his session. \r\nDespite first quarter top line pressures, margins in the quarter were strong. Our adjusted gross margin came in at 37.4% excluding Industrial, mainly reflecting our synergies, 80-20 and lean actions. \r\nAdjusted EBITDA margin of 20.5% was up 100 basis points versus the prior year on a pro forma basis, aided by delivering $26 million in synergies, which keeps us on track to achieve $90 million this year. Excluding Industrial Systems, our first quarter adjusted EBITDA margin was 21.5%, up 80 basis points versus the prior year pro forma level. \r\nLastly, we delivered $65 million of adjusted free cash flow, a strong result in the seasonally softer first quarter and are on track to deliver $700 million of adjusted free cash flow this year. We paid down $135 million of debt in the quarter. Our anticipated annual adjusted cash flow this year plus net proceeds from the Industrial Systems sale should enable over $900 million of debt paydown in 2024. All things considered, a solid start to 2024. \r\nShifting focus, you may recall that each quarter, I have been spending a few minutes introducing one of our principal AMC businesses to help investors better appreciate how we are well positioned to accelerate profitable growth. \r\nThis quarter, I'd like to spend a couple of minutes discussing our conveying business. As you can see on the left-hand side of this slide, this is about a $400 million business for us, and we expect it to grow at a high single-digit rate this year. Key brands are also listed which are a valuable core asset because they signify quality and reliability plus differentiated competencies in areas such as line speed and sustainability. Focused on reducing water consumption and energy efficiency.\r\nConveying focused markets warehouse, beverage and food, all benefit from secular tailwinds. We serve these markets by designing and manufacturing conveying modules and subsystems, including palletizers and depalletizers along with a range of highly engineered components and subsystems as well as project management and engineering services. \r\nWhile growth in conveying has been constrained in recent years on weakness in the beverage and warehouse end markets, our teams have been focused on outgrowth initiatives and they are making great progress. How we are winning share is summarized on the lower left-hand side of the slide, increasingly, growth in conveying will be driven by selling powertrains. As a reminder, a powertrain is a solution that comprises the critical power transmission components that link a motor to the application it is powering sold as one integrated subsystem. \r\nIn the case of conveying, what is being powered are belts, conveyors, palletizers and depalletizers. These are designed through cross-functional collaboration between our conveying business and the applicable teams across the business. The customer value prop is ease of doing business and ability to outsource certain engineering functions plus the greater reliability and performance that comes when we engineer the various pieces together into a unified system. \r\nOn the bottom of this slide are some great examples of differentiated product solutions. First, is our ModSort branded mobile [flight] order, which sorts products or packages in a warehouse or distribution center. This particular example leverages our core competency in high-speed conveying. It can sort 3,000 parcels per hour versus a more typical offering that has 30% to 40% lower sortation rates. Thereby reducing the need for manual labor and improving package handling efficiency. \r\nIn addition to the ModSort module, this subsystem uses additional conveying components plus a Regal Rexnord motor, gear and bearings. \r\nNext is run dry belting designed for beverage applications. The average beverage company uses 4 to 7 gallons of water to produce a single gallon of its product, often in combination with soap to create a lubricant that reduces friction, flushes away fills, dissipates heat and reduces chain wet. The proprietary design of our run dry belting requires almost no lubrication. We eliminate the water needed for conveyor lubrication by up to 80% to 90% and enable 10% better energy efficiency by reducing the load on the drive system. \r\nThe third product pictured is our clean top metal conveyor belt for the food industry. Here, our differentiated value prop is reliability and durability, which is enabled by our design and engineering approach. This product used in a food production facility has been proving to last 6x longer than most competitors. \r\nI hope this gives you a better sense for why we see a robust growth outlook for our conveying business. While we think end markets increasingly will be a tailwind for us in the back half of 2024 and into 2025, the business is also doing so much more to accelerate its revenue outgrowth. \r\nAnd with that, I'll turn the call over to Rob.\n\nStory continues\n\nRobert J. Rehard\n\nThanks, Louis, and good morning, everyone. I'd also like to thank our global team for their hard work in the quarter and over the last few years, as we have been working diligently to transform our business organically and inorganically into a more durable and higher performing enterprise. Now let's review our operating performance by segment.\r\nStarting with Automation & Motion Control, or AMC, Net sales in the first quarter were up 96.9% to the prior year, reflecting the Altra acquisition. Pro forma for the Altra acquisition, organic sales were down 4.5% and aligned with expectations, reflecting strength in the data center, medical and aerospace end markets which was more than offset by weakness in global discrete automation markets. \r\nAdjusted EBITDA margin in the quarter was 22.5%, in line with our expectations. This margin is down 50 basis points versus prior year on a reported basis, which, as a reminder, is comparing to a period when we did not have Altra in our results. On a comparable pro forma basis, AMC's first quarter adjusted EBITDA margin was up 10 basis points versus the prior year period. \r\nThe pro forma margin performance reflects pockets of strength in mix positive markets, including medical, aerospace and data center, synergy realization and good discretionary cost management, partially offset by lower volume. \r\nOrders in AMC on a pro forma daily organic basis, were down 2.7% in the first quarter. Orders continued to reflect weakness in our short-cycle discrete factory automation business. However, sequential orders were up approximately 6% with orders for longer cycle automation and for our aerospace business remaining particularly healthy and contributing to some backlog growth. \r\nNotably, book-to-bill in the quarter was 1.08, marking the first time in the last 4 quarters that we saw a book-to-bill above 1. However, April orders for AMC were down nearly 5%, on a daily organic basis due mostly to lumpy large project orders. \r\nBefore moving on, I want to spend a few extra minutes providing a bit more color on what we are seeing in order rates in discrete automation, which was primarily in the Motion Control Solutions. Or MCS business, where we have seen the most pressure within AMC over the last couple of quarters and why we remain confident in a stronger second half. \r\nYear-over-year, first quarter orders were up approximately 3%. However, sequentially, saw a 7% decline due to 2 large orders in our government end markets that landed in the fourth quarter. As we stated previously, order patterns in this business do tend to be lumpy. Outside of this sequential impact, we experienced a healthy 38% sequential orders improvement in all of our other key end markets combined including medical, robotics, factory automation and autonomous solutions. This is the second consecutive quarter of bookings improvement. I'll provide a bit more color on this as it relates to our guidance assumptions later in this presentation. \r\nTurning to Industrial Powertrain Solutions or IPS. Net sales in the first quarter were up 55.3% to the prior year, reflecting the Altra acquisition. Pro forma for the acquisition, organic sales were down 1%, which was several points above our expectations. \r\nGrowth in the quarter mainly reflects strength in the general industrial and energy markets, offset by weakness in the alternative energy, agriculture and construction markets. Adjusted EBITDA margin in the quarter was 25.8%, firmly above our expectations. While that margin is down 350 basis points versus the prior year on a reported basis, similar to what I said when discussing AMC, that variance is comparing to a period when we did not have Altra in our results. But margins are up 120 basis points versus the prior year on a comparable pro forma basis. \r\nIt is worth noting that the margin decline you see on a reported basis to a large extent, reflects adding Altra's business, which ran at lower margins to our legacy Regal Rexnord business. A significant part of our synergy plan is leveraging our 80/20 and restructuring playbook, legacy Altra operations in strengthening those margins to a level of our legacy Regal business. \r\nOn a pro forma basis, the margin improvement at IPS reflects tailwinds from synergies and slightly favorable mix, along with strong discretionary cost management, partially offset by headwinds from lower volumes. Orders in IPS on a pro forma daily organic basis were down 3.1% in the first quarter. Book-to-bill in the quarter was 1.06 and similar to what I saw -- what we saw at AMC, this was the first time in the last 4 quarters that we saw a book-to-bill above 1, giving us continued confidence in our guidance assumptions embedded for IPS. \r\nIn April, orders on a daily organic basis were down just below 1%, an improvement versus the first quarter. Although orders were down 1% in Q1, they were up more than 8% on a sequential basis, which is stronger than the typical seasonal improvement we saw from fourth quarter to first quarter. We continue to expect stronger orders performance in IPS in the second half as compares become much easier. \r\nTurning to Power Efficiency Solutions, or PES, Organic sales in the first quarter were down 17.8% from the prior year, below our expectations. The shortfall in performance was driven by continued channel destocking activity in the North America furnace market, weaker demand in the North America residential HVAC market and headwinds in the Europe and Asia Pacific commercial HVAC markets. \r\nWhile headwinds in these markets were quite severe, we did see pockets of strength included in our North America commercial HVAC business and in pool markets. We believe a warmer winter was a factor weighing on furnace sales. which left the channel with still elevated inventories. \r\nWe also believe air conditioning inventory levels remain elevated in parts of the HVAC distribution channel. The adjusted EBITDA margin in the quarter for PES was 13.2%, down 50 basis points versus the prior year period and below our expectation. Key contributors to the PES margin performance were lower volumes and weaker mix. We expect PES margins to improve to a mid-teens rate in second quarter and track back to a high teens rate in second half as volumes improve, mix normalizes and we realize benefits from restructuring actions that we are taking in this business. \r\nShifting to orders. Orders in PES for the first quarter were down 7.6% on a daily basis. The weakness reflects continued pressure in residential HVAC and incremental weakness in commercial HVAC, specifically in Europe and Asia. We are also experiencing pockets of pressure in our general purpose motors business. both in distribution, likely tied to lingering destocking and with certain OEMs. We see some of our HVAC customers being more cautious about placing orders as they evaluate the underlying strength of global HVAC markets. \r\nDaily orders in April improved somewhat to down approximately 2% versus prior year, which is directionally encouraging, but we believe it would be premature to conclude this trend will be sustainable at this point. While recent commentary from some of our OEM customers sounds a bit more encouraging, we have also experienced repeated false positives from some of them in recent quarters regarding inflection in residential HVAC. \r\nAs a result, we are remaining cautious about the near-term outlook for PES. And due to the results we are reporting for Q1 along with the expectations for Q2, are lowering our growth expectation for this business in 2024. A dynamic that I will discuss in more detail in the outlook portion of this call. \r\nThat said, we remain cautiously optimistic about a stronger second half for PES as compares become easier in the absence of prior year destock headwinds. We also built some backlog in the quarter with a book-to-bill of 1.1 in the quarter, which should help us in the near future. \r\nOn the following slide, we highlight some additional financial updates for your reference. Notably, on the right side of this page, you'll see we ended the quarter with total debt of $6.25 billion and net debt of $5.7 billion. We repaid $135 million of gross debt in the quarter. We plan to deploy the net proceeds from the industrial system sale to debt reduction, which should further reduce our debt by approximately $355 million. \r\nAdjusted free cash flow in the quarter was $64.6 million, strong performance considering normal seasonality and we are on track to deliver $700 million of adjusted free cash flow this year. Consistent with our prior plans, we expect to deploy this free cash flow after dividend payments to debt reduction. As a result, the combination of the industrial sales net proceeds plus post-dividend free cash flow should enable us to pay down approximately $900 million of our debt in 2024. And benefit from the associated lower interest costs. \r\nMoving on to the outlook. We are making several adjustments to our guidance for 2024, which are detailed in the table on the right-hand side of this slide. Also included in the table is our standard disclosure on below the line items with specific indications for what has changed. First, having closed on the sale of Industrial Systems on April 30, we are removing it from the outlook from May onwards, as outlined in the second column from the left. \r\nRemoving industrial is a headwind to sales of approximately $345 million, but a benefit to our adjusted EBITDA margin worth roughly 70 basis points for the year. The sale also had some below-the-line impacts, most notably lower interest expense since we are deploying sale proceeds to pay down our debt. \r\nThere is also a small impact to the minority interest line in the P&L as detailed in the table. The net impact to adjusted earnings per share from these factors is negative $0.15. Note that industrial systems will remain in our second quarter results for the month of April and its performance will remain in our annual disclosures for the January through April 30 period of ownership. \r\nSecond, we are updating the outlook for our remaining business outlined in the third column from the left. These updates include reducing our sales outlook by $60 million, mainly in PES, but raising our expectation for adjusted EBITDA margins by 10 basis points factory mix impacts as well as making several below the line adjustments as outlined in the table. \r\nThe net impact of these adjustments is neutral to adjusted earnings per share. The combined impacts of the industrial system sale and the adjustments to our remaining business are presented in the last column on the right, and reduces the midpoint of our adjusted EPS guidance range to $10 for our new EPS guidance range for full year 2024 of $9.60 to $10.40. Finally, as mentioned previously, adjusted free cash flow is expected to be $700 million this year. \r\nOn this slide, we provide more specific expectations for our second quarter and full year performance by segment on revenue and adjusted EBITDA margin. Note that the full year 2024 guided growth rates for AMC and IPS are off of 2023 pro forma results. \r\nStarting with AMC. For the second quarter, we anticipate sales of approximately $410 million, with EBITDA margins of approximately 23%, a modest improvement versus first quarter performance on both metrics. For the year, we now expect AMC sales to be flat, a slight reduction versus our prior expectation based on updated order rates discussed earlier, specific to discrete factory automation. We expect 2024 adjusted EBITDA margins to be in a range of 24% to 25%, consistent with our previous expectations. \r\nOverall, we continue to see strength in the data center, aerospace and medical markets within AMC net of headwinds in discrete factory automation. \r\nCircling back to the MCS business I discussed earlier. Our AMC outlook implies only a slight Q2 revenue improvement due to the lingering discrete factory automation market dynamics but we are more bullish about the future growth potential due to a couple of key factors. \r\nFirst, we saw a 49% larger project funnel in first quarter versus the same period last year. This includes roughly 37% growth in new product design and prototype wins. And second, we are gaining traction in our strategic secular end markets outside of factory automation, such as aerospace, medical automation and robotics, where new programs and new products are ramping up. \r\nThe orders in these strategic end markets typically come with a longer time to fill than factory automation orders. But our orders growth over the last 2 quarters is building a healthier scheduled backlog mix in Q3 and Q4 of this year. This growing strategic end market success provides us with a cautiously optimistic outlook the second half of this year. \r\nNow shifting to IPS. We anticipate sales of approximately $670 million in the second quarter with margins of approximately 25%. An improvement versus first quarter performance on sale, but a modest sequential decline on margin, factoring the stronger top line momentum we saw in first quarter, but some normalizing on mix as we do not expect the same level of benefit in the second quarter that we saw in the first quarter. \r\nFor the year, we now expect IPS sales to be flat, a slight improvement versus our prior expectation. We are feeling a little bit better about the outlook for IPS after a stronger start to the year, but are mindful of pockets of weakness, particularly in the ag and construction markets and in parts of general industrial. \r\nWe expect IPS-adjusted EBITDA margins to be in a range of 25.5% to 26.5%, which at the midpoint would be 50 basis points above our previous expectation. Our margin outlook for IPS continues to reflect nice tailwinds from synergies, net of full year mix pressure and select growth investments. \r\nFor PES, we anticipate sales of approximately $395 million in the second quarter with margins of approximately 16%, a modest improvement on sales versus first quarter and a somewhat stronger improvement versus first quarter on margin. For the year, we now expect sales to decline at a mid-single-digit rate, weaker than our prior expectation for sales to be flat versus the prior year. We expect adjusted EBITDA margins to be in a range of 16% to 18%, which is also down versus our prior expectations. \r\nAs I mentioned earlier, PES got off to a slower start than expected in our residential HVAC business, and we remain cautious about the near-term outlook. We continue to be more optimistic about the second half as compares ease significantly and our new products gain momentum. And on margin as we see benefits from restructuring actions we are taking. \r\nWe also acknowledge more optimistic commentary from certain HVAC OEM customers on resi HVAC, though we have not factored into our outlook. To the contrary, we're building in some incremental conservatism. \r\nThe improvement in orders in April versus first quarter is also encouraging, but we think premature to assume it continues. All that said, if we take a step back for a moment, we believe the ready HVAC markets will inflect at some point in the near future, and we believe we're closer to that happening than we've ever been in over a year. \r\nBefore turning the call over to the operator for questions, I wanted to underline a couple of points Louis shared in his remarks. Over 1,000 basis points of adjusted gross margin improvement in the last 4 years and a path of 40% exiting next year, a similar path to over $1 billion in annual adjusted free cash flow. And a transformed portfolio that has dramatically shifted to more durable products and markets served. \r\nIn 2019, power transmission was about 25% of our business with the remainder of motors. Today, automation and power transmission is 75% of our portfolio, and we have a motors and air moving business that is much more focused and profitable. We are excited about our future, and we believe we have a tremendous amount of additional value to create for our stakeholders as we continue to expand margin, raise annual free cash flow, pay down our debt and accelerate organic growth. \r\nAnd with that, operator, we are ready to take questions.\n\nQuestion and Answer Session\n\nOperator\n\n(Operator Instructions).The first question comes from Mike Halloran with Baird.\n\nMichael Patrick Halloran\n\nSo certainly I heard all Rob's remarks about seasonality 1H, 2H. But maybe, Louis, you could just talk to your confidence level in seeing that ramp into the back half of the year. And maybe frame it as what needs to happen to hit the high end of the guidance? And what does the market look like? And then similarly, at the low end of guidance, what kind of market are we seeing here? What kind of sequentials, however you want to frame it, are we seeing if we're at the low end of the revenue guidance?\n\nLouis Vernon Pinkham\n\nYes. So I appreciate the question, Mike. A couple of things here. First of all, if you look at first half, second half, it's about 48-52 split now. there's really two things that have to be true for us. And we based our forecasting on the best information we had at the time. For that 52% to be true, we need our PES sales to rebound and it's really the resi HVAC piece that must improve. \r\nNow our book bill coming out of Q1 was 1.1, which gives us a little bit of confidence on that. Our orders progressing through April at down 2% in the PES segment, and then just what we're hearing from the market, from our channels and OEMs will give us some confidence. \r\nBut we're going to be cautious right now because although we feel more confident today than we've ever felt -- January was pretty strong as well, and then it weakened through the quarter. So we feel that we rightly positioned Q2 as still getting through the destock market headwinds and then with easier comps recovery in the second half. \r\nThe same holds true for factory automation, but less or so, it has a lesser impact on our overall business. We feel really good about the order rates that we're seeing for the longer cycle piece of that business. Rob talked about our funnel being up 50%, our win rates being up significantly, which gives us confidence of the second half and into '25 in particular. \r\nBut we do need to see book bill continue to progress at about the same pace we saw in April. So as long as that holds true, we feel good. Now the upside piece to your question. Is it a rebound in the resi HVAC business is stronger than what we're anticipating? And honestly, I'll tell you we're being cautious. And so we think that's the best way to position ourselves for right now.\n\nMichael Patrick Halloran\n\nAnd then as part of the mission statement update, you reiterated exit rate margin commentary. So if you could just talk about how that should play out over the next couple of years here from a linearity perspective. And then how tied to revenue that is versus how in-control it is with just your internal actions?\n\nLouis Vernon Pinkham\n\nYes. So a lot of it is just our internal actions. And so I think it's probably better to base it -- to build it off of '23 to give you an understanding of how we get there. So if you take '23 at 35% gross margins and 21% EBITDA, industrial lifts us by about 100 basis points on both GM and EBITDA. \r\nSynergies are about 250 basis points. And as you know, we've got $90 million of synergies this year and $65 million next year. And then about 1 point, 1.5 points from NPD 80-20 and mix. And I'd tell you that that's pretty straight line. \r\nNow all of that gets us to the 40% gross margins but we are reinvesting about 100 basis points back in R&D through that same period. And so that's how you get to the 25% EBITDA margins. Hopefully, that's helpful.\n\nOperator\n\nThe next question is from Julian Mitchell with Barclays.\n\nJulian C.H. Mitchell\n\nMaybe just wanted to sort of try and dial into the -- the sort of second half revenue guides for the industrial businesses, AMC and IPS. So it looks like you've got sort of a bigger back half increase, half-on-half of sales in AMC, perhaps versus what you have in IPS. So maybe just trying to understand what's sort of driving that big AMC step-up? I think another factory automation peer this morning is talking a lot about end of destocking, for example, is driving a big improvement in their half-on-half numbers. So just wondered kind of how you see that dynamic playing out in discrete automation and maybe why IPS has less of that second half ramp than AMC. That would be helpful.\n\nLouis Vernon Pinkham\n\nYes. So Julian, I think you're spot on. And so I'm going to answer IPS. We feel really good about the successes we've been seeing in our cross sale and our synergy growth. The reality of IPS is we feel like we got through the destocking in the second half of last year, maybe a little bit in the first quarter. And so we're not seeing nearly what we've seen certainly not in residential HVAC or discrete automation. And so that's why IPS, we feel really good about the position. We think our hypothesis of bringing these strong businesses together is playing out. \r\nNow Automations & Motion Control, again, I think you're spot on. Now I'd tell you, I agree, automation only makes up about 15%-ish of that segment. What's also lifting here is the strength in the other markets. Aerospace, we expect to be up in the second half year sequentially as well as year-over-year. Medical definitely sequentially in year-over-year as well as data center, sequentially in year-over-year, which gives us a little bit more confidence in that second half for AMC. But those are really the main drivers. \r\nBut I'd agree with you that destock and discrete automation will help us a bit. And IPS is really just good execution, good performance of our commercial teams.\n\nJulian C.H. Mitchell\n\nThat's helpful. And then just -- I don't know how much color you could provide, but we've obviously got your second half implied guidance now and what you have for Q2. Just wondered if there was any color you could provide as to how we should think about earnings sequentially sort of through that second half. Are we thinking sort of sales and EBITDA margins up sequentially in both Q3 and Q4. Any thoughts to try and understand kind of that weighting in the second half for Regal as a whole?\n\nRobert J. Rehard\n\nYes, Julian, this is Rob. I'll take that. We do expect that sequentially third quarter obviously, sequentially stronger than second quarter, but fourth quarter then builds again off of third. So we do see that sequential improvement as we move forward. And the same for margins as we move through third quarter and fourth quarter and associated then, of course, EPS building as we move into the fourth quarter. So you might expect seasonality-wise, we might see a little bit of a drop off in the fourth quarter. We're actually not forecasting that at this time. We're seeing it actually continue to build through the fourth quarter based on what we've talked about today.\n\nJulian C.H. Mitchell\n\nAnd does that mean it's sort of an even weighting in that step-up or Q3 will always have a bigger one in terms of that step-up sequentially than Q4 is having?\n\nRobert J. Rehard\n\nYes. Q3 would be a bigger step-up off of Q2 than Q4 over Q3.\n\nOperator\n\nThe next question is from Jeff Hammond with KeyBanc Capital Markets.\n\nJeffrey David Hammond\n\nSo just on PES, I'm just trying to -- I mean, your commentary and I guess, how starkly weak it's been is maybe disconnected a little bit from the OEM. So I'm just trying to understand, how have you seen share shift? I know you picked up some share during COVID maybe because you had a closer supply chain. There's been some SEER changes and refrigerant changes. Are you seeing share shifts as these new models are coming out or are we under appreciating 80-20. Just level set us on share and just some of these kind of regulatory changes?\n\nLouis Vernon Pinkham\n\nYes. So Jeff, I appreciate the question. We feel good about our share position. We do not fuel like -- and to your point, we definitely gained some share during COVID. We think we've held on to much of it. Now with 80-20, this is the piece of the business where we have managed 80-20. We're no longer going to sell product at low margins. That's just not who we are. We sell value in our product and technology. And so we have seen some 80-20 pruning in this space, but that's really not a driver here. \r\nFrom a regulatory perspective, for sure, with the 2025 GWP regulations, we're working with all of our OEM customers. In some aspects -- in some perspective, they have to redesign their products to meet the requirements. And this tends to help us because they typically choose a more energy-efficient motor, and that should be a positive for us in the end. \r\nBut I want to circle back a little bit to your initial part of your question, which was a disconnect with the views that are being stated right now. A couple of things I'd clarify. There's definitely some lack of clarity in the market. And I think we've had a few false starts. \r\nAnd I remind you that our HVAC OEMs. When they're talking about current situations, they're talking about consumer demand. And that's a bit of a lag from what we would see with demand. And in addition, some of that demand is going to be satisfied through stock levels. And in addition, I'd say to that, there's embedded price in their demand and unit volumes are still under pressure and is that -- as you know, we don't link to their price levels. \r\nAnd so all in, we're perhaps a bit more cautious just because -- again, January, we thought we're going to see a bit of a recovery. Honestly, fourth quarter, we were hearing from OEMs that we were going to see recovery. And so we're being cautious. April gives us a little bit of confidence. But again, 1 month does not make a trend. So a lot there, Jeff, but hopefully, that was helpful on how we're thinking about it.\n\nJeffrey David Hammond\n\nOkay. Great. And then just IPS, I think you said mix was a positive and you thought that would step back. What in particular was driving the positive mix? And why don't you think it would continue? And then just within the kind of guide change on IPS margins. Is that better synergies? Or is there some mix in there as well?\n\nRobert J. Rehard\n\nYes. So the mix was largely around, hey, we had fairly strong distribution versus OEM as we move through the first quarter. We don't see that same strength as we move into the second quarter. Synergies absolutely continue to build as we move through the year. We saw synergies of roughly $26 million in the first quarter and are on track to that $90 million. So continuing to build as we move through the year. So that's -- but the mix impact is really just not the continuation that we saw in the first quarter on that strong distribution versus OEM\n\nOperator\n\nThe next question is from Nigel Coe with Wolfe Research.\n\nNigel Edward Coe\n\nJust another question on PES. I'm sorry about that. But (inaudible) guide you embed, very little pick up Q-over-Q from 1Q to 2Q. And I think 2Q is normally a seasonally strongest quarter. So I understand Louis, you want to be very cautious, mix signal some customers. But is there anything you're seeing to maybe kind of inform that sort of view on 2Q [of them] want to be very cautious? And then my follow-on question with that would be, maybe some more details around the restructuring you called out for that segment?\n\nLouis Vernon Pinkham\n\nYes. Really, no. I feel like when we were here in October and then we were here in January, we were in similar situations. And so we're going to be cautious about our guide for this quarter. Now again, 1.1 book bill rate coming out of Q1, orders down 2% in April gives us some confidence. I wish we could have this conversation after May because then I'll have more confidence because again, I felt like I was in a similar situation in January. So we're going to be cautious here, make sure that we execute beyond that, that's really the view.\n\nRobert J. Rehard\n\nAnd then on the second part of your question there, we do have some restructuring savings that are embedded in the guide, and we don't typically comment on segment-level restructuring actions, but there's certainly a component. But a lesser component to the second quarter step up in margins versus what we expect in terms of, like you said, a little bit of volume, a little bit of volume goes a long way in terms of absorption, but also line of sight to some better mix coming through in the second quarter versus the first. So yes, restructuring actions will help, but it's not a big driver of the improvement going forward.\n\nNigel Edward Coe\n\nOkay. That's helpful. And then we've seen copper prices running pretty hard here. So I'm wondering if the NPS, which I think are mainly within PES, whether that's having some impact to your second quarter margin. I think there's been a lag on the recovery there anything to say on the NPS? And then as we unplug industrial from the guide, are there some stranded costs coming from industrial into the other segments?\n\nRobert J. Rehard\n\nYes. So let me take those 2 pieces here. So first of all, from the copper coming through on the 2-way material price formulas, these are 2 way. We aren't seeing a lot of that yet, that there is still a lag there on the noncontracted business, which I know is not part of your question but we do hedge both copper and aluminum. So that's on the noncontracted side. So no, we aren't seeing a big impact from that as we move through the year, but are continuing to evaluate. \r\nOn the -- your second question on stranded cost potentially. So the $0.15 that you see in the model that we provided in the presentation. It is simply dilution. There is a -- certainly a bit of stranded cost that we would estimate to be a little less than $5 million, which are partly covered by TSAs and which we believe we can take out in the next 12 months through our normal productivity actions.\n\nOperator\n\nThe next question is from Walter Liptak with Seaport.\n\nWalter Scott Liptak\n\nSo I wanted to ask about the free cash flow for the year. And how -- we're going into a seasonally stronger period, how the cash flow might look for the second quarter? And then what are the puts and takes to getting to that free cash flow number?\n\nRobert J. Rehard\n\nSure. Yes. So $700 million for the year, and you're specifically asking about maybe puts and takes on maybe working capital, how that progresses, the seasonality associated with inventory builds. \r\nI would expect that the cadence of our cash flow is customarily going to be, hey, you're going to start a little bit slower in the first quarter and build as you move through the year with most of your cash coming in the late third to fourth quarter. \r\nWe do see that there is a headwind in working capital this year relative to last year. We saw almost $250 million of working capital benefit last year, and we might see about $50 million of that this year. That being said, the way that we bridge from last year to this year, if you will, if you think that we got almost about $660 million last year going to $700 million this year is we'll get a little bit out of EBITDA year-over-year. Our cash interest expense will come down, cash taxes will also be lower than last year, and then restructuring should come in a little bit lower. \r\nSo when you kind of bridge last year to this year and there's about $40 million or so between the 2 years. Those are the kind of puts and takes on the bridge to get you to this year's cash flow.\n\nWalter Scott Liptak\n\nSo Louis, I wanted to ask you about the conveying products, and thanks for pointing out the $400 million in sales. I wonder if you could talk about the margins for that business? And if there's a difference between margins for component parts and systems versus design engineering? And are you doing any installation or integrated systems within that $400 million?\n\nLouis Vernon Pinkham\n\nYes. So I'll go a little backwards. So are we doing installation in project management? We are. It's not a big percentage of that business, but about 5%, and we're actually seeing that piece growing nicely. The margins of the overall business are actually above our average in that segment. And it's part of AMC, it's a solid business. \r\nNow it really depends on project by project. But our equipment side and our systems side are not that far off our component side for margins. So overall, a really solid business for us.\n\nWalter Scott Liptak\n\nOkay. Great. And why is it that -- do you think that this part of the conveyors are growing faster than, say, the automation part of your business?\n\nLouis Vernon Pinkham\n\nWell, this -- the conveying business is really linked to food and beverage and warehouse. And for sure, food and beverage and warehouse has been under pressure for the last couple of years, in particular, I should say, beverage and warehouse. And so we're seeing that rebounding as the year progresses and into next year. \r\nAnd then I'll emphasize one other point, which is with the acquisition of Arrowhead as well as our Industrial Powertrain Solutions, synergy, strategy of selling the entire industrial powertrain. It really fits into these markets well. And so we're winning more because of the total solution that Regal Rexnord is able to bring to bear.\n\nOperator\n\nThe next question is from Joe Ritchie with Goldman Sachs.\n\nJoseph Alfred Ritchie\n\nI just want to really focus my questions on AMC. So clearly, like, there's a big part of the business that is going from inorganic to organic this upcoming quarter. And so I just want to make sure I'm dialing this in right? Like you guys are now looking at potentially like mid-teens down organic for the second quarter. And -- and is that -- so please correct me if I'm wrong there. And then also, is that kind of like where trend is on the business right now? And any color you can give us on the discrete automation side of the business would be helpful relative to that number.\n\nLouis Vernon Pinkham\n\nYes. So Joe, I appreciate the question. I would say you've also got to remember, there's a little bit of a stub period compare that puts a bit of a pressure on AMC. It really though the main pressure in AMC for us is discrete automation. And although we're seeing the order book feel better, it's really more second half than '25 weighted. And so that's putting pressure. \r\nBut again, the segments or the markets that are accelerating our medical data center and Arrow, which gives us confidence in the second half of next year -- sorry, second half of this year.\n\nJoseph Alfred Ritchie\n\nThat's helpful, Louis. And then I guess -- and just maybe just sticking with that last comment. So to get that those end markets are doing better, like in the end markets that aren't doing well, like is there anything from like a -- whether it's like negotiations or marketing qualified leads or any type of like kind of leading indicators that are helping you feel better about like the parts that aren't doing well bottoming?\n\nLouis Vernon Pinkham\n\nYes. So I would refer you back to some of the statements that Rob made earlier on. And so factory automation makes up about 35% in that segment. And our funnel is up 50%, our win rates up about 300 basis points. And our -- we're seeing a book bill in that segment coming out of first quarter of 1.08. So all of this is giving us more confidence in the second half. And so yes, that's really why we're guiding what we're guiding for second half sales.\n\nOperator\n\nThis concludes the question-and-answer session. I'd like to turn the conference back over to Louis Pinkham for any closing remarks.\n\nLouis Vernon Pinkham\n\nThank you, operator, and thanks to our investors and analysts for joining us today. I would like to conclude where I began with our evolved purpose. Through highly intentional actions, we have made tremendous progress transforming what had been Regal Beloit into the Regal Rexnord we are today. A powerful portfolio comprised of wider moat products serving a stronger mix of more durable secular markets. Our one global Regal Rexnord team is excited about the many opportunities this portfolio presents. And I am confident that we are better positioned than ever before to create a better tomorrow for all of our key stakeholders with sustainable solutions that power, transmit and control motion. And by doing so, we can achieve the win-win objectives of giving back to our communities and our planet in driving profitable growth. \r\nIn short, tremendous opportunities for our associates, for our customers and for our shareholders and an exciting time for Regal Rexnord. Thank you again for joining us today, and thank you for your interest in Regal. Have a good day.\n\nOperator\n\nThank you for attending today. You may now disconnect.\n\nView comments",
        "link": "https://finance.yahoo.com/news/q1-2024-regal-rexnord-corp-043043409.html",
        "symbols": [
            "B1X.F",
            "RB8.F",
            "RBC.US",
            "RRX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.033,
            "neu": 0.82,
            "pos": 0.147
        }
    },
    {
        "date": "2024-05-07T15:43:00+00:00",
        "title": "John Bean (JBT) Q1 Earnings Surpass Estimates, Increase Y/Y",
        "content": "John Bean Technologies Corporation JBT reported first-quarter 2024 adjusted earnings from continuing operations of 85 cents per share, up 39% from the year-ago quarter, reflecting cost savings from its supply-chain initiatives and restructuring program. The figure beat the Zacks Consensus Estimate of earnings of 82 cents per share.\n\nOn a reported basis, the company’s earnings per share (from continuing operations) were 71 cents, a 34% improvement from the year-ago quarter’s 53 cents.\n\nRevenues of $392 million were up 1% from the year-ago quarter. The top-line missed the Zacks Consensus Estimate of $397 million.\n\nJohn Bean Technologies Corporation Price, Consensus and EPS Surprise John Bean Technologies Corporation Price, Consensus and EPS Surprise\n\nJohn Bean Technologies Corporation price-consensus-eps-surprise-chart | John Bean Technologies Corporation Quote\n\nThe cost of sales dipped 1.4% year over year to $252 million. Gross profit was up 5.6% year over year to $140 million. The gross margin was 35.8% compared with the year-earlier quarter’s figure of 34.2%.\n\nSelling, general and administrative expenses were up 6.2% year over year to $110 million. Adjusted operating profit increased 13% to $37 million from the year-ago quarter’s $32.6 million. Adjusted operating margin was 9.4%, a 100-basis point expansion from the first quarter of 2023.\n\nAdjusted EBITDA was around $57 million, reflecting a year-over-year increase of 6%. Adjusted EBITDA margin was 14.6% compared with the year-ago quarter’s 14%.\n\nThe company completed its restructuring program in the quarter, thus incurring an expense of $1 million. Its cumulative expense runs to approximately $18 million. John Bean Technologies has realized approximately $4 million in restructuring savings during the quarter and is on track to achieve cumulative annual run-rate cost savings of approximately $18 million.\n\nJBT’s backlog totaled $664 million at the end of the first quarter, a 2% decline from the backlog of $678 million at the first-quarter 2023 end. Orders were down 4% year over year to $389 million reflecting weak markets in North America, including timing of warehouse automation orders and continuation of the slower investment profile in the poultry market.\n\nCash Position and Balance Sheet\n\nJohn Bean Technologies reported cash and cash equivalents of $479 million at the end of the first quarter compared with $483 million at the end of 2023. The company generated around $10 million in cash from continuing operating activities compared with $11 million in the prior-year quarter. Free cash flow was an inflow of $0.7 million against an outflow of $4.5 million in the first quarter of 2023.\n\nStory continues\n\nThe company’s total debt was $647 million as of Mar 31, 2024, up from $646 million as of Dec 31, 2023.\n\nGuidance for 2024\n\nThe company expects revenues between $1.735 billion and $1.765 billion for 2024. The midpoint of the range indicates year-over-year growth of 5%. JBT expects organic growth in the range of 4% to 6%.\r\n\r\nIncome from continuing operations is likely to be between $142 million and $154 million. Adjusted EBITDA is forecasted in the range of $295 - $310 million, indicating year-over-year growth of 11% at the midpoint. EBITDA margin is likely to be between 17% and 17.5%. JBT had reported adjusted EBITDA margin of 16.4% in 2023.\n\nJohn Bean expects adjusted earnings per share between $5.05 and $5.45 in 2024.  The midpoint of the range suggests 28% year-over-year growth. Margins are expected to sequentially improve through the quarters reflecting improving market conditions and gains from strategic sourcing actions.\n\nUpdate on JBT’s Pending Combination With Marel\n\nOn Apr 4, 2024, JBT and Marel executed a definitive transaction agreement related to JBT’s previously announced intention to make a voluntary takeover offer for the issued and outstanding shares of Marel. Both parties have completed confirmatory due diligence. Subject to regulatory clearance procedures, John Bean continues to expect to close the transaction by the end of 2024.\n\nThe proposed merger will unite two renowned companies with complementary product portfolios, well-known brands and advanced technology. The combined company, which is expected to be named JBT Marel Corporation, is poised to become a leading and diversified global food and beverage technology solutions provider. Anticipated benefits of the merger include significant cost synergies exceeding $125 million within three years. JBT Marel is also expected to benefit from additional revenue synergies, given attractive cross-selling, go-to-market effectiveness, scaled innovation and enhanced global customer care capabilities.\n\nPrice Performance\n\nJohn Bean’s shares have declined 12.5% in the past year against the industry’s 19.4% growth. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nHow Did JBT’s Industry Peers Fare in Q1?\n\nPentair plc PNR reported first-quarter 2024 adjusted earnings per share of 94 cents, beating the Zacks Consensus Estimate of 90 cents. The bottom line improved 3% from the year-ago quarter attributed to favorable mix and price and gains from transformation initiatives.\n\nPentair’s net sales dipped 1% year over year to $1.02 billion which outpaced the consensus estimate of $1 billion. Excluding the impacts of acquisitions, divestitures and currency translation, core sales declined 1%.\r\n\r\nZebra Technologies Corporation ZBRA reported first-quarter adjusted earnings of $2.84 per share, which slumped 28% year over year owing to broad-based softness across its end markets. Earnings per share beat the Zacks Consensus Estimate of $2.46.\n\nTotal revenues of $1.2 billion surpassed the consensus estimate of $1.1 billion. The top line plunged 16.4% and consolidated organic net sales declined 16.8% year over year.\n\nZacks Rank & a Stock to Consider\n\nJohn Bean currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nRBC Bearings RBC is expected to release its second-quarter fiscal 2024 results on May 17. RBC earnings have outpaced the Zacks Consensus Estimate in three of the trailing four quarters while falling short on one occasion, the average surprise being 6.4%.\r\n\r\nThe consensus estimate for the company’s earnings per share is pegged at $2.32 for the quarter, suggesting 9% growth from the year-ago reported figure. The consensus mark for total revenues is pinned at $413 million, indicating a year-over-year rise of 4.8%.  RBC Bearings currently carries a Zacks Rank #2 (Buy).\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nRBC Bearings Incorporated (RBC) : Free Stock Analysis Report\n\nPentair plc (PNR) : Free Stock Analysis Report\n\nJohn Bean Technologies Corporation (JBT) : Free Stock Analysis Report\n\nZebra Technologies Corporation (ZBRA) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/john-bean-jbt-q1-earnings-154300122.html",
        "symbols": [
            "0Y5X.LSE",
            "B1X.F",
            "JBT.BE",
            "JBT.F",
            "JBT.STU",
            "JBT.US",
            "PNR.US",
            "PNT.F",
            "PNT.STU",
            "RB8.F",
            "RBC.US",
            "RRX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.016,
            "neu": 0.871,
            "pos": 0.113
        }
    },
    {
        "date": "2024-04-30T20:00:00+00:00",
        "title": "RBC Bearings to Webcast Fourth Quarter Fiscal Year 2024 Earnings Conference Call May 17th",
        "content": "Webcast is Live at 11:00 a.m. (ET)\n\nOXFORD, Conn., April 30, 2024--(BUSINESS WIRE)--RBC Bearings Incorporated (NYSE: RBC, RBCP), a leading international manufacturer of highly engineered precision bearings, components and essential systems for the industrial, defense and aerospace industries, today announced that it will release its fourth quarter fiscal 2024 financial results before the market opens on Friday, May 17th. RBC Bearings will host a conference call to discuss the results on Friday, May 17th at 11:00 a.m. ET.\n\nDr. Michael J. Hartnett, Chairman, President and Chief Executive Officer; Daniel A. Bergeron, Vice President and Chief Operating Officer; and Robert M. Sullivan, Vice President and Chief Financial Officer will recap the quarter’s results and accomplishments. To access the webcast, go to the investor relations portion of the Company’s website, www.rbcbearings.com, on the day of the conference call and click on the webcast link.\n\nIf you do not have access to the Internet and wish to listen to the call, dial 877-407-4019 (international callers dial +1 201-689-8337) and provide conference ID # 13746497. An audio replay of the call will be available from 2:00 p.m. ET May 17th, 2024, until 2:00 p.m. ET May 31st, 2024. The replay can be accessed by dialing 877-660-6853 (international callers dial +1 201-612-7415) and providing conference ID # 13746497. Investors are advised to dial into the call at least ten minutes prior to the call to register.\n\nAbout RBC Bearings\n\nRBC Bearings Incorporated is an international manufacturer and marketer of highly engineered precision bearings, components and essential systems. Founded in 1919, the Company is primarily focused on producing highly technical or regulated bearing products and components requiring sophisticated design, testing, and manufacturing capabilities for the diversified industrial, aerospace and defense markets. The Company is headquartered in Oxford, Connecticut.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240430031113/en/\n\nContacts\n\nRBC Bearings\r\nRobert Moffatt\r\n203-267-5037\r\nrmoffatt@rbcbearings.com\n\nAlpha IR Group\r\nMichael Cummings\r\n617-461-1101\r\ninvestors@rbcbearings.com\n\nView comments",
        "link": "https://finance.yahoo.com/news/rbc-bearings-webcast-fourth-quarter-200000187.html",
        "symbols": [
            "B1X.F",
            "RBC.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.872,
            "neg": 0,
            "neu": 0.962,
            "pos": 0.038
        }
    },
    {
        "date": "2024-04-30T12:35:00+00:00",
        "title": "4 Stocks to Gain From the Promising Industrial Manufacturing Industry",
        "content": "The Zacks Manufacturing – General Industrial industry is poised for growth on the back of the recovery in domestic and export orders for industrial products and the surge in the e-commerce business. Efforts to digitalize business operations have been enhancing the industry players' competitiveness.\n\nStrength in end markets, along with improvement in the supply chain, is expected to foster the industry’s growth. Industry players bank on frequent innovation investments to stay competitive in the market. Ingersoll Rand Inc. IR, RBC Bearings Incorporated RBC, Applied Industrial Technologies, Inc. AIT and Chart Industries, Inc. GTLS are a few industry participants that might capitalize on these opportunities.\n\nAbout the Industry\n\nThe Zacks Manufacturing – General Industrial industry comprises companies that produce a wide range of industrial equipment. Some industry players offer power transmission products, bearings, engineered fluid power components and systems, industrial rubber products, vapor-abrasive blasting equipment, vehicle-powered truck refrigeration systems, adhesive, gel coat equipment, flow-control components and linear motion components. Industrial manufacturing companies also reconstruct and assemble pumps, valves, speed reducers and hydraulic motors. The companies provide services to original equipment manufacturing and maintenance, repair and overhaul customers. These end users belong to the mining, oil and gas, forest products, agriculture and food processing, fabricated metals, chemicals and petrochemicals, transportation and utilities industries.\n\n4 Trends Shaping the Future of the Manufacturing General Industrial Industry\n\nFavorable Trends:  The industry has been benefiting from the recovery in manufacturing activities, supported by a rise in domestic and export orders for industrial products. Industrial production increased by 0.4% in March 2024 for the second successive month, with a 0.5% rise in manufacturing output. The ISM’s manufacturing index registered 50.3% in March 2024, indicating expansion of the U.S. manufacturing activity. In March, the New Order Index returned to expansion territory, with an increase of 2.2 percentage points from the previous month’s levels. The uptick in new orders, in conjunction with the slowdown in inflation, augurs well for industrial manufacturing companies.\r\n\r\nEasing Supply-Chain Disruptions: While supply-chain disruptions persist, primarily related to the availability of electronic components, the situation has improved, as evident from the ISM report’s Supplier Deliveries Index, which reflected faster deliveries in March. Easing supply-chain issues should support industrial manufacturing companies’ growth in 2024. An anticipated reduction in raw material costs should aid the bottom line of the industry participants.\r\n\r\nTechnological Advancement Benefits: The U.S. industrial manufacturing companies have been focused on digitizing their business operations with new technologies and business models. Digitization has been enabling several manufacturers to boost their competitiveness with enhanced operational productivity, product quality and lower costs. A surge in the e-commerce business has been proving beneficial for the companies.\r\n\r\nHigh Leverage: The companies bank on the frequent upgrade of products and services to stay competitive in the market, thus making steady investments necessary. However, these frequent investments adversely impact the margins and profitability of the companies. These firms often make acquisitions to strengthen their businesses, expand their product portfolio and extend their regional presence. Such frequent investments usually leave many companies with a highly-leveraged balance sheet.\n\nStory continues\n\nZacks Industry Rank Indicates Bright Prospects\n\nThe Zacks Manufacturing – General Industrial industry, housed within the broader Zacks Industrial Products sector, currently carries a Zacks Industry Rank #69. This rank places it in the top 27% of more than 250 Zacks industries.\r\n\r\nThe group’s Zacks Industry Rank, which is basically the average of the Zacks Rank of all the member stocks, indicates bright near-term prospects. Our research shows that the top 50% of the Zacks-ranked industries outperform the bottom 50% by a factor of more than 2 to 1.\r\n\r\nThe industry’s positioning in the top 50% of the Zacks-ranked industries is a result of solid earnings prospects for the constituent companies in aggregate. Looking at the aggregate earnings estimate revision, it appears that analysts are keeping more faith in this group's earnings growth potential. The industry’s earnings estimates for the current year have moved up 2.7% in the past year.\r\n\r\nGiven the industry’s bright near-term prospects, we will present a few stocks worth considering for your portfolio. But before that, it is worth taking a look at the industry’s stock market performance and current valuation.\n\nIndustry Outperforms Both Sector & S&P\n\nThe Zacks Manufacturing – General Industrial industry has outperformed both the broader sector and the Zacks S&P 500 composite index over the past year.\r\n\r\nOver this period, the industry has appreciated 27% compared with the sector and the S&P 500 Index’s growth of 23.6% and 23.5%, respectively.\n\nOne-Year Price Performance\n\nIndustry's Current Valuation\n\nOn the basis of forward 12-month Price-to-Earnings (P/E), which is a commonly used multiple for valuing manufacturing stocks, the industry is currently trading at 22.02X compared with the S&P 500’s 20.75X. It is also above the sector’s P/E ratio of 18.26X.\r\n\r\nIn the past five years, the industry has traded as high as 26.92X, as low as 15.92X and at the median of 20.81X, as the chart below shows.\n\nPrice-to-Earnings Ratio\n\nPrice-to-Earnings Ratio\n\n4 Manufacturing-General Industrial Stocks Leading the Pack\n\nApplied Industrial Technologies: Based in Cleveland, OH, the company is a distributor of value-added industrial products — including engineered fluid power components, bearings, specialty flow-control solutions and power transmission products. It is poised to benefit from strength across the food and beverage, lumber and wood, mining and refining end markets. Also, AIT’s product development initiative, buyouts and shareholder-friendly policies raise its attractiveness. For fiscal 2024, Applied Industrial predicts year-over-year sales growth of 1-3%.\r\n\r\nThe Zacks Rank #1 (Strong Buy) company reported better-than-expected results in each of the last four quarters, the earnings surprise being 8.2%, on average.  You can see the complete list of today’s Zacks #1 Rank stocks here.  In the past 60 days, the company’s earnings estimates have increased 1.2% for fiscal 2024 (ending June 2024). It has gained 39.3% in the past year.\n\nPrice and Consensus: AIT\n\nChart Industries: Headquartered in Ball Ground, GA, Chart Industries specializes in engineering and manufacturing process technologies and equipment for gas and liquid molecules in the United States and abroad. The company is expected to benefit from its record backlog level along with strength in key end markets like hydrogen, small-scale LNG, water treatment, traditional energy, clean mining and carbon capture.\r\n\r\nThe Zacks Rank #1 company reported better-than-expected results thrice in the last four quarters, the earnings surprise being 75.9%, on average. The Zacks Consensus Estimate for GTLS’ 2024 earnings has been revised upward by 6.4% in the past 60 days. Shares of this company have gained 15.8% in the past year.\n\nPrice and Consensus: GTLS\n\nIngersoll Rand: Headquartered in Davidson, NC, Ingersoll Rand is a global industrial company with expertise in industrial and mission-critical flow creation technologies. The company is poised to benefit from its solid product portfolio, innovation capabilities and focus on boosting aftermarket businesses. Higher orders for compressors, industrial vacuums and blowers are likely to drive its performance in the quarters ahead.\r\n\r\nThe Zacks Rank #2 (Buy) company reported better-than-expected results in each of the last four quarters, the earnings surprise being 15.9%, on average. The Zacks Consensus Estimate for Ingersoll Rand’s 2024 earnings has been revised upward by 1.6% in the past 60 days. The company’s shares have gained 63.5% in the past year.\n\nPrice and Consensus: IR\n\nRBC Bearings: Based in Oxford, CT, RBC Bearings is a leading manufacturer and distributor of engineered bearings and precision components. The company stands to gain from strength in its Aerospace segment. Solid momentum in the commercial aerospace market, driven by the recovery in build rates from large OEMs (original equipment manufacturers) and stability in the aftermarket business, bodes well for the company.\r\n\r\nThe Zacks Rank #2 company reported better-than-expected results thrice in the trailing four quarters, the earnings surprise being 6.4%, on average. Shares of this company have gained 6.8% in the past year.\n\nPrice and Consensus: RBC\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nRBC Bearings Incorporated (RBC) : Free Stock Analysis Report\n\nApplied Industrial Technologies, Inc. (AIT) : Free Stock Analysis Report\n\nIngersoll Rand Inc. (IR) : Free Stock Analysis Report\n\nChart Industries, Inc. (GTLS) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/4-stocks-gain-promising-industrial-123500126.html",
        "symbols": [
            "5GD.F",
            "AIT.US",
            "AT4.BE",
            "AT4.F",
            "B1X.F",
            "GTLS.US",
            "I3N.BE",
            "I3N.F",
            "I3N.STU",
            "IR.US",
            "RB8.F",
            "RBC.US",
            "RRX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.008,
            "neu": 0.846,
            "pos": 0.146
        }
    },
    {
        "date": "2024-04-16T15:08:00+00:00",
        "title": "RBC Bearings (RBC) Exhibits Strong Prospects Despite Headwinds",
        "content": "RBC Bearings Incorporated RBC is benefiting from the strong performance of the Aerospace/Defense segment. Strength in commercial aerospace, driven by the recovery in build rates from large OEMs (original equipment manufacturer), and stability in the aftermarket are driving the Aerospace/Defense segment. The company is also poised to benefit from its product development initiatives and robust demand for large planes like the Airbus 737, 787, A320 and A330 principally, in the quarters ahead. Additional volume increases, driven by RBC Bearings’ space initiatives, are also likely to be beneficial.\r\n\r\nRBC has been strengthening its business through acquisitions. The company acquired Carson City, NV-based precision bearings manufacturer Specline, Inc. in August 2023. The transaction was valued at $18.7 million. Specline’s unique bearing and manufacturing processes expanded RBC Bearings’ aerospace product offerings and boosted the company’s production capacity.\r\n\r\nThe company remains committed to rewarding its shareholders through dividend payments and share buybacks. In the first nine months of fiscal 2024 (ended December 2023), the company paid dividends of $17.3 million, almost flat year over year, and repurchased shares for $7.6 million, increasing 15.4% year over year. RBC Bearings repurchased shares worth $7.7 million and distributed preferred dividends worth $22.9 million in fiscal 2023.\r\n\r\nHowever, weakness in the semiconductor market is worrisome for RBC Bearings’ Industrial segment. The segment’s revenues decreased 0.6% year over year in the fiscal third quarter. Also, weakness in the aggregate and general industrial end markets is concerning as well.\r\n\r\nRBC Bearings is currently dealing with the rising cost of sales. In the first nine months of fiscal 2024, the company’s cost of sales jumped 2.8% year over year due to increasing raw material costs. Selling, general and administrative expenses increased 11.2%, year over year, in the same period due to increased personnel costs, freight costs, IT costs and other professional fees. In fiscal 2023, its cost of sales increased 47.6% year over year, while selling, general and administrative expenses were up 37.1%. High costs and expenses, if uncontrolled, may adversely impact the company’s margins and profitability in the quarters ahead.\r\n\r\nIn the past year, this current Zacks Rank #3 (Hold) company’s shares have gained 14.3% compared with the industry’s 29% growth. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nStocks to Consider\n\nSome better-ranked companies from the Industrial Products sector are discussed below:\r\n\r\nApplied Industrial Technologies, Inc. AIT presently sports a Zacks Rank #1 (Strong Buy). It has a trailing four-quarter average earnings surprise of 10.4%. You can see the complete list of today’s Zacks #1 Rank stocks here.\r\n\r\nThe Zacks Consensus Estimate for AIT’s fiscal 2024 earnings has increased 2.5% in the past 60 days. The stock has gained 38.5% in the past year.\r\n\r\nCaterpillar Inc. CAT presently carries a Zacks Rank #2 (Buy) and a trailing four-quarter earnings surprise of 19.7%, on average.\r\n\r\nCAT’s earnings estimates have increased 0.7% for 2024 in the past 60 days. Shares of Caterpillar have risen 61.5% in the past year.\r\n\r\nA. O. Smith Corporation AOS presently carries a Zacks Rank of 2. It has a trailing four-quarter average earnings surprise of 12%.\r\n\r\nThe Zacks Consensus Estimate for AOS’ 2024 earnings increased 0.5% in the past 60 days. Shares of A. O. Smith have soared 26% in the past year.\n\nStory continues\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nCaterpillar Inc. (CAT) : Free Stock Analysis Report\n\nA. O. Smith Corporation (AOS) : Free Stock Analysis Report\n\nRBC Bearings Incorporated (RBC) : Free Stock Analysis Report\n\nApplied Industrial Technologies, Inc. (AIT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/rbc-bearings-rbc-exhibits-strong-150800132.html",
        "symbols": [
            "B1X.F",
            "CAT.MX",
            "CAT.US",
            "CAT1.BE",
            "CAT1.DU",
            "CAT1.F",
            "CAT1.HM",
            "CAT1.MU",
            "CAT1.STU",
            "CAT1.XETRA",
            "CATP34.SA",
            "CATR.PA",
            "RB8.F",
            "RBC.US",
            "RRX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.02,
            "neu": 0.831,
            "pos": 0.149
        }
    },
    {
        "date": "2024-04-08T19:34:38+00:00",
        "title": "RBC Bearings Incorporated's (NYSE:RBC) Intrinsic Value Is Potentially 19% Below Its Share Price",
        "content": "Key Insights\n\nRBC Bearings' estimated fair value is US$216 based on 2 Stage Free Cash Flow to Equity RBC Bearings' US$266 share price signals that it might be 23% overvalued Our fair value estimate is 24% lower than RBC Bearings' analyst price target of US$286\n\nToday we will run through one way of estimating the intrinsic value of RBC Bearings Incorporated (NYSE:RBC) by taking the forecast future cash flows of the company and discounting them back to today's value. Our analysis will employ the Discounted Cash Flow (DCF) model. It may sound complicated, but actually it is quite simple!\n\nWe would caution that there are many ways of valuing a company and, like the DCF, each technique has advantages and disadvantages in certain scenarios. If you still have some burning questions about this type of valuation, take a look at the Simply Wall St analysis model.\n\nView our latest analysis for RBC Bearings\n\nThe Calculation\n\nWe're using the 2-stage growth model, which simply means we take in account two stages of company's growth. In the initial period the company may have a higher growth rate and the second stage is usually assumed to have a stable growth rate. To start off with, we need to estimate the next ten years of cash flows. Seeing as no analyst estimates of free cash flow are available to us, we have extrapolate the previous free cash flow (FCF) from the company's last reported value. We assume companies with shrinking free cash flow will slow their rate of shrinkage, and that companies with growing free cash flow will see their growth rate slow, over this period. We do this to reflect that growth tends to slow more in the early years than it does in later years.\n\nA DCF is all about the idea that a dollar in the future is less valuable than a dollar today, so we discount the value of these future cash flows to their estimated value in today's dollars:\n\n10-year free cash flow (FCF) forecast\n\n2024 2025 2026 2027 2028 2029 2030 2031 2032 2033 Levered FCF ($, Millions)  US$258.1m US$285.8m US$309.3m US$329.2m US$346.2m US$361.2m US$374.6m US$386.9m US$398.4m US$409.5m Growth Rate Estimate Source Est @ 14.35% Est @ 10.73% Est @ 8.20% Est @ 6.43% Est @ 5.19% Est @ 4.32% Est @ 3.71% Est @ 3.28% Est @ 2.99% Est @ 2.78% Present Value ($, Millions) Discounted @ 7.5%  US$240 US$248 US$249 US$247 US$242 US$235 US$226 US$218 US$209 US$200\n\n(\"Est\" = FCF growth rate estimated by Simply Wall St)\r\nPresent Value of 10-year Cash Flow (PVCF) = US$2.3b\n\nStory continues\n\nAfter calculating the present value of future cash flows in the initial 10-year period, we need to calculate the Terminal Value, which accounts for all future cash flows beyond the first stage. The Gordon Growth formula is used to calculate Terminal Value at a future annual growth rate equal to the 5-year average of the 10-year government bond yield of 2.3%. We discount the terminal cash flows to today's value at a cost of equity of 7.5%.\n\nTerminal Value (TV)= FCF2033 × (1 + g) ÷ (r – g) = US$409m× (1 + 2.3%) ÷ (7.5%– 2.3%) = US$8.1b\n\nPresent Value of Terminal Value (PVTV)= TV / (1 + r)10= US$8.1b÷ ( 1 + 7.5%)10= US$4.0b\n\nThe total value is the sum of cash flows for the next ten years plus the discounted terminal value, which results in the Total Equity Value, which in this case is US$6.3b. The last step is to then divide the equity value by the number of shares outstanding. Compared to the current share price of US$266, the company appears slightly overvalued at the time of writing. Remember though, that this is just an approximate valuation, and like any complex formula - garbage in, garbage out. dcf\n\nImportant Assumptions\n\nThe calculation above is very dependent on two assumptions. The first is the discount rate and the other is the cash flows. Part of investing is coming up with your own evaluation of a company's future performance, so try the calculation yourself and check your own assumptions. The DCF also does not consider the possible cyclicality of an industry, or a company's future capital requirements, so it does not give a full picture of a company's potential performance. Given that we are looking at RBC Bearings as potential shareholders, the cost of equity is used as the discount rate, rather than the cost of capital (or weighted average cost of capital, WACC) which accounts for debt. In this calculation we've used 7.5%, which is based on a levered beta of 1.122. Beta is a measure of a stock's volatility, compared to the market as a whole. We get our beta from the industry average beta of globally comparable companies, with an imposed limit between 0.8 and 2.0, which is a reasonable range for a stable business.\n\nSWOT Analysis for RBC Bearings\n\nStrength\n\nEarnings growth over the past year exceeded the industry.\n\nDebt is well covered by earnings and cashflows.\n\nWeakness\n\nExpensive based on P/E ratio and estimated fair value.\n\nOpportunity\n\nAnnual earnings are forecast to grow faster than the American market.\n\nThreat\n\nAnnual revenue is forecast to grow slower than the American market.\n\nNext Steps:\n\nValuation is only one side of the coin in terms of building your investment thesis, and it is only one of many factors that you need to assess for a company. DCF models are not the be-all and end-all of investment valuation. Rather it should be seen as a guide to \"what assumptions need to be true for this stock to be under/overvalued?\" For instance, if the terminal value growth rate is adjusted slightly, it can dramatically alter the overall result. Can we work out why the company is trading at a premium to intrinsic value? For RBC Bearings, we've put together three relevant factors you should assess:\n\nRisks: Case in point, we've spotted  1 warning sign for RBC Bearings you should be aware of. Future Earnings: How does RBC's growth rate compare to its peers and the wider market? Dig deeper into the analyst consensus number for the upcoming years by interacting with our free analyst growth expectation chart. Other Solid Businesses: Low debt, high returns on equity and good past performance are fundamental to a strong business. Why not explore our interactive list of stocks with solid business fundamentals to see if there are other companies you may not have considered!\n\nPS. Simply Wall St updates its DCF calculation for every American stock every day, so if you want to find the intrinsic value of any other stock just search here.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.",
        "link": "https://finance.yahoo.com/news/rbc-bearings-incorporateds-nyse-rbc-193438126.html",
        "symbols": [
            "B1X.F",
            "RB8.F",
            "RBC.US",
            "RRX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.029,
            "neu": 0.798,
            "pos": 0.172
        }
    },
    {
        "date": "2024-03-23T13:58:56+00:00",
        "title": "Why RBC Bearings Incorporated (NYSE:RBC) Could Be Worth Watching",
        "content": "RBC Bearings Incorporated (NYSE:RBC), is not the largest company out there, but it saw significant share price movement during recent months on the NYSE, rising to highs of US$286 and falling to the lows of US$258. Some share price movements can give investors a better opportunity to enter into the stock, and potentially buy at a lower price. A question to answer is whether RBC Bearings' current trading price of US$265 reflective of the actual value of the mid-cap? Or is it currently undervalued, providing us with the opportunity to buy? Let’s take a look at RBC Bearings’s outlook and value based on the most recent financial data to see if there are any catalysts for a price change.\n\nView our latest analysis for RBC Bearings\n\nWhat's The Opportunity In RBC Bearings?\n\nThe stock is currently trading at US$265 on the share market, which means it is overvalued by 22% compared to our intrinsic value of $217.07. This means that the opportunity to buy RBC Bearings at a good price has disappeared! If you like the stock, you may want to keep an eye out for a potential price decline in the future. Given that RBC Bearings’s share is fairly volatile (i.e. its price movements are magnified relative to the rest of the market) this could mean the price can sink lower, giving us another chance to buy in the future. This is based on its high beta, which is a good indicator for share price volatility.\n\nWhat does the future of RBC Bearings look like? earnings-and-revenue-growth\n\nInvestors looking for growth in their portfolio may want to consider the prospects of a company before buying its shares. Although value investors would argue that it’s the intrinsic value relative to the price that matter the most, a more compelling investment thesis would be high growth potential at a cheap price. With profit expected to grow by 26% over the next year, the near-term future seems bright for RBC Bearings. It looks like higher cash flow is on the cards for the stock, which should feed into a higher share valuation.\n\nStory continues\n\nWhat This Means For You\n\nAre you a shareholder? It seems like the market has well and truly priced in RBC’s positive outlook, with shares trading above its fair value. However, this brings up another question – is now the right time to sell? If you believe RBC should trade below its current price, selling high and buying it back up again when its price falls towards its real value can be profitable. But before you make this decision, take a look at whether its fundamentals have changed.\n\nAre you a potential investor? If you’ve been keeping tabs on RBC for some time, now may not be the best time to enter into the stock. The price has surpassed its true value, which means there’s no upside from mispricing. However, the optimistic prospect is encouraging for RBC, which means it’s worth diving deeper into other factors in order to take advantage of the next price drop.\n\nSo if you'd like to dive deeper into this stock, it's crucial to consider any risks it's facing. Case in point: We've spotted 1 warning sign for RBC Bearings you should be aware of.\n\nIf you are no longer interested in RBC Bearings, you can use our free platform to see our list of over 50 other stocks with a high growth potential.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.",
        "link": "https://finance.yahoo.com/news/why-rbc-bearings-incorporated-nyse-135856468.html",
        "symbols": [
            "B1X.F",
            "RB8.F",
            "RBC.US",
            "RRX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.044,
            "neu": 0.738,
            "pos": 0.219
        }
    },
    {
        "date": "2024-03-13T18:02:00+00:00",
        "title": "Here's Why Hold Strategy is Apt for RBC Bearings (RBC) Stock",
        "content": "RBC Bearings Incorporated RBC has been benefiting from strength in the Aerospace/Defense segment and accretive acquisitions, despite softness in the semiconductor market within the Industrial Segment and the rising cost of sales.\n\nWhat’s Aiding RBC?\n\nBusiness Strength: Strength in commercial aerospace, driven by the recovery in build rates from large OEMs (original equipment manufacturer), and stability in the aftermarket are aiding the Aerospace/Defense segment. The company is also poised to benefit from its product development initiatives and robust demand for large planes like the Airbus 737, 787, A320 and A330 principally, in the quarters ahead. Additional volume increases, driven by RBC Bearings’ space initiatives, are also likely to be beneficial.\r\n\r\nExpansion Efforts: RBC has expanded its reach with the acquisition of Carson City, NV-based precision bearings manufacturer Specline, Inc. in August 2023. Specline’s unique bearing and manufacturing processes expanded RBC Bearings’ aerospace product offerings and boosted the company’s production capacity.\r\n\r\nRewards to Shareholders: RBC’s measures to reward its shareholders through dividend payments are noteworthy. In the first nine months of fiscal 2024 (ended December 2023), the company paid dividends of $17.3 million, almost flat year over year, and repurchased shares for $7.6 million, increasing 15.4% year over year.\r\n\r\nIn light of the above-mentioned positives, we believe, investors should retain RBC stock for now, as suggested by its current Zacks Rank #3 (Hold). In the past year, shares of the company have gained 19%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nStocks to Consider\n\nSome better-ranked companies from the Industrial Products sector are discussed below:\r\n\r\nAtmus Filtration Technologies Inc. ATMU presently sports a Zacks Rank #1 (Strong Buy) and a trailing four-quarter earnings surprise of 20.3%, on average. You can see the complete list of today’s Zacks #1 Rank stocks here.\r\n\r\nATMU’s earnings estimates have increased 2.9% for 2024 in the past 60 days. Shares of Atmus Filtration have risen 17.2% in the past year.\r\n\r\nTetra Tech, Inc. TTEK currently carries a Zacks Rank #2 (Buy). It delivered a trailing four-quarter average earnings surprise of 14.4%.\r\n\r\nIn the past 60 days, the Zacks Consensus Estimate for TTEK’s fiscal 2024 earnings has increased 2.9%. The stock has soared 31.2% in the past year.\r\n\r\nApplied Industrial Technologies, Inc. AIT presently has a Zacks Rank of 2. It has a trailing four-quarter average earnings surprise of 10.4%.\r\n\r\nThe Zacks Consensus Estimate for AIT’s fiscal 2024 earnings has increased 1.7% in the past 60 days. The stock has gained 34.8% in the past year.\n\nStory continues\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nTetra Tech, Inc. (TTEK) : Free Stock Analysis Report\n\nRBC Bearings Incorporated (RBC) : Free Stock Analysis Report\n\nApplied Industrial Technologies, Inc. (AIT) : Free Stock Analysis Report\n\nAtmus Filtration Technologies Inc. (ATMU) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research",
        "link": "https://finance.yahoo.com/news/heres-why-hold-strategy-apt-180200304.html",
        "symbols": [
            "B1X.F",
            "RB8.F",
            "RBC.US",
            "RRX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.003,
            "neu": 0.846,
            "pos": 0.151
        }
    },
    {
        "date": "2024-03-12T20:01:00+00:00",
        "title": "RBC Bearings to Participate in the Bank of America Global Industrials Conference",
        "content": "OXFORD, Conn., March 12, 2024--(BUSINESS WIRE)--RBC Bearings Incorporated (NYSE: RBC, RBCP), a leading international manufacturer of highly engineered precision bearings, components and essential systems for the industrial, defense and aerospace industries, today announced that it will participate in the Bank of America Global Industrials Conference on March 19, 2024, at the Landmark Hotel in London. Materials shared during the conference will be available online at: http://investor.rbcbearings.com.\n\nVice President and Chief Operating Officer, Daniel A. Bergeron, will be representing the Company in-person.\n\nAbout RBC Bearings\n\nRBC Bearings Incorporated is an international manufacturer and marketer of highly engineered precision bearings, components and essential systems. Founded in 1919, the Company is primarily focused on producing highly technical or regulated bearing products and components requiring sophisticated design, testing, and manufacturing capabilities for the diversified industrial, aerospace, and defense markets. The Company is headquartered in Oxford, Connecticut.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240312927874/en/\n\nContacts\n\nRBC Bearings\r\nRobert M. Sullivan\r\n203-267-5014\n\nAlpha IR Group\r\nMichael Cummings\r\n617-461-1101\r\ninvestors@rbcbearings.com\n\nView comments",
        "link": "https://finance.yahoo.com/news/rbc-bearings-participate-bank-america-200100858.html",
        "symbols": [
            "B1X.F",
            "RBC.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.872,
            "neg": 0,
            "neu": 0.924,
            "pos": 0.076
        }
    },
    {
        "date": "2024-02-24T08:10:55+00:00",
        "title": "RBC Bearings Inc Vice President and COO Daniel Bergeron Sells 15,000 Shares",
        "content": "Daniel Bergeron, Vice President and COO of RBC Bearings Inc (NYSE:RBC), executed a sale of 15,000 shares in the company on February 21, 2024, according to a recent SEC Filing.\n\nWarning! GuruFocus has detected 6 Warning Signs with RBC.\n\nRBC Bearings Inc is an international manufacturer and marketer of highly engineered precision bearings and components. The company's products are integral to the manufacture and operation of most machines, aircraft, and mechanical systems, to reduce wear to moving parts, facilitate proper power transmission, reduce damage and energy loss caused by friction, and control pressure and flow. With a diverse product portfolio, RBC Bearings serves a broad range of industries and customers worldwide.\n\nOver the past year, the insider has sold a total of 15,000 shares and has not made any purchases of the company's stock.\n\nThe insider transaction history for RBC Bearings Inc indicates a pattern of sales by insiders over the past year, with a total of 17 insider sells and no insider buys recorded during the period.\n\nOn the date of the insider's recent transaction, shares of RBC Bearings Inc were trading at $267.22, resulting in a market capitalization of $7.899 billion.\n\nThe stock's price-earnings ratio stands at 45.27, surpassing both the industry median of 21.72 and the company's own historical median price-earnings ratio.\n\nWith the current share price of $267.22 and a GuruFocus Value of $314.36, RBC Bearings Inc's price-to-GF-Value ratio is 0.85, suggesting that the stock is modestly undervalued according to the GF Value metric.\n\nThe GF Value is a proprietary intrinsic value estimate from GuruFocus, which is derived from historical trading multiples, a GuruFocus adjustment factor based on the company's past performance, and future business performance projections provided by Morningstar analysts. RBC Bearings Inc Vice President and COO Daniel Bergeron Sells 15,000 Shares RBC Bearings Inc Vice President and COO Daniel Bergeron Sells 15,000 Shares\n\nThis article, generated by GuruFocus, is designed to provide general insights and is not tailored financial advice. Our commentary is rooted in historical data and analyst projections, utilizing an impartial methodology, and is not intended to serve as specific investment guidance. It does not formulate a recommendation to purchase or divest any stock and does not consider individual investment objectives or financial circumstances. Our objective is to deliver long-term, fundamental data-driven analysis. Be aware that our analysis might not incorporate the most recent, price-sensitive company announcements or qualitative information. GuruFocus holds no position in the stocks mentioned herein.\n\nThis article first appeared on GuruFocus.",
        "link": "https://finance.yahoo.com/news/rbc-bearings-inc-vice-president-081055256.html",
        "symbols": [
            "B1X.F",
            "RB8.F",
            "RBC.US",
            "RRX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.742,
            "neg": 0.04,
            "neu": 0.901,
            "pos": 0.059
        }
    },
    {
        "date": "2024-02-23T22:00:00+00:00",
        "title": "RBC Bearings to Participate in the 14th Annual Alembic Global Advisors Investor Conference",
        "content": "OXFORD, Conn., February 23, 2024--(BUSINESS WIRE)--RBC Bearings Incorporated (NYSE: RBC, RBCP), a leading international manufacturer of highly engineered precision bearings, components and essential systems for the industrial, defense and aerospace industries, today announced that it will participate in the Alembic Global Advisors Investor Conference on February 28, 2024, in Deer Valley, Utah. Materials shared during the conference will be available online at: http://investor.rbcbearings.com.\n\nVice President and Chief Financial Officer, Robert M. Sullivan, will be representing the Company in-person.\n\nAbout RBC Bearings\n\nRBC Bearings Incorporated is an international manufacturer and marketer of highly engineered precision bearings, components and essential systems. Founded in 1919, the Company is primarily focused on producing highly technical or regulated bearing products and components requiring sophisticated design, testing, and manufacturing capabilities for the diversified industrial, aerospace, and defense markets. The Company is headquartered in Oxford, Connecticut.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240223372225/en/\n\nContacts\n\nRBC Bearings\r\nRobert M. Sullivan\r\n203-267-5014\n\nAlpha IR Group\r\nMichael Cummings\r\n617-461-1101",
        "link": "https://finance.yahoo.com/news/rbc-bearings-participate-14th-annual-220000131.html",
        "symbols": [
            "B1X.F",
            "RBC.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.863,
            "neg": 0,
            "neu": 0.929,
            "pos": 0.071
        }
    },
    {
        "date": "2024-02-11T13:15:06+00:00",
        "title": "RBC Bearings Incorporated Just Missed EPS By 17%: Here's What Analysts Think Will Happen Next",
        "content": "Last week, you might have seen that RBC Bearings Incorporated (NYSE:RBC) released its third-quarter result to the market. The early response was not positive, with shares down 3.5% to US$266 in the past week. It was not a great result overall. While revenues of US$374m were in line with analyst predictions, earnings were less than expected, missing statutory estimates by 17% to hit US$1.39 per share. Following the result, the analysts have updated their earnings model, and it would be good to know whether they think there's been a strong change in the company's prospects, or if it's business as usual. Readers will be glad to know we've aggregated the latest statutory forecasts to see whether the analysts have changed their mind on RBC Bearings after the latest results.\n\nSee our latest analysis for RBC Bearings  earnings-and-revenue-growth\n\nTaking into account the latest results, the consensus forecast from RBC Bearings' seven analysts is for revenues of US$1.67b in 2025. This reflects a decent 8.5% improvement in revenue compared to the last 12 months. Per-share earnings are expected to bounce 36% to US$8.20. In the lead-up to this report, the analysts had been modelling revenues of US$1.68b and earnings per share (EPS) of US$8.37 in 2025. The analysts seem to have become a little more negative on the business after the latest results, given the minor downgrade to their earnings per share numbers for next year.\n\nIt might be a surprise to learn that the consensus price target was broadly unchanged at US$280, with the analysts clearly implying that the forecast decline in earnings is not expected to have much of an impact on valuation. The consensus price target is just an average of individual analyst targets, so - it could be handy to see how wide the range of underlying estimates is. There are some variant perceptions on RBC Bearings, with the most bullish analyst valuing it at US$310 and the most bearish at US$250 per share. The narrow spread of estimates could suggest that the business' future is relatively easy to value, or thatthe analysts have a strong view on its prospects.\n\nStory continues\n\nTaking a look at the bigger picture now, one of the ways we can understand these forecasts is to see how they compare to both past performance and industry growth estimates. We would highlight that RBC Bearings' revenue growth is expected to slow, with the forecast 6.7% annualised growth rate until the end of 2025 being well below the historical 21% p.a. growth over the last five years. By way of comparison, the other companies in this industry with analyst coverage are forecast to grow their revenue at 3.3% annually. So it's pretty clear that, while RBC Bearings' revenue growth is expected to slow, it's still expected to grow faster than the industry itself.\n\nThe Bottom Line\n\nThe biggest concern is that the analysts reduced their earnings per share estimates, suggesting business headwinds could lay ahead for RBC Bearings. Happily, there were no major changes to revenue forecasts, with the business still expected to grow faster than the wider industry. The consensus price target held steady at US$280, with the latest estimates not enough to have an impact on their price targets.\n\nKeeping that in mind, we still think that the longer term trajectory of the business is much more important for investors to consider. At Simply Wall St, we have a full range of analyst estimates for RBC Bearings going out to 2026, and you can see them free on our platform here..\n\nThat said, it's still necessary to consider the ever-present spectre of investment risk.  We've identified 1 warning sign  with RBC Bearings , and understanding it should be part of your investment process.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.",
        "link": "https://finance.yahoo.com/news/rbc-bearings-incorporated-just-missed-131506006.html",
        "symbols": [
            "B1X.F",
            "RB8.F",
            "RBC.US",
            "RRX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.995,
            "neg": 0.026,
            "neu": 0.872,
            "pos": 0.101
        }
    }
]